const t={map:'[{"canvas":["0.0"],"一":["0.1"],"二":["0.2"],"三":["0.3"],"四":["0.4"],"五":["0.5"],"六":["0.6"],"七":["0.7"],"八":["0.8"],"九":["0.9"],"十":["0.10"],"属性":["1.0","3.0","5.0","7.0","10.0"],"方法":["1.4","2.0","4.1","6.0","8.0","9.0","10.7"],"文本方法":["5.4"]},{"0":["8.10","9.3"],"1":["1.1","1.5","2.1","3.1","4.2","5.1","5.5","6.1","7.1","8.1","9.1","10.1","10.8"],"2":["1.2","1.6","2.2","3.2","5.2","5.6","6.2","7.2","8.2","9.2","10.2","10.9"],"3":["1.3","1.7","2.3","5.3","5.7","6.3","7.3","8.3","9.3","10.3","10.10"],"4":["2.4","6.4","7.4","8.4","9.4","10.4","10.11"],"5":["2.5","8.5","9.5","10.5"],"6":["8.6","10.6"],"7":["8.7"],"8":["8.8"],"9":["8.9"],"10":["8.10"],"11":["8.11"],"12":["8.12"],"15":["11.0"],"16":["11.0"],"27":["11.0"],"30":["11.0"],"52":["11.0"],"2024":["4.0","11.0"],"api":["0.0"],"颜色":["0.1"],"样式和阴影":["0.1"],"属性":["0.1","0.6","0.8"],"描述":["0.1","0.4","0.8","4.2"],"线条样式":["0.2"],"矩形":["0.3"],"路径":["0.4"],"方法":["0.4","0.5"],"fill":["0.4","8.1"],"转换":["0.5"],"文本":["0.6"],"图像绘制":["0.7"],"像素操作":["0.8"],"width":["0.8"],"合成":["0.9"],"其他":["0.10"],"data":["1.3"],"作用":["1.3","1.5","1.6","1.7","2.5","3.1","3.2","4.2","5.1","5.2","5.3","5.5","5.6","6.1","6.2","6.3","6.4","7.1","7.2","7.4","8.1","8.4","8.6","8.8","8.9","8.10","8.11","8.12","9.1","9.3","9.4","9.5","10.1","10.2","10.5","10.6","10.8","10.9","10.10","10.11"],"返回一个对象":["1.3"],"其包含指定的":["1.3"],"imagedata":["1.3","1.5","1.7"],"createimagedata":["1.5"],"创建新的空白":["1.5"],"对象":["1.5","1.7"],"新对象默认像素值":["1.5"],"transparent":["1.5"],"black":["1.5"],"对于":["1.5"],"对象中的每个像素":["1.5"],"都存在着四方面的信息":["1.5"],"getimagedata":["1.6"],"返回":["1.6","2.5"],"putimagedata":["1.7"],"将图像数据":["1.7"],"从指定的":["1.7"],"todataurl":["2.5"],"canvas":["2.5"],"globalalpha":["3.1"],"设置或返回绘图的当前":["3.1"],"alpha":["3.1"],"globalcompositeoperation":["3.2"],"设置或返回新图像如何绘制到已有的图像上":["3.2"],"新图像":["3.2"],"您打算放置到画布上的绘图":["3.2"],"目标图像":["3.2"],"您已经放置在画布上的绘图":["3.2"],"date":["4.0","11.0"],"drawimage":["4.2"],"向画布上绘制图像":["4.2"],"画布或视频":["4.2"],"javascript":["4.2","5.1"],"语法":["4.2","5.1"],"用法":["4.2"],"font":["5.1"],"设置或返回文本内容当前的字体属性":["5.1"],"默认值":["5.1"],"10px":["5.1"],"sans":["5.1"],"serif":["5.1"],"context":["5.1"],"textalign":["5.2"],"设置或返回文本内容的当前对齐方式":["5.2"],"通常":["5.2"],"文本会从指定位置":["5.2"],"textbaseline":["5.3"],"设置或返回在绘制文本时使用的当前文本基线":["5.3"],"illustration":["5.3"],"filltext":["5.5"],"在画布上绘制":["5.5"],"被填充的":["5.5"],"stroketext":["5.6"],"在画布上绘制文本":["5.6"],"无填充色":["5.6"],"measuretext":["5.7"],"rect":["6.1"],"创建矩形":["6.1"],"fillrect":["6.2"],"创建":["6.2"],"strokerect":["6.3"],"绘制矩形":["6.3"],"clearrect":["6.4"],"linecap":["7.1"],"linejoin":["7.2"],"linewidth":["7.3"],"miterlimit":["7.4"],"设置或返回最大斜接长度":["7.4"],"斜接长度指的是在两条线交汇处内角和外角之间的距离":["7.4"],"提示":["7.4","8.10"],"stroke":["8.2"],"moveto":["8.4"],"closepath":["8.5"],"lineto":["8.6"],"clip":["8.7"],"quadraticcurveto":["8.8"],"通过使用表示二次贝塞尔曲线的指定控制点":["8.8"],"向当前路径添加一个点":["8.8","8.9"],"二次贝塞尔曲线需要两个点":["8.8"],"第一个点用于二次贝塞尔曲线计算中的控制点":["8.8"],"beziercurveto":["8.9"],"通过使用表示三次贝塞尔曲线的制定控制点":["8.9"],"三次贝塞尔曲线需要三个点":["8.9"],"前两个是用于贝塞尔计算值的控制点":["8.9"],"第三个点是曲线的结束点":["8.9"],"曲线的开始点是当前路径中最后一个点":["8.9"],"如果路径不存在":["8.9"],"arc":["8.10"],"创建弧":["8.10"],"曲线":["8.10"],"用于创建圆或部分圆":["8.10"],"如需通过":["8.10"],"来创建圆":["8.10"],"请把其实角设置为":["8.10"],"arcto":["8.11"],"在画布上创建介于两个切线之间的弧":["8.11"],"ispointpath":["8.12"],"scale":["9.1"],"缩放当前绘图至更大或更小":["9.1"],"注意":["9.1"],"rotate":["9.2"],"translate":["9.3"],"重新映射画布上的":["9.3"],"transform":["9.4"],"替换当前绘图的变换矩阵":["9.4"],"它以下面描述的矩阵来操作当前的变换矩阵":["9.4"],"a":["9.4"],"c":["9.4"],"e":["9.4"],"settransfrom":["9.5"],"把当前的变换矩阵重置为单位矩阵":["9.5"],"然后以相同的参数运行":["9.5"],"fillstyle":["10.1"],"strokestyle":["10.2"],"shadowcolor":["10.3"],"shadowblur":["10.4"],"shadowoffsetx":["10.5"],"设置或返回阴影与形状的水平距离":["10.5"],"shadowoffsety":["10.6"],"设置或返回阴影与形状的垂直距离":["10.6"],"createlinegradient":["10.8"],"创建线性渐变":["10.8"],"用在画布内容上":["10.8","10.10"],"渐变可用于填充矩形":["10.8"],"createpattern":["10.9"],"在指定的方向上重复制定的元素":["10.9"],"元素可以是图片":["10.9"],"createradialgradient":["10.10"],"创建放射状":["10.10"],"环形的渐变":["10.10"],"addcolorstop":["10.11"],"规定渐变对象中的颜色和停止位置":["10.11"],"05":["11.0"],"09":["11.0"],"lastedittime":["11.0"]},{"0":["1.5","9.4","10.5","10.6"],"1":["9.4"],"2":["8.10"],"15":["4.0"],"20":["8.9"],"30":["4.0"],"32":["11.0"],"45":["11.0"],"255":["1.5"],"fillstyle":["0.1"],"设置或返回用于填充绘画的颜色":["0.1","10.1"],"渐变或模式":["0.1","10.1","10.2"],"strokestyle":["0.1","6.3","10.8","10.10"],"属性":["0.2","0.9"],"描述":["0.2","0.3","0.5","0.6","5.1"],"方法":["0.3","0.7","0.10"],"填充当前绘图":["0.4"],"stroke":["0.4","6.1","8.10"],"绘制已定义的路径":["0.4"],"beginpath":["0.4","8.3","8.8","8.9"],"scale":["0.5"],"font":["0.6","5.5","5.6"],"设置或返回文本内容的当前字体属性":["0.6"],"返回":["0.8"],"imagedata":["0.8","1.6"],"对象的宽度":["0.8"],"height":["0.8","1.2"],"width":["1.1"],"作用":["1.1","1.2","2.1","2.2","2.4","5.7","7.3","8.2","8.5","8.7","9.2","10.3","10.4"],"对象的图像数据":["1.3"],"对于":["1.3"],"对象中的每个像素":["1.3"],"都存在着四方面的信息":["1.3"],"即":["1.3","1.5"],"rgba":["1.5"],"值":["1.5","5.1"],"r":["1.5"],"红色":["1.5"],"g":["1.5"],"绿色":["1.5"],"b":["1.5","9.4"],"蓝色":["1.5"],"对象":["1.6"],"该对象拷贝了画布指定矩形的像素数据":["1.6"],"注意":["1.6","5.3","7.2","9.3"],"放回画布上":["1.7"],"javascript":["1.7","2.5","3.2","6.4"],"语法":["1.7","2.5","3.2","6.4"],"context":["1.7","3.2","4.2","6.4"],"imgdata":["1.7"],"x":["1.7","4.2"],"save":["2.1"],"restore":["2.2"],"createevent":["2.3"],"getcontext":["2.4"],"图像的":["2.5"],"url":["2.5"],"常用于导出":["2.5"],"或透明值":["3.1"],"或":["3.1","5.3","6.1","8.10","10.8","10.10"],"transparency":["3.1"],"默认值":["3.2","10.1","10.2","10.3"],"source":["3.2"],"over":["3.2"],"05":["4.0"],"img":["4.2","8.11"],"y":["4.2"],"在画布上定位图像":["4.2"],"italic":["5.1"],"small":["5.1"],"caps":["5.1"],"bond":["5.1"],"12px":["5.1"],"arial":["5.1"],"属性值":["5.1"],"style":["5.1"],"规定字体的样式":["5.1"],"开始":["5.2"],"不过":["5.2"],"如果您设置为":["5.2"],"right":["5.2"],"并将文本放置到":["5.2"],"filltext":["5.3"],"stroketext":["5.3"],"方法在画布上定位文本时":["5.3"],"将使用指定的":["5.3"],"文本":["5.5"],"默认的颜色是黑色":["5.5"],"提示":["5.5","5.6","5.7","6.1","6.2","6.3","8.4","8.5","8.6","8.7","8.11"],"请使用":["5.5","5.6","6.1","6.2","6.3","8.10","8.11"],"文本的默认颜色是黑色":["5.6"],"属性来定义字体和字号":["5.6"],"返回包含指定文本宽度的对象":["5.7"],"fill":["6.1","8.10"],"被填充":["6.2"],"的矩形":["6.2"],"默认的填充颜色是黑色":["6.2"],"无填充":["6.3"],"笔触的默认颜色是黑色":["6.3"],"在给定的矩形内清除指定的像素":["6.4"],"设置或返回线条的结束端点样式":["7.1"],"round":["7.1"],"和":["7.1","8.8","8.9","10.11"],"square":["7.1"],"设置或返回两条线相交时":["7.2"],"所创建的拐角类型":["7.2"],"miter":["7.2","7.4"],"设置或返回当前的线条宽度":["7.3"],"只有当":["7.4"],"linejoin":["7.4"],"属性为":["7.4"],"时":["7.4"],"才有效":["7.4"],"填充当前的图像":["8.1"],"路径":["8.1"],"默认是黑色":["8.1"],"实际地绘制出通过":["8.2"],"把路径移动到画布中的指定点":["8.4"],"不创建线条":["8.4"],"创建从当前点到开始点的路径":["8.5"],"添加一个新点":["8.6"],"然后创建从该点到画布中最后指定点的线条":["8.6"],"该方法并不会创建线条":["8.6"],"从原画布中裁剪任意形状和尺寸":["8.7"],"第二个点是曲线的结束点":["8.8"],"曲线的开始点是当前路径中的最后一个点":["8.8"],"如果路径不存在":["8.8"],"那么请使用":["8.8","8.9"],"moveto":["8.8","8.9"],"方法来定义开始点":["8.8","8.9"],"三次贝塞尔曲线":["8.9"],"开始点":["8.9"],"控制点":["8.9"],"结束角设置为":["8.10"],"math":["8.10"],"pi":["8.10"],"方法在画布上绘制实际的弧":["8.10"],"an":["8.10"],"中心":["8.10"],"曲线":["8.11"],"如果指定点位于当前路径中":["8.12"],"方法返回":["8.12"],"如果您对绘图进行缩放":["9.1"],"所有之后的绘图也会被缩放":["9.1"],"定位也会被缩放":["9.1"],"如果您":["9.1"],"旋转当前绘图":["9.2"],"位置":["9.3"],"当您在":["9.3"],"d":["9.4"],"f":["9.4"],"换句话说":["9.4","9.5"],"允许您缩放":["9.4","9.5"],"transform":["9.5"],"settransform":["9.5"],"旋转":["9.5"],"000000":["10.1","10.2"],"设置或返回用于笔触的颜色":["10.2"],"设置或返回用于阴影的颜色":["10.3"],"设置或返回用于阴影的模糊级别":["10.4"],"指示阴影位于形状的正下方":["10.5","10.6"],"圆形":["10.8","10.10"],"线条":["10.8","10.10"],"文本等等":["10.8","10.10"],"该对象作为":["10.8","10.10"],"视频":["10.9"],"或者其他":["10.9"],"canvas":["10.9"],"元素":["10.9"],"被重复的元素可用于绘制":["10.9"],"填充矩形":["10.9"],"渐变可用于填充矩形":["10.10"],"方法与":["10.11"],"createlineargradient":["10.11"],"createradialgradient":["10.11"],"一起使用":["10.11"],"description":["11.0"],"filepath":["11.0"],"tutorial":["11.0"],"docs":["11.0"],"index":["11.0"],"md":["11.0"],"https":["11.0"],"vitepress":["11.0"],"dev":["11.0"],"reference":["11.0"]},{"0":["1.3","3.1"],"1":["7.3","8.9","8.10"],"2":["8.9","9.1"],"5":["8.10"],"17":["4.0"],"20":["8.8","10.5","10.6"],"50":["8.10"],"75":["8.10"],"100":["8.9","8.10"],"150":["5.2"],"200":["8.9"],"255":["1.3"],"设置或返回用于笔触的颜色":["0.1"],"shadowcolor":["0.1"],"设置或返回用于阴影的颜色":["0.1"],"linecap":["0.2"],"设置或返回线条的结束端点样式":["0.2"],"rect":["0.3"],"创建矩形":["0.3"],"起始一条路径":["0.4"],"或重置当前路径":["0.4"],"moveto":["0.4","8.2"],"把路径移动到画布中的指定点":["0.4"],"不创建线条":["0.4"],"缩放当前绘图至更大或更小":["0.5"],"rotate":["0.5"],"旋转当前绘图":["0.5"],"textalign":["0.6"],"设置或返回文本内容的当前对齐方式":["0.6"],"textbaseline":["0.6"],"描述":["0.7","0.9","0.10","3.2"],"对象的高度":["0.8"],"data":["0.8"],"返回一个对象":["0.8","2.4"],"globalalpha":["0.9"],"save":["0.10"],"返回":["1.1","1.2"],"rgba":["1.3"],"值":["1.3","3.2","5.3"],"r":["1.3"],"红色":["1.3"],"a":["1.5","11.0"],"alpha":["1.5"],"通道":["1.5"],"是透明":["1.5"],"是完全可见":["1.5"],"因此":["1.5"],"对象不是图像":["1.6"],"它规定了画布上一部分":["1.6"],"矩形":["1.6"],"并保存了该矩形内每个像素的信息":["1.6"],"javascript":["1.6","5.3","5.5","5.6","6.1","6.2","6.3","7.3","8.4","8.11","8.12","9.1","9.2","10.1","10.2","10.3","10.4","10.9"],"y":["1.7","6.4"],"dirtyx":["1.7"],"dirtyy":["1.7"],"dirtywidth":["1.7"],"dirtyheight":["1.7"],"参数值":["1.7","2.5"],"参数":["1.7","2.5"],"保存当前环境的状态":["2.1"],"canvas":["2.1"],"返回之前保存过的路径状态和属性":["2.2"],"type":["2.5"],"encoderoptions":["2.5"],"属性值必须是介于":["3.1"],"完全透明":["3.1"],"与":["3.1"],"in":["3.2"],"属性值":["3.2"],"默认":["3.2"],"在目标图像上显示源图像":["3.2"],"00":["4.0"],"lastedittime":["4.0"],"width":["4.2","6.4"],"height":["4.2"],"并规定图像的宽度和高度":["4.2"],"sx":["4.2"],"可能的值":["5.1"],"br":["5.1"],"normal":["5.1"],"oblique":["5.1"],"variant":["5.1"],"规定字体变体":["5.1"],"位置":["5.2"],"那么会在位置":["5.2"],"结束":["5.2"],"提示":["5.2","8.1"],"请使用":["5.2","8.1","8.4","8.5","8.6"],"默认值":["5.3","7.1","7.2","7.3","10.4"],"alphabetic":["5.3"],"语法":["5.3","5.6","6.1","6.2","6.3","8.11","9.1","10.1","10.2","10.3","10.9"],"属性来定义字体和字号":["5.5"],"并使用":["5.5","5.6"],"fillstyle":["5.5","5.6","6.2","8.1","10.8","10.10"],"属性以另一种颜色":["5.5","5.6"],"渐变来渲染文本":["5.5","5.6"],"如果您需要在文本向画布输出之前":["5.7"],"就了解文本的宽度":["5.7"],"方法在画布上实际地绘制矩形":["6.1"],"context":["6.1","6.3","8.11","9.1","10.1","10.2","10.9"],"属性来设置用于填充绘图的颜色":["6.2"],"渐变或模式":["6.2","6.3"],"属性来设置笔触的颜色":["6.3"],"x":["6.4","9.3"],"会使线条略微变长":["7.1"],"butt":["7.1"],"值受":["7.2"],"miterlimit":["7.2"],"属性的影响":["7.2"],"边角的角度越小":["7.4"],"斜接长度就会越大":["7.4"],"为了避免斜接长度过长":["7.4"],"我们可以使用":["7.4"],"属性":["7.4"],"如果斜接长度超过":["7.4"],"属性来填充另一种颜色":["8.1"],"和":["8.2"],"lineto":["8.2"],"作用":["8.3"],"开始一条路径":["8.3"],"stroke":["8.4","8.5","8.6","8.11"],"方法在画布上绘制确切的路径":["8.4","8.5","8.6"],"一旦剪切了某个区域":["8.7"],"则所有之后的绘图都会被限制在被剪切的区域内":["8.7"],"不能访问画布上的其他区域":["8.7"],"二次贝塞尔曲线":["8.8"],"开始点":["8.8"],"控制点":["8.8"],"起始角":["8.10"],"方法在画布上绘制确切的弧":["8.11"],"true":["8.12"],"否则返回":["8.12"],"false":["8.12"],"那么绘图将定位于距离画布左上角两倍远的位置":["9.1"],"注意":["9.2","9.4","9.5","10.11"],"旋转只会影响到旋转完成后的绘图":["9.2"],"之后调用诸如":["9.3"],"fillrect":["9.3"],"之类的方法时":["9.3"],"值会添加到":["9.3"],"旋转":["9.4"],"移动并倾斜当前的环境":["9.4","9.5"],"该变换只会影响":["9.4","9.5"],"方法调用之后的绘图":["9.4","9.5"],"方法的行为相对于由":["9.4"],"000000":["10.3"],"指示阴影位于形状":["10.5","10.6"],"left":["10.5"],"位置右侧的":["10.5"],"top":["10.6"],"位置下方的":["10.6"],"属性的值":["10.8","10.10"],"需要配合":["10.8","10.10"],"addcolorstop":["10.8","10.10"],"方法规定不同的颜色":["10.8","10.10"],"以及在":["10.8","10.10"],"圆形或者线条等等":["10.9"],"gradient":["10.10"],"您可以多次调用":["10.11"],"方法来改变渐变":["10.11"],"如果您不对渐变的对象使用该方法":["10.11"],"那么渐变将不可见":["10.11"],"default":["11.0"],"theme":["11.0"],"home":["11.0"],"page":["11.0"],"layout":["11.0"],"hero":["11.0"],"name":["11.0"],"my":["11.0"],"text":["11.0"]},{"100":["8.8"],"200":["8.8"],"shadowblur":["0.1"],"设置或返回用于阴影的模糊级别":["0.1"],"shadowoffsetx":["0.1"],"设置或返回阴影与形状的水平距离":["0.1"],"linejoin":["0.2"],"fillrect":["0.3"],"绘制":["0.3"],"closepath":["0.4"],"创建从当前点回到起始点的路径":["0.4"],"lineto":["0.4"],"添加一个新点":["0.4"],"然后在画布中创建从该点到最后指定点的线条":["0.4"],"translate":["0.5","9.4"],"重新映射画布上的":["0.5"],"设置或返回在绘制文本时使用的当前文本基线":["0.6"],"方法":["0.6","0.8"],"drawimage":["0.7"],"其包含指定的":["0.8"],"对象的图像数据":["0.8"],"设置或返回绘图的当前":["0.9"],"保存当前环境的状态":["0.10"],"imagedata":["1.1","1.2"],"对象的宽度":["1.1"],"对象的高度":["1.2"],"g":["1.3"],"绿色":["1.3"],"b":["1.3"],"蓝色":["1.3"],"表示":["1.5"],"color":["1.5","10.1","10.2"],"信息以数组形式存在":["1.5"],"并且由于数组包含了每个像素的四条信息":["1.5"],"所以数组的大小是":["1.5"],"对象的四倍":["1.5"],"width":["1.5","6.1","6.2","6.3"],"语法":["1.6","5.5","5.7","7.1","7.2","7.3","8.4","8.6","8.12","9.2","9.5","10.4","10.8","10.10","10.11"],"context":["1.6","5.3","5.5","5.6","6.2","7.1","7.2","7.3","8.4","8.6","8.12","9.2","9.5","10.3","10.4","10.8","10.10"],"x":["1.6","5.5","5.6","6.1","6.2","6.3","10.9"],"y":["1.6","5.6","6.1","6.2","6.3","9.3","10.9"],"描述":["1.7","2.5","6.4"],"规定要放回画布上的":["1.7"],"状态存储在栈中":["2.1"],"每当":["2.1"],"每一次调用":["2.2"],"指出访问绘图功能必要的":["2.4"],"api":["2.4"],"图片格式":["2.5"],"默认":["2.5"],"image":["2.5","10.9"],"png":["2.5"],"不透明":["3.1"],"之间的数字":["3.1"],"默认值":["3.1","5.2"],"atop":["3.2"],"在目标图像顶部显示源图像":["3.2"],"源图像位于目标图像之外的部分是不可见的":["3.2"],"在目标图像中显示源图像":["3.2"],"只有目标图像之内的源图像部分会显示":["3.2"],"sy":["4.2"],"swidth":["4.2"],"sheight":["4.2"],"剪切图像":["4.2"],"并在画布上定位被剪切的部分":["4.2"],"参数值":["4.2","6.4","9.1"],"weight":["5.1"],"规定字体的粗细":["5.1"],"bold":["5.1"],"filltext":["5.2"],"或":["5.2","9.4"],"stroketext":["5.2"],"方法在画布上实际地绘制并定位文本":["5.2"],"img":["5.2"],"top":["5.3"],"hanging":["5.3"],"middle":["5.3"],"text":["5.5","5.6"],"那么请使用该方法":["5.7"],"javascript":["5.7","7.1","7.2","8.6","9.5","10.8","10.10","10.11"],"height":["6.1","6.4"],"参数":["6.4","9.1"],"的值":["7.4"],"边角会以":["7.4"],"的":["7.4"],"bevel":["7.4"],"类型来显示":["7.4"],"渐变":["8.1"],"注意":["8.1"],"如果路径未关闭":["8.1"],"方法定义的路径":["8.2"],"默认颜色是黑色":["8.2"],"或者重置当前的路径":["8.3"],"fill":["8.5"],"您也可以在使用":["8.7"],"方法前通过使用":["8.7"],"结束点":["8.8","8.9"],"结束角":["8.10"],"x1":["8.11"],"y1":["8.11"],"x2":["8.11"],"scalewidth":["9.1"],"scaleheight":["9.1"],"和":["9.3"],"坐标值上":["9.3"],"illustration":["9.3"],"of":["9.3"],"rotate":["9.4"],"scale":["9.4"],"完成的其他变换":["9.4"],"例如":["9.4"],"如果您已经将绘图设置为放大两倍":["9.4"],"a":["9.5"],"gradient":["10.1","10.2","10.8","10.11"],"pattern":["10.1","10.2"],"属性值":["10.1","10.2"],"像素处":["10.5","10.6"],"对象中的何处定位颜色":["10.8","10.10"],"createlineargradient":["10.8"],"repeat":["10.9"],"x0":["10.10"],"y0":["10.10"],"为了获得可见的渐变":["10.11"],"您需要创建至少一个色标":["10.11"],"site":["11.0"],"tagline":["11.0"],"great":["11.0"],"project":["11.0"],"actions":["11.0"],"brand":["11.0"],"markdown":["11.0"],"examples":["11.0"]},{"0":["0.5","9.1"],"2":["7.4"],"4":["1.5"],"10":["7.4"],"16":["4.0"],"19":["4.0"],"25":["4.0"],"100":["5.1","9.1"],"200":["5.1"],"300":["5.1"],"400":["5.1"],"shadowoffsety":["0.1"],"设置或返回阴影与形状的垂直距离":["0.1"],"方法":["0.1","2.2","9.4"],"设置或返回两条线相交时":["0.2"],"所创建的拐角类型":["0.2"],"被填充":["0.3"],"的矩形":["0.3"],"clip":["0.4"],"从原始画布剪切任意形状和尺寸的区域":["0.4"],"quadraticcurveto":["0.4"],"创建二次贝塞尔曲线":["0.4"],"beziercurveto":["0.4"],"位置":["0.5"],"filltext":["0.6"],"在画布上绘制":["0.6"],"向画布上绘制图像":["0.7"],"createimagedata":["0.8"],"创建新的":["0.8"],"空白的":["0.8"],"alpha":["0.9","1.3"],"restore":["0.10"],"返回之前保存过的路径状态和属性":["0.10"],"以像素计":["1.1","1.2","1.7"],"javascript":["1.1","1.2","2.4","3.1","5.2","8.3","8.8","8.9","8.10","9.3"],"a":["1.3"],"通道":["1.3"],"height":["1.5","1.6","6.2","6.3"],"获取数组大小有更简单的办法":["1.5"],"就是使用":["1.5"],"imagedataobject":["1.5"],"data":["1.5"],"length":["1.5"],"提示":["1.5","8.2","9.4"],"操作完成数组的":["1.5"],"信息后":["1.5"],"您可以使用":["1.5"],"width":["1.6"],"参数值":["1.6","5.5","5.6","6.1","6.2","6.3","8.4","8.6","8.11","8.12","9.5","10.8","10.9","10.10","10.11"],"参数":["1.6","4.2","5.5","5.6","6.1","6.2","6.3","8.4","8.6","8.11","8.12","10.8","10.9","10.10","10.11"],"描述":["1.6","5.3","5.5","5.6","6.1","6.2","6.3","9.1","10.1","10.2","10.9","10.10","10.11"],"对象左上角的":["1.7"],"坐标":["1.7","6.4"],"方法被调用后":["2.1"],"上一个保存的状态就从栈中弹出":["2.2"],"语法":["2.4","3.1","5.2","8.8","8.9","8.10","9.3"],"jpeg":["2.5"],"webp":["2.5"],"encoderoption":["2.5"],"在指定图片格式为":["2.5"],"context":["3.1","5.2","5.7","8.8","8.9","8.10","9.3"],"目标图像是透明的":["3.2"],"out":["3.2"],"在目标图像之外显示源图像":["3.2"],"只有目标图像之外的源图像部分会显示":["3.2"],"destination":["3.2"],"在源图像上显示目标图像":["3.2"],"规定要使用的图像":["4.2"],"可选":["4.2"],"开始剪切的":["4.2"],"坐标位置":["4.2"],"bolder":["5.1"],"lighter":["5.1"],"start":["5.2"],"center":["5.2"],"ideographic":["5.3"],"bottom":["5.3"],"属性值":["5.3","7.1","10.3"],"默认":["5.3"],"y":["5.5","8.4","8.6","8.12"],"maxwidth":["5.5","5.6"],"text":["5.7"],"矩形左上角的":["6.1"],"要清除的矩形左上角的":["6.4"],"bevel":["7.2"],"round":["7.2"],"number":["7.3","10.4"],"fig3":["7.4"],"limit":["7.4"],"figure":["7.4"],"默认值":["7.4","10.5","10.6"],"那么":["8.1"],"方法会从路径结束点到开始点之间添加一条线":["8.1"],"请使用":["8.2"],"strokestyle":["8.2"],"x":["8.4","8.6","8.12"],"方法来填充图像":["8.5"],"默认是黑色":["8.5"],"save":["8.7"],"方法对当前画布区域进行保存":["8.7"],"并在以后的任意时间对其进行恢复":["8.7"],"cpx":["8.8"],"cpy":["8.8"],"cp1x":["8.9"],"cp1y":["8.9"],"cp2x":["8.9"],"y2":["8.11"],"r":["8.11"],"缩放当前绘图的宽度":["9.1"],"angle":["9.2"],"the":["9.3"],"method":["9.3"],"则":["9.4"],"方法会把绘图放大两倍":["9.4"],"您的绘图最终将放大四倍":["9.4"],"请查看":["9.4"],"settransform":["9.4"],"它不会相对于其他变换来发生行为":["9.4"],"b":["9.5"],"c":["9.5"],"d":["9.5"],"e":["9.5"],"f":["9.5"],"值":["10.1","10.2","10.3"],"指定绘图填充色的":["10.1","10.2"],"color":["10.3","10.11"],"位置左侧的":["10.5"],"位置上方的":["10.6"],"x0":["10.8"],"y0":["10.8"],"x1":["10.8","10.10"],"y1":["10.8","10.10"],"no":["10.9"],"r0":["10.10"],"r1":["10.10"],"stop":["10.11"],"link":["11.0"],"alt":["11.0"],"api":["11.0"],"features":["11.0"]},{"0":["10.11"],"5":["9.1"],"50":["9.1"],"200":["9.1"],"500":["5.1"],"600":["5.1"],"700":["5.1"],"800":["5.1"],"900":["5.1"],"createlinegradient":["0.1"],"创建线性渐变":["0.1"],"用在画布内容上":["0.1"],"createpattern":["0.1"],"linewidth":["0.2"],"设置或返回当前的线条宽度":["0.2"],"strokerect":["0.3"],"绘制矩形":["0.3"],"创建三次贝塞尔曲线":["0.4"],"arc":["0.4"],"创建弧":["0.4"],"曲线":["0.4"],"用于创建圆形或部分圆":["0.4"],"transform":["0.5"],"替换绘图的当前转换矩阵":["0.5"],"被填充的":["0.6"],"stroketext":["0.6"],"画布或视频":["0.7"],"对象":["0.8"],"getimagedata":["0.8"],"或透明值":["0.9"],"globalcompositeoperation":["0.9"],"createevent":["0.10"],"语法":["1.1","1.2","1.5","7.4","8.3","9.4","10.5","10.6"],"是透明":["1.3"],"是完全可见":["1.3"],"color":["1.3"],"putimagedata":["1.5"],"方法将图像数据拷贝回画布上":["1.5"],"javascript":["1.5","7.4","9.4","10.5","10.6"],"用法":["1.5"],"描述":["1.5","3.1","5.2","7.1","7.2","7.3","8.4","8.6","8.8","8.9","8.10","8.11","8.12","9.2","9.5","10.3","10.8"],"context":["1.5","7.4","8.3","9.4","10.5","10.6"],"以指定的尺寸":["1.5"],"像素":["1.5"],"创建新的":["1.5"],"开始复制的左上角位置的":["1.6"],"坐标":["1.6","6.1","6.2","6.3","8.9","8.10","10.8","10.10"],"以像素计":["1.6"],"可选":["1.7"],"水平值":["1.7"],"当前的状态就被推送到栈中保存":["2.1"],"可以调用任意多次":["2.1"],"所有设定都恢复":["2.2"],"canvas":["2.4"],"或":["2.5"],"number":["3.1","7.4"],"属性值":["3.1","5.2","7.2","7.3","7.4","10.4"],"值":["3.1","5.2","7.1","7.2","7.3","7.4","10.4"],"透明值":["3.1"],"在源图像顶部显示目标图像":["3.2"],"目标图像位于源图像之外的部分是不可见的":["3.2"],"在源图像中显示目标图像":["3.2"],"只有源图像之内的目标图像部分会被显示":["3.2"],"description":["4.0"],"filepath":["4.0"],"tutorial":["4.0"],"被剪切图像的宽度":["4.2"],"size":["5.1"],"line":["5.1"],"height":["5.1"],"end":["5.2"],"left":["5.2"],"文本基线是普通的字母基线":["5.3"],"文本基线是":["5.3"],"em":["5.3"],"方框的顶端":["5.3"],"规定在画布上输出的文本":["5.5","5.6"],"开始绘制文本的":["5.5","5.6"],"坐标的位置":["5.5","5.6"],"相对于画布":["5.6"],"width":["5.7"],"参数值":["5.7","8.8","8.9","8.10","9.2","9.3"],"矩形左上角的":["6.2","6.3"],"已关闭路径":["8.1"],"正如":["8.1"],"closepath":["8.1"],"一样":["8.1"],"属性来填充另一种颜色":["8.2","8.5"],"渐变":["8.2","8.5"],"路径的目标位置的":["8.4","8.6"],"strokestyle":["8.5"],"通过":["8.7"],"restore":["8.7"],"方法":["8.7"],"x":["8.8","8.9","8.10","10.8","10.10"],"y":["8.8","8.9","8.10","10.10"],"参数":["8.8","8.9","8.10","9.2","9.3","9.5"],"贝塞尔控制点的":["8.8"],"cp2y":["8.9"],"第一个贝塞尔控制点的":["8.9"],"r":["8.10"],"sangle":["8.10"],"eangle":["8.10"],"counterclockwise":["8.10"],"圆的中心的":["8.10"],"两切线交点的横坐标":["8.11"],"两切线交点的纵坐标":["8.11"],"要测试的":["8.12"],"依次类推":["9.1"],"水平缩放绘图":["9.5"],"css":["10.1","10.2"],"颜色值":["10.1","10.2"],"默认值是":["10.1","10.2"],"用于阴影的":["10.3"],"渐变开始点的":["10.8"],"规定要使用的模式的图片":["10.9"],"画布或视频元素":["10.9"],"默认":["10.9"],"该模式下在水平和垂直方向重复":["10.9"],"渐变开始圆的":["10.10"],"介于":["10.11"],"与":["10.11"],"title":["11.0"],"feature":["11.0"],"details":["11.0"],"lorem":["11.0"],"ipsum":["11.0"],"dolor":["11.0"],"sit":["11.0"],"amet":["11.0"],"consectetur":["11.0"],"adipiscing":["11.0"],"elit":["11.0"]},{"0":["2.5"],"1":["2.5","10.11"],"在指定的方向上重复指定的元素":["0.1"],"createradialgradient":["0.1"],"创建放射状":["0.1"],"环形的渐变":["0.1"],"miterlimit":["0.2"],"设置或返回最大斜接长度":["0.2"],"无填充":["0.3","0.6"],"clearrect":["0.3"],"arcto":["0.4"],"创建两切线之间的弧":["0.4"],"ispointinpath":["0.4"],"如果指定的点位于当前路径中":["0.4"],"settransform":["0.5"],"将当前转换重置为单位矩阵":["0.5"],"然后运行":["0.5"],"在画布上绘制文本":["0.6"],"measuretext":["0.6"],"该对象为画布上指定的矩形复制像素数据":["0.8"],"putimagedata":["0.8"],"把图像数据":["0.8"],"从指定的":["0.8"],"设置或返回新图像如何绘制到已有的图像上":["0.9"],"getcontext":["0.10"],"todataurl":["0.10"],"imgdata":["1.1","1.2"],"信息以数组形式存在":["1.3"],"并存储于":["1.3"],"对象的":["1.3"],"创建与指定的另一个":["1.5"],"对象出现相同的新的":["1.5"],"不会复制图像数据":["1.5"],"参数值":["1.5","9.4"],"参数":["1.5","5.7","9.4"],"在画布上放置图像的位置":["1.7"],"垂直值":["1.7"],"方法":["2.1"],"类似数组的":["2.2"],"pop":["2.2"],"contextid":["2.4"],"的情况下":["2.5"],"可以从":["2.5"],"到":["2.5"],"的区间内选择图片的质量":["2.5"],"必须介于":["3.1"],"源图像是透明的":["3.2"],"在源图像之外显示目标图像":["3.2"],"只有源图像之外的目标图像部分会被显示":["3.2"],"lighter":["3.2"],"显示源图像":["3.2"],"docs":["4.0"],"canvas":["4.0"],"图像绘制":["4.0"],"被剪切图像的高度":["4.2"],"在画布上放置图像的":["4.2"],"规定字号和行高":["5.1"],"以像素计":["5.1","6.1","6.2","6.3","6.4"],"family":["5.1"],"规定字体系列":["5.1"],"caption":["5.1"],"使用标题控制的字体":["5.1"],"比如按钮":["5.1"],"下拉列表等":["5.1"],"icon":["5.1"],"使用用于标记图标的字体":["5.1"],"menu":["5.1"],"默认":["5.2","7.1"],"文本在指定的位置开始":["5.2"],"文本在指定的位置结束":["5.2"],"文本基线是悬挂基线":["5.3"],"方框的正中":["5.3"],"相对于画布":["5.5"],"描述":["5.7","7.4","9.3","9.4","10.5","10.6"],"矩形的宽度":["6.1","6.2","6.3"],"要清除的矩形的宽度":["6.4"],"向线条的每个末端添加平直的边缘":["7.1"],"向线条的每个末端添加圆形线帽":["7.1"],"创建斜角":["7.2"],"创建圆角":["7.2"],"当前线条的宽度":["7.3"],"正数":["7.4"],"规定最大斜接长度":["7.4"],"然后填充该路径":["8.1"],"javascript":["8.1","8.2","8.5","8.7"],"语法":["8.1","8.2","8.5","8.7"],"context":["8.2","8.5","8.7"],"坐标":["8.4","8.6","8.8","8.12"],"结束点的":["8.8"],"第二个贝塞尔控制点的":["8.9"],"圆的半径":["8.10"],"以弧度计":["8.10"],"弧的圆心的三点钟位置是":["8.10"],"度":["8.10"],"第二条切线上一点的横坐标":["8.11"],"第二条切线上一点的纵坐标":["8.11"],"缩放当前绘图的高度":["9.1"],"旋转角度":["9.2"],"添加到水平坐标":["9.3"],"上的值":["9.3"],"水平缩放绘图":["9.4"],"水平倾斜绘图":["9.4","9.5"],"垂直倾斜绘图":["9.5"],"垂直缩放绘图":["9.5"],"用于填充绘图的渐变对象":["10.1","10.2"],"线性或者放射性":["10.1","10.2"],"css":["10.3"],"颜色值":["10.3"],"默认是":["10.3"],"属性":["10.4"],"number":["10.5","10.6"],"属性值":["10.5","10.6"],"值":["10.5","10.6"],"y":["10.8"],"渐变结束点的":["10.8"],"该模式只在水平方向重复":["10.9"],"该模式只在垂直方向重复":["10.9"],"开始圆的半径":["10.10"],"渐变结束圆的":["10.10"],"之间的值":["10.11"],"表示渐变中开始与结束之间的位置":["10.11"],"在":["10.11"],"b":["11.0"]},{"92":["2.5"],"addcolorstop":["0.1"],"规定渐变对象中的颜色和停止位置":["0.1"],"在给定的矩形内清除指定的像素":["0.3"],"则返回":["0.4"],"true":["0.4","8.10"],"否则返回":["0.4"],"false":["0.4","8.10"],"返回包含指定文本宽度的对象":["0.6"],"放回画布上":["0.8"],"属性中":["1.3"],"javascript":["1.3"],"语法":["1.3"],"imgdata":["1.3"],"对象的宽度":["1.5"],"以像素计":["1.5","5.5","5.6","7.3"],"对象的高度":["1.5"],"另一个":["1.5"],"要复制的矩形区域的宽度":["1.6"],"要复制的矩形区域的高度":["1.6"],"在画布上绘制图像所使用的宽度":["1.7"],"在画布上绘制图像所使用的高度":["1.7"],"如果超出取值范围":["2.5"],"将会使用默认值":["2.5"],"之间":["3.1"],"copy":["3.2"],"忽略目标图像":["3.2"],"xor":["3.2"],"使用异或操作对源图像和目标图像进行组合":["3.2"],"image":["3.2"],"20240530142857949":["3.2"],"md":["4.0"],"要使用的图像的宽度":["4.2"],"伸展或者缩小图像":["4.2"],"eight":["4.2"],"要使用的图像的高度":["4.2"],"使用用于菜单中的字体":["5.1"],"下拉列表和菜单列表":["5.1"],"message":["5.1"],"box":["5.1"],"使用用于对话框的字体":["5.1"],"使用用于标记小型控件的字体":["5.1"],"status":["5.1"],"bar":["5.1"],"使用用于窗口状态栏的字体":["5.1"],"文本的中心被放置在指定的位置":["5.2"],"文本基线是表意基线":["5.3"],"方框的底端":["5.3"],"可选":["5.5","5.6","8.10"],"允许的最大文本宽度":["5.5","5.6"],"要测量的文本":["5.7"],"矩形的高度":["6.1","6.2","6.3"],"要清除的矩形的高度":["6.4"],"向线条的每个末端添加正方形线帽":["7.1"],"默认":["7.2"],"创建尖角":["7.2"],"context":["8.1"],"结束点的":["8.9"],"规定应该逆时针还是顺时针绘图":["8.10"],"顺时针":["8.10"],"逆时针":["8.10"],"默认是":["8.10"],"弧的半径":["8.11"],"其中第一条切线上的任意一点的横纵坐标是伤害一次点的位置":["8.11"],"以弧度计":["9.2"],"垂直倾斜绘图":["9.4"],"垂直缩放绘图":["9.4"],"水平移动绘图":["9.4","9.5"],"垂直移动绘图":["9.4","9.5"],"用于填充绘图的":["10.1","10.2"],"对象":["10.1","10.2"],"属性的模糊级别":["10.4"],"正值或者负值":["10.5","10.6"],"定义形状与阴影的水平距离":["10.5"],"定义形状与阴影的垂直距离":["10.6"],"该模式只显示一次":["10.9"],"不重复":["10.9"],"结束圆的半径":["10.10"],"位置显示的":["10.11"],"css":["10.11"],"颜色值":["10.11"],"c":["11.0"]}]'},a={"0.0":{t:"# Canvas API",p:"",l:"canvas/index.html",a:"canvas-api"},"0.1":{t:"一、颜色、样式和阴影",p:`


属性
描述




fillStyle
设置或返回用于填充绘画的颜色、渐变或模式。


strokeStyle
设置或返回用于笔触的颜色、渐变或模式。


shadowColor
设置或返回用于 ...`,l:"canvas/index.html#一、颜色、样式和阴影",a:"一、颜色、样式和阴影"},"0.2":{t:"二、线条样式",p:`


属性
描述




lineCap
设置或返回线条的结束端点样式。


lineJoin
设置或返回两条线相交时，所创建的拐角类型。


lineWidth
设置或返回当前的线条宽度。


mi ...`,l:"canvas/index.html#二、线条样式",a:"二、线条样式"},"0.3":{t:"三、矩形",p:`


方法
描述




rect()
创建矩形。


fillRect()
绘制&quot;被填充&quot;的矩形。


strokeRect()
绘制矩形（无填充）。


clearRect() ...`,l:"canvas/index.html#三、矩形",a:"三、矩形"},"0.4":{t:"四、路径",p:`


方法
描述




fill()
填充当前绘图（路径）。


stroke()
绘制已定义的路径。


beginPath()
起始一条路径，或重置当前路径。


moveTo()
把路径移动到 ...`,l:"canvas/index.html#四、路径",a:"四、路径"},"0.5":{t:"五、转换",p:`


方法
描述




scale()
缩放当前绘图至更大或更小。


rotate()
旋转当前绘图。


translate()
重新映射画布上的 (0,0) 位置。


transform() ...`,l:"canvas/index.html#五、转换",a:"五、转换"},"0.6":{t:"六、文本",p:`


属性
描述




font
设置或返回文本内容的当前字体属性。


textAlign
设置或返回文本内容的当前对齐方式。


textBaseline
设置或返回在绘制文本时使用的当前文本基 ...`,l:"canvas/index.html#六、文本",a:"六、文本"},"0.7":{t:"七、图像绘制",p:`


方法
描述




drawImage()
向画布上绘制图像、画布或视频。



`,l:"canvas/index.html#七、图像绘制",a:"七、图像绘制"},"0.8":{t:"八、像素操作",p:`


属性
描述




width
返回 ImageData 对象的宽度。


height
返回 ImageData 对象的高度。


data
返回一个对象，其包含指定的 ImageData 对 ...`,l:"canvas/index.html#八、像素操作",a:"八、像素操作"},"0.9":{t:"九、合成",p:`


属性
描述




globalAlpha
设置或返回绘图的当前 alpha 或透明值。


globalCompositeOperation
设置或返回新图像如何绘制到已有的图像上。



`,l:"canvas/index.html#九、合成",a:"九、合成"},"0.10":{t:"十、其他",p:`


方法
描述




save()
保存当前环境的状态。


restore()
返回之前保存过的路径状态和属性。


createEvent()



getContext()



toDat ...`,l:"canvas/index.html#十、其他",a:"十、其他"},"1.0":{t:"属性",p:"",l:"canvas/像素操作.html",a:"属性"},"1.1":{t:"1. width",p:`作用：返回 ImageData 对象的宽度，以像素计
JavaScript 语法：imgData.width
`,l:"canvas/像素操作.html#_1-width",a:"_1-width"},"1.2":{t:"2. height",p:`作用：返回 ImageData 对象的高度，以像素计
JavaScript 语法：imgData.height
`,l:"canvas/像素操作.html#_2-height",a:"_2-height"},"1.3":{t:"3. data",p:`作用：返回一个对象，其包含指定的 ImageData 对象的图像数据。
对于 ImageData 对象中的每个像素，都存在着四方面的信息，即 RGBA 值：
R - 红色(0-255)
G - 绿色( ...`,l:"canvas/像素操作.html#_3-data",a:"_3-data"},"1.4":{t:"方法",p:"",l:"canvas/像素操作.html#方法",a:"方法"},"1.5":{t:"1. createImageData()",p:`作用：创建新的空白 ImageData 对象。新对象默认像素值 transparent black。
对于 ImageData 对象中的每个像素，都存在着四方面的信息，即 RGBA 值：
R - 红色 ...`,l:"canvas/像素操作.html#_1-createimagedata",a:"_1-createimagedata"},"1.6":{t:"2. getImageData()",p:`作用：返回 ImageData 对象，该对象拷贝了画布指定矩形的像素数据。
注意：ImageData 对象不是图像，它规定了画布上一部分(矩形)，并保存了该矩形内每个像素的信息。
JavaScript ...`,l:"canvas/像素操作.html#_2-getimagedata",a:"_2-getimagedata"},"1.7":{t:"3. putImageData()",p:`作用：将图像数据（从指定的 ImageData 对象）放回画布上。
JavaScript 语法：context.putImageData(imgData, x, y, dirtyX, dirtyY,  ...`,l:"canvas/像素操作.html#_3-putimagedata",a:"_3-putimagedata"},"2.0":{t:"方法",p:"",l:"canvas/其他.html",a:"方法"},"2.1":{t:"1. save()",p:`作用：保存当前环境的状态
Canvas 状态存储在栈中，每当 save()方法被调用后，当前的状态就被推送到栈中保存。可以调用任意多次 save 方法
`,l:"canvas/其他.html#_1-save",a:"_1-save"},"2.2":{t:"2. restore()",p:`作用：返回之前保存过的路径状态和属性
每一次调用 restore 方法，上一个保存的状态就从栈中弹出，所有设定都恢复。(类似数组的 pop())
`,l:"canvas/其他.html#_2-restore",a:"_2-restore"},"2.3":{t:"3. createEvent()",p:"",l:"canvas/其他.html#_3-createevent",a:"_3-createevent"},"2.4":{t:"4. getContext()",p:`作用：返回一个对象，指出访问绘图功能必要的 API
JavaScript 语法：canvas.getContext(contextID)
`,l:"canvas/其他.html#_4-getcontext",a:"_4-getcontext"},"2.5":{t:"5. toDataURL()",p:`作用：返回 canvas 图像的 URL，常用于导出
JavaScript 语法：canvas.toDataURL(type,encoderOptions)
参数值



参数
描述




type ...`,l:"canvas/其他.html#_5-todataurl",a:"_5-todataurl"},"3.0":{t:"属性",p:"",l:"canvas/合成.html",a:"属性"},"3.1":{t:"1. globalAlpha",p:`作用：设置或返回绘图的当前 alpha 或透明值(alpha 或 transparency)。
globalAlpha 属性值必须是介于 0.0（完全透明） 与 1.0（不透明） 之间的数字。
默认值 ...`,l:"canvas/合成.html#_1-globalalpha",a:"_1-globalalpha"},"3.2":{t:"2. globalCompositeOperation",p:`作用：设置或返回新图像如何绘制到已有的图像上。
新图像：您打算放置到画布上的绘图。
目标图像：您已经放置在画布上的绘图。
默认值：source-over
JavaScript 语法：context.g ...`,l:"canvas/合成.html#_2-globalcompositeoperation",a:"_2-globalcompositeoperation"},"4.0":{t:"<!--",p:`
@Date: 2024-05-30 15:00:17
@LastEditTime: 2024-05-30 16:19:25
@Description:
@FilePath: /tutorial/do ...`,l:"canvas/图像绘制.html",a:""},"4.1":{t:"方法",p:"",l:"canvas/图像绘制.html#方法",a:"方法"},"4.2":{t:"1. drawImage()",p:`作用：向画布上绘制图像、画布或视频
JavaScript 语法



用法
描述




context.drawImage(img, x, y)
在画布上定位图像


context.drawIma ...`,l:"canvas/图像绘制.html#_1-drawimage",a:"_1-drawimage"},"5.0":{t:"属性",p:"",l:"canvas/文本.html",a:"属性"},"5.1":{t:"1. font",p:`作用：设置或返回文本内容当前的字体属性
默认值：10px sans-serif
JavaScript 语法：context.font = &quot;italic small-caps bond 12 ...`,l:"canvas/文本.html#_1-font",a:"_1-font"},"5.2":{t:"2. textAlign",p:`作用：设置或返回文本内容的当前对齐方式
通常，文本会从指定位置开始，不过，如果您设置为 textAlign=&quot;right&quot;并将文本放置到 位置 150，那么会在位置 150结束。
 ...`,l:"canvas/文本.html#_2-textalign",a:"_2-textalign"},"5.3":{t:"3. textBaseline",p:`作用： 设置或返回在绘制文本时使用的当前文本基线。
!textBaseline illustration
注意： fillText() 或 strokeText() 方法在画布上定位文本时，将使用指定 ...`,l:"canvas/文本.html#_3-textbaseline",a:"_3-textbaseline"},"5.4":{t:"文本方法",p:"",l:"canvas/文本.html#文本方法",a:"文本方法"},"5.5":{t:"1. fillText()",p:`作用： 在画布上绘制&quot;被填充的&quot;文本。默认的颜色是黑色
提示：请使用 font() 属性来定义字体和字号，并使用 fillStyle 属性以另一种颜色/渐变来渲染文本。
JavaS ...`,l:"canvas/文本.html#_1-filltext",a:"_1-filltext"},"5.6":{t:"2. strokeText()",p:`作用：在画布上绘制文本（无填充色）。文本的默认颜色是黑色。
提示：请使用 font() 属性来定义字体和字号，并使用 fillStyle 属性以另一种颜色/渐变来渲染文本。
JavaScript 语法 ...`,l:"canvas/文本.html#_2-stroketext",a:"_2-stroketext"},"5.7":{t:"3. measureText()",p:`作用：返回包含指定文本宽度的对象。
提示：如果您需要在文本向画布输出之前，就了解文本的宽度，那么请使用该方法
JavaScript 语法：context.measureText(text).width ...`,l:"canvas/文本.html#_3-measuretext",a:"_3-measuretext"},"6.0":{t:"方法",p:"",l:"canvas/矩形.html",a:"方法"},"6.1":{t:"1. rect()",p:`作用：创建矩形
提示：请使用 stroke() 或 fill() 方法在画布上实际地绘制矩形。
JavaScript 语法：\`context.rect(x, y, width, height);
参数 ...`,l:"canvas/矩形.html#_1-rect",a:"_1-rect"},"6.2":{t:"2. fillRect()",p:`作用：创建“被填充”的矩形。默认的填充颜色是黑色
提示：请使用 fillStyle 属性来设置用于填充绘图的颜色、渐变或模式
JavaScript 语法：context.fillRect(x, y,  ...`,l:"canvas/矩形.html#_2-fillrect",a:"_2-fillrect"},"6.3":{t:"3. strokeRect()",p:`*作用**：绘制矩形（无填充）。笔触的默认颜色是黑色
提示：请使用 strokeStyle 属性来设置笔触的颜色、渐变或模式
JavaScript 语法：context.strokeRect(x, y ...`,l:"canvas/矩形.html#_3-strokerect",a:"_3-strokerect"},"6.4":{t:"4. clearRect()",p:`作用：在给定的矩形内清除指定的像素
JavaScript 语法：context.clearRect(x, y, width, height);
参数值



参数
描述




x
要清除的矩形左上角 ...`,l:"canvas/矩形.html#_4-clearrect",a:"_4-clearrect"},"7.0":{t:"属性",p:"",l:"canvas/线条样式.html",a:"属性"},"7.1":{t:"1. lineCap",p:`作用：设置或返回线条的结束端点样式
&quot;round&quot; 和 &quot;square&quot; 会使线条略微变长
默认值：butt
JavaScript 语法：context.lin ...`,l:"canvas/线条样式.html#_1-linecap",a:"_1-linecap"},"7.2":{t:"2. lineJoin",p:`作用：设置或返回两条线相交时，所创建的拐角类型
注意：&quot;miter&quot; 值受 &quot;miterLimit&quot; 属性的影响
默认值：miter
JavaScript 语法 ...`,l:"canvas/线条样式.html#_2-linejoin",a:"_2-linejoin"},"7.3":{t:"3. lineWidth",p:`作用：设置或返回当前的线条宽度
默认值：1
JavaScript 语法：context.lineWidth = number;
属性值



值
描述




number
当前线条的宽度，以像素计
 ...`,l:"canvas/线条样式.html#_3-linewidth",a:"_3-linewidth"},"7.4":{t:"4. miterLimit",p:`作用：设置或返回最大斜接长度
斜接长度指的是在两条线交汇处内角和外角之间的距离
提示：只有当 lineJoin 属性为 &quot;miter&quot; 时， miterLimit 才有效。
边角的 ...`,l:"canvas/线条样式.html#_4-miterlimit",a:"_4-miterlimit"},"8.0":{t:"方法",p:"",l:"canvas/路径.html",a:"方法"},"8.1":{t:"1. fill()",p:`作用：填充当前的图像/路径。默认是黑色。
提示：请使用 fillStyle 属性来填充另一种颜色/渐变
注意：如果路径未关闭，那么 fIll() 方法会从路径结束点到开始点之间添加一条线，已关闭路径（ ...`,l:"canvas/路径.html#_1-fill",a:"_1-fill"},"8.2":{t:"2. stroke()",p:`作用：实际地绘制出通过 moveTo() 和 lineTo() 方法定义的路径。默认颜色是黑色。
提示：请使用 strokeStyle 属性来填充另一种颜色/渐变
JavaScript 语法：cont ...`,l:"canvas/路径.html#_2-stroke",a:"_2-stroke"},"8.3":{t:"3. beginPath()",p:`作用：开始一条路径，或者重置当前的路径
JavaScript 语法：context.beginPath();
`,l:"canvas/路径.html#_3-beginpath",a:"_3-beginpath"},"8.4":{t:"4. moveTo()",p:`作用：把路径移动到画布中的指定点，不创建线条
提示：请使用 stroke() 方法在画布上绘制确切的路径。
JavaScript 语法：context.moveTo(x, y);
参数值



参数
 ...`,l:"canvas/路径.html#_4-moveto",a:"_4-moveto"},"8.5":{t:"5. closePath()",p:`作用：创建从当前点到开始点的路径。
提示：请使用 stroke() 方法在画布上绘制确切的路径。
提示：请使用 fill() 方法来填充图像(默认是黑色)。请使用 strokeStyle 属性来填充另 ...`,l:"canvas/路径.html#_5-closepath",a:"_5-closepath"},"8.6":{t:"6. lineTo()",p:`作用：添加一个新点，然后创建从该点到画布中最后指定点的线条(该方法并不会创建线条)。
提示：请使用 stroke() 方法在画布上绘制确切的路径。
JavaScript 语法：context.line ...`,l:"canvas/路径.html#_6-lineto",a:"_6-lineto"},"8.7":{t:"7. clip()",p:`作用：从原画布中裁剪任意形状和尺寸。
**提示：**一旦剪切了某个区域，则所有之后的绘图都会被限制在被剪切的区域内（不能访问画布上的其他区域）。您也可以在使用 clip() 方法前通过使用 save( ...`,l:"canvas/路径.html#_7-clip",a:"_7-clip"},"8.8":{t:"8. quadraticCurveTo()",p:`作用：通过使用表示二次贝塞尔曲线的指定控制点，向当前路径添加一个点。
二次贝塞尔曲线需要两个点。第一个点用于二次贝塞尔曲线计算中的控制点，第二个点是曲线的结束点。曲线的开始点是当前路径中的最后一个点。 ...`,l:"canvas/路径.html#_8-quadraticcurveto",a:"_8-quadraticcurveto"},"8.9":{t:"9. bezierCurveTo()",p:`作用：通过使用表示三次贝塞尔曲线的制定控制点，向当前路径添加一个点
三次贝塞尔曲线需要三个点。前两个是用于贝塞尔计算值的控制点，第三个点是曲线的结束点。曲线的开始点是当前路径中最后一个点。如果路径不存 ...`,l:"canvas/路径.html#_9-beziercurveto",a:"_9-beziercurveto"},"8.10":{t:"10. arc()",p:`作用：创建弧/曲线(用于创建圆或部分圆)
提示：如需通过 arc() 来创建圆，请把其实角设置为 0，结束角设置为2* Math.PI
提示：请使用 stroke() 或 fill() 方法在画布上绘 ...`,l:"canvas/路径.html#_10-arc",a:"_10-arc"},"8.11":{t:"11. arcTo()",p:`作用：在画布上创建介于两个切线之间的弧、曲线
!img
提示：请使用 stroke() 方法在画布上绘制确切的弧
JavaScript 语法：context.arcTo(x1, y1, x2, y2, ...`,l:"canvas/路径.html#_11-arcto",a:"_11-arcto"},"8.12":{t:"12. isPointPath()",p:`作用：如果指定点位于当前路径中，isPointPath() 方法返回 true，否则返回 false。
JavaScript 语法：context.isPointpath(x, y)
参数值



参 ...`,l:"canvas/路径.html#_12-ispointpath",a:"_12-ispointpath"},"9.0":{t:"方法",p:"",l:"canvas/转换.html",a:"方法"},"9.1":{t:"1. scale()",p:`作用：缩放当前绘图至更大或更小
注意：如果您对绘图进行缩放，所有之后的绘图也会被缩放。定位也会被缩放。如果您 scale(2, 2)，那么绘图将定位于距离画布左上角两倍远的位置
JavaScript  ...`,l:"canvas/转换.html#_1-scale",a:"_1-scale"},"9.2":{t:"2. rotate()",p:`作用：旋转当前绘图
注意：旋转只会影响到旋转完成后的绘图
JavaScript 语法：context.rotate(angle);
参数值



参数
描述




angle
旋转角度，以弧度计。
 ...`,l:"canvas/转换.html#_2-rotate",a:"_2-rotate"},"9.3":{t:"3. translate()",p:`作用：重新映射画布上的(0,0)位置
注意：当您在translate()之后调用诸如fillRect()之类的方法时，值会添加到 x 和 y 坐标值上。
!Illustration of the tr ...`,l:"canvas/转换.html#_3-translate",a:"_3-translate"},"9.4":{t:"4. transform()",p:`作用：替换当前绘图的变换矩阵。它以下面描述的矩阵来操作当前的变换矩阵：
a c e
b d f
0 0 1
换句话说，transform() 允许您缩放、旋转、移动并倾斜当前的环境。
注意：该变换只会 ...`,l:"canvas/转换.html#_4-transform",a:"_4-transform"},"9.5":{t:"5. setTransfrom()",p:`作用：把当前的变换矩阵重置为单位矩阵，然后以相同的参数运行 transform() .
换句话说，setTransform()允许您缩放、旋转、移动并倾斜当前的环境
注意：该变换只会影响setTran ...`,l:"canvas/转换.html#_5-settransfrom",a:"_5-settransfrom"},"10.0":{t:"属性",p:"",l:"canvas/颜色、样式和阴影.html",a:"属性"},"10.1":{t:"1. fillStyle",p:`作用：设置或返回用于填充绘画的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.fillStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/颜色、样式和阴影.html#_1-fillstyle",a:"_1-fillstyle"},"10.2":{t:"2. strokeStyle",p:`作用：设置或返回用于笔触的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.strokeStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/颜色、样式和阴影.html#_2-strokestyle",a:"_2-strokestyle"},"10.3":{t:"3. shadowColor",p:`作用：设置或返回用于阴影的颜色
默认值：#000000
JavaScript 语法：context.shadowColor=color;
属性值



值
描述




color
用于阴影的 css ...`,l:"canvas/颜色、样式和阴影.html#_3-shadowcolor",a:"_3-shadowcolor"},"10.4":{t:"4. shadowBlur",p:`作用：设置或返回用于阴影的模糊级别
默认值：
JavaScript 语法：context.shadowBlur=number
属性值



值
属性




number
属性的模糊级别



`,l:"canvas/颜色、样式和阴影.html#_4-shadowblur",a:"_4-shadowblur"},"10.5":{t:"5. shadowOffsetX",p:`作用：设置或返回阴影与形状的水平距离
shadowOffsetX = 0 指示阴影位于形状的正下方
shadowOffsetX = 20 指示阴影位于形状 left 位置右侧的 20 像素处
shad ...`,l:"canvas/颜色、样式和阴影.html#_5-shadowoffsetx",a:"_5-shadowoffsetx"},"10.6":{t:"6. shadowOffsetY",p:`作用：设置或返回阴影与形状的垂直距离
shadowOffsetY = 0 指示阴影位于形状的正下方
shadowOffsetY = 20 指示阴影位于形状 top 位置下方的 20 像素处
shado ...`,l:"canvas/颜色、样式和阴影.html#_6-shadowoffsety",a:"_6-shadowoffsety"},"10.7":{t:"方法",p:"",l:"canvas/颜色、样式和阴影.html#方法",a:"方法"},"10.8":{t:"1. createLineGradient()",p:`作用：创建线性渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop() 方法规定不 ...`,l:"canvas/颜色、样式和阴影.html#_1-createlinegradient",a:"_1-createlinegradient"},"10.9":{t:"2. createPattern()",p:`作用：在指定的方向上重复制定的元素
元素可以是图片、视频，或者其他 &lt;canvas&gt; 元素
被重复的元素可用于绘制/填充矩形、圆形或者线条等等。
JavaScript 语法：context ...`,l:"canvas/颜色、样式和阴影.html#_2-createpattern",a:"_2-createpattern"},"10.10":{t:"3. createRadialGradient()",p:`作用：创建放射状/环形的渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop()  ...`,l:"canvas/颜色、样式和阴影.html#_3-createradialgradient",a:"_3-createradialgradient"},"10.11":{t:"4. addColorStop()",p:`作用：规定渐变对象中的颜色和停止位置
addColorStop() 方法与 createLinearGradient() 和 createRadialGradient() 一起使用
注意：您可以多次调 ...`,l:"canvas/颜色、样式和阴影.html#_4-addcolorstop",a:"_4-addcolorstop"},"11.0":{t:"<!--",p:`
@Date: 2024-05-27 15:52:09
@LastEditTime: 2024-05-30 16:45:32
@Description:
@FilePath: /tutorial/do ...`,l:"index.html",a:""}},n={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},e={INDEX_DATA:t,PREVIEW_LOOKUP:a,Options:n};export{e as default};
