const a={map:'[{"canvas":["1.0","3.0"],"一":["1.1"],"属性":["1.2","1.14","1.42","1.52","1.60"],"方法":["1.9","1.19","1.24","1.37","1.46","1.50","1.56"],"canvas绘图基础":["2.0"]},{"1":["0.1","0.3","1.3","1.10","1.15","1.20","1.25","1.38","1.43","1.47","1.51","1.53","1.57","1.61","2.1","2.2","2.3","2.5","2.7","2.18","2.21","3.1","3.2","3.3"],"2":["0.2","1.4","1.11","1.16","1.21","1.26","1.39","1.44","1.48","1.54","1.58","1.62","2.3","2.4","2.5","2.19","2.22","3.3"],"3":["0.3","1.5","1.12","1.17","1.22","1.27","1.40","1.45","1.49","1.55","1.59","2.6","2.7","2.8","2.9","2.10","2.11","2.12","2.13","2.14","2.15","2.23"],"4":["1.6","1.13","1.18","1.23","1.28","1.41","2.10","2.16","2.24"],"5":["1.7","1.29","2.17","2.18","2.19"],"6":["1.8","1.30","2.12","2.20","2.21","2.22","2.23","2.24"],"7":["1.31","2.13"],"8":["1.32","2.14"],"9":["1.33"],"10":["1.34"],"11":["1.35"],"12":["1.36"],"2024":["0.0"],"date":["0.0"],"05":["0.0"],"canvas":["0.1","0.2","0.3","2.2","2.5"],"简介":["0.1"],"是":["0.1","0.2"],"html5":["0.1"],"新增的":["0.1"],"一个可以使用脚本":["0.1"],"什么是":["0.2"],"主要应用的领域":["0.3"],"了解":["0.3"],"游戏":["0.3"],"在基于":["0.3"],"api":["1.0"],"颜色":["1.1"],"fillstyle":["1.3","3.2"],"作用":["1.3","1.4","1.7","1.8","1.10","1.11","1.12","1.13","1.15","1.16","1.18","1.20","1.21","1.22","1.23","1.25"],"strokestyle":["1.4"],"shadowcolor":["1.5"],"shadowblur":["1.6"],"shadowoffsetx":["1.7"],"设置或返回阴影与形状的水平距离":["1.7"],"shadowoffsety":["1.8"],"设置或返回阴影与形状的垂直距离":["1.8"],"createlinegradient":["1.10"],"创建线性渐变":["1.10"],"用在画布内容上":["1.10","1.12"],"渐变可用于填充矩形":["1.10"],"createpattern":["1.11"],"在指定的方向上重复制定的元素":["1.11"],"元素可以是图片":["1.11"],"createradialgradient":["1.12"],"创建放射状":["1.12"],"环形的渐变":["1.12"],"addcolorstop":["1.13"],"规定渐变对象中的颜色和停止位置":["1.13"],"linecap":["1.15"],"linejoin":["1.16"],"linewidth":["1.17"],"miterlimit":["1.18"],"设置或返回最大斜接长度":["1.18"],"斜接长度指的是在两条线交汇处内角和外角之间的距离":["1.18"],"提示":["1.18"],"rect":["1.20"],"创建矩形":["1.20"],"fillrect":["1.21"],"创建":["1.21","2.24"],"strokerect":["1.22"],"绘制矩形":["1.22"],"clearrect":["1.23"],"fill":["1.25","2.12"],"stroke":["1.26"],"标签语法和属性":["2.2"],"重点":["2.2"],"浏览器不兼容处理":["2.3"],"ie9":["2.3"],"以上才支持":["2.3"],"context":["2.5"],"的上下文":["2.5"],"绘制环境":["2.5"],"2设置绘制起始点":["2.8"],"填充":["2.12"],"js":["2.12"],"绘制圆形":["2.16"],"概述":["2.16"],"arc":["2.16"],"方法创建弧":["2.16"],"绘制上下文的文字属性":["2.18"],"font":["2.18"],"设置或返回文本内容的当前字体属性":["2.18"],"上下文绘制文字的方法":["2.19"],"ctx":["2.19"],"filltext":["2.19"],"在画布上绘制被填充的文本":["2.19"],"在画布上绘制图像":["2.22"],"图片裁剪":["2.23"],"用":["2.24"],"javascript":["2.24"],"进阶":["3.0"],"设置填充色和描边的颜色":["3.2"],"设置阴影":["3.3"],"类比于":["3.3"],"css3":["3.3"]},{"0":["1.7","1.8"],"5":["2.11"],"9":["2.15"],"16":["3.2"],"17":["0.0"],"25":["0.3"],"27":["0.0"],"01":["0.0"],"通常为":["0.1"],"javascript":["0.1"],"在其中绘制图像的":["0.1"],"html":["0.1"],"元素":["0.1","1.11"],"他可以用来制作照片集或者制作简单的":["0.1"],"也不是那么简单":["0.1"],"的动画":["0.1"],"html5":["0.2"],"提供的一个新标签":["0.2"],"是一个矩形区域的画布":["0.2"],"web":["0.3"],"的图像显示方面比":["0.3"],"flash":["0.3"],"更加立体":["0.3"],"更加精巧":["0.3"],"游戏在流畅度和跨平台方面更牛":["0.3"],"样式和阴影":["1.1"],"设置或返回用于填充绘画的颜色":["1.3","3.2"],"渐变或模式":["1.3","1.4"],"默认值":["1.3","1.4","1.5"],"000000":["1.3","1.4"],"设置或返回用于笔触的颜色":["1.4","3.2"],"作用":["1.5","1.6","1.17","1.26"],"设置或返回用于阴影的颜色":["1.5","3.3"],"设置或返回用于阴影的模糊级别":["1.6","3.3"],"指示阴影位于形状的正下方":["1.7","1.8"],"圆形":["1.10","1.12"],"线条":["1.10","1.12"],"文本等等":["1.10","1.12"],"该对象作为":["1.10","1.12"],"strokestyle":["1.10","1.12","1.22","3.2"],"或":["1.10","1.12","1.20"],"视频":["1.11"],"或者其他":["1.11"],"canvas":["1.11","2.1","2.3","2.7"],"被重复的元素可用于绘制":["1.11"],"渐变可用于填充矩形":["1.12"],"方法与":["1.13"],"createlineargradient":["1.13"],"和":["1.13","1.15"],"createradialgradient":["1.13"],"一起使用":["1.13"],"设置或返回线条的结束端点样式":["1.15"],"round":["1.15"],"设置或返回两条线相交时":["1.16"],"所创建的拐角类型":["1.16"],"注意":["1.16"],"miter":["1.16","1.18"],"设置或返回当前的线条宽度":["1.17"],"只有当":["1.18"],"linejoin":["1.18"],"属性为":["1.18"],"时":["1.18"],"才有效":["1.18"],"提示":["1.20","1.21","1.22"],"请使用":["1.20","1.21","1.22"],"stroke":["1.20"],"被填充":["1.21"],"的矩形":["1.21"],"默认的填充颜色是黑色":["1.21"],"无填充":["1.22","2.19"],"笔触的默认颜色是黑色":["1.22"],"在给定的矩形内清除指定的像素":["1.23"],"javascript语法":["1.23"],"context":["1.23"],"填充当前的图像":["1.25"],"路径":["1.25"],"默认是黑色":["1.25"],"实际地绘制出通过":["1.26"],"beginpath":["1.27"],"moveto":["1.28"],"closepath":["1.29"],"lineto":["1.30"],"clip":["1.31"],"quadraticcurveto":["1.32"],"beziercurveto":["1.33"],"arc":["1.34"],"arcto":["1.35"],"ispointpath":["1.36"],"scale":["1.38"],"rotate":["1.39"],"translate":["1.40"],"settransfrom":["1.41"],"font":["1.43"],"textalign":["1.44"],"textbaseline":["1.45"],"filltext":["1.47"],"stroketext":["1.48","2.19"],"measuretext":["1.49","2.19"],"drawimage":["1.51"],"width":["1.53"],"height":["1.54"],"data":["1.55"],"createimagedata":["1.57"],"getimagedata":["1.58"],"putimagedata":["1.59"],"globalalpha":["1.61"],"globalcompositeoperation":["1.62"],"画布油布的意思":["2.2"],"标签名":["2.2"],"需要进行闭合":["2.2"],"其他":["2.3"],"chrome":["2.3"],"firefox":["2.3"],"苹果浏览器等都支持":["2.3"],"canvas绘图上下文":["2.4"],"上下文":["2.5"],"上知天文":["2.5"],"下知地理":["2.5"],"是所有的绘制操作":["2.5"],"api":["2.5"],"的入口或者集合":["2.5"],"基本绘制路径":["2.6"],"坐标系":["2.7"],"js":["2.8","2.9","2.10","2.14","2.18","2.21","2.22","2.23","2.24"],"ctx":["2.8","2.12","2.14","2.16","2.18","2.22","2.23"],"绘制直线":["2.9"],"路径开始和闭合":["2.10"],"开始路径":["2.10"],"描边":["2.11"],"解释":["2.12"],"是将闭合路径的内容填充具体的颜色":["2.12"],"快速创建矩形rect":["2.13"],"方法":["2.13"],"快速创建描边矩形和填充矩形":["2.14"],"清除矩形":["2.15"],"曲线":["2.16"],"用于创建圆或部分圆":["2.16"],"语法":["2.16"],"绘制文字":["2.17"],"font属性使用的语法和css":["2.18"],"font属性相同":["2.18"],"18px":["2.18"],"在画布上绘制文本":["2.19"],"绘制图片":["2.20"],"基本绘制图片的方式":["2.21"],"并规定图像的宽高":["2.22"],"并在画布上定位被剪切的部分":["2.23"],"img":["2.24"],"对象":["2.24"],"第一种方式":["2.24"],"var":["2.24"],"canvas颜色样式和阴影":["3.1"],"以上两个值都可以接受颜色名":["3.2"],"的阴影":["3.3"],"shadowcolor":["3.3"],"shadowblur":["3.3"],"大于":["3.3"]},{"1":["1.17"],"2":["0.3","2.18"],"20":["1.7","1.8"],"21":["0.0"],"300":["2.19"],"lastedittime":["0.0"],"甚至可以进行实时视频处理和渲染":["0.1"],"它最初由苹果内部使用自己":["0.1"],"macos":["0.1"],"x":["0.1","1.23","2.8","2.14","2.16","2.22"],"webkit":["0.1"],"推出":["0.1"],"供应用程序使用像仪表盘的构建和":["0.1"],"safari":["0.1"],"浏览器使用":["0.1"],"可以用":["0.2"],"javascript":["0.2","1.3","1.4","1.5","1.6","2.5","2.19"],"在上面绘画":["0.2"],"控制其每一个像素":["0.2"],"超棒的":["0.3"],"html5":["0.3"],"可视化数据":["0.3"],"数据图表话":["0.3"],"比如":["0.3"],"语法":["1.3","1.4","1.5"],"context":["1.3","1.4","1.11","1.20","1.21","1.22","2.4"],"000000":["1.5"],"默认值":["1.6","1.15","1.16","1.17"],"指示阴影位于形状":["1.7","1.8"],"left":["1.7"],"位置右侧的":["1.7"],"top":["1.8"],"位置下方的":["1.8"],"fillstyle":["1.10","1.12","1.21","1.25"],"属性的值":["1.10","1.12"],"需要配合":["1.10","1.12"],"addcolorstop":["1.10","1.12"],"方法规定不同的颜色":["1.10","1.12"],"以及在":["1.10","1.12"],"填充矩形":["1.11"],"圆形或者线条等等":["1.11"],"javascript语法":["1.11","1.20","1.21","1.22"],"image":["1.11"],"gradient":["1.12"],"注意":["1.13","2.12"],"您可以多次调用addcolorstop":["1.13"],"方法来改变渐变":["1.13"],"如果您不对渐变的对象使用该方法":["1.13"],"那么渐变将不可见":["1.13"],"square":["1.15"],"会使线条略微变长":["1.15"],"butt":["1.15"],"值受":["1.16"],"miterlimit":["1.16"],"属性的影响":["1.16"],"边角的角度越小":["1.18"],"斜接长度就会越大":["1.18"],"为了避免斜接长度过长":["1.18"],"我们可以使用":["1.18"],"属性":["1.18"],"如果斜接长度超过":["1.18"],"fill":["1.20"],"方法在画布上实际地绘制矩形":["1.20"],"属性来设置用于填充绘图的颜色":["1.21"],"渐变或模式":["1.21","1.22"],"属性来设置笔触的颜色":["1.22"],"y":["1.23","2.8","2.14","2.16","2.22"],"width":["1.23","2.2"],"height":["1.23"],"提示":["1.25"],"请使用":["1.25"],"moveto":["1.26","2.8","2.19"],"和":["1.26"],"lineto":["1.26","2.9"],"作用":["1.27","1.28","1.29","1.30","1.31","1.32","1.33","1.34","1.35","1.36","1.38","1.39","1.40","1.41","1.43","1.44","1.45","1.47","1.48","1.49","1.51","1.53","1.54","1.55","1.57","1.58","1.59","1.61","1.62"],"标签":["2.1","2.2"],"就是一个普通的":["2.2"],"html":["2.2"],"可以是在":["2.2"],"只要浏览器兼容":["2.3"],"那么就会支持绝大部分":["2.3"],"api":["2.3"],"个别最新":["2.3"],"自身无法绘制任何内容":["2.5"],"的绘图是使用":["2.5"],"操作的":["2.5"],"ctx":["2.9","2.10","2.13","2.21"],"beginpath":["2.10"],"stroke":["2.11"],"js":["2.11","2.13","2.15"],"默认是黑色":["2.12"],"交叉路径的填充问题":["2.12"],"非零环绕原则":["2.12"],"顺逆时针穿插次数决定是否填充":["2.12"],"rect":["2.13"],"strokerect":["2.14"],"clearrect":["2.15"],"sangle":["2.16"],"eangle":["2.16"],"counterclockwise":["2.16"],"解释":["2.16"],"微软雅黑":["2.18"],"textalign":["2.18"],"设置或者返回文本内容当前的对其方式":["2.18"],"start":["2.18"],"默认":["2.18"],"文本在指定的位置开始":["2.18"],"返回包含指定文本宽度的对象":["2.19"],"综合案例代码":["2.19"],"drawimage":["2.20","2.21","2.22","2.23"],"img":["2.22","2.23"],"sx":["2.23"],"document":["2.24"],"getelementbyid":["2.24"],"imgid":["2.24"],"第二种方式":["2.24"],"进制数据":["3.2"],"rgb":["3.2"],"值":["3.2"],"甚至":["3.2"],"rgba":["3.2"],"的正整数":["3.3"],"数值越高":["3.3"],"模糊程度越大":["3.3"],"shadowoffsetx":["3.3"],"设置或返回阴影形状的水平距离":["3.3"]},{"0":["2.7"],"3":["2.3"],"4":["2.3"],"后来":["0.1"],"有人通过":["0.1"],"gecko":["0.1"],"内核的浏览器":["0.1"],"尤其是":["0.1"],"mozilla":["0.1"],"和":["0.1","2.2"],"firefox":["0.1"],"标签使用":["0.2"],"在网页上绘制图像":["0.2"],"百度的":["0.3"],"echart":["0.3"],"banner":["0.3"],"广告":["0.3"],"曾经辉煌的时代":["0.3"],"智能手机还未曾出现":["0.3"],"color":["1.3","1.4"],"gradient":["1.3","1.4","1.10","1.13"],"pattern":["1.3","1.4"],"属性值":["1.3","1.4"],"context":["1.5","1.6","1.10","1.12","1.15","1.16","1.17"],"语法":["1.6","1.10","1.12"],"像素处":["1.7","1.8"],"对象中的何处定位颜色":["1.10","1.12"],"javascript":["1.10","1.12","3.2"],"createlineargradient":["1.10"],"repeat":["1.11"],"x":["1.11","1.20","1.21","1.22","2.9","2.13","2.21"],"y":["1.11","1.20","1.21","1.22","2.9","2.13"],"x0":["1.12"],"y0":["1.12"],"为了获得可见的渐变":["1.13"],"您需要创建至少一个色标":["1.13"],"javascript语法":["1.13","1.15","1.16","1.17","1.28","1.29","1.30","1.31","1.32","1.33","1.34","1.35","1.36","1.38","1.39","1.40","1.41","1.43","1.44","1.45","1.47","1.48","1.49","1.51","1.53","1.54","1.55","1.57","1.58","1.59","1.61","1.62"],"的值":["1.18"],"边角会以":["1.18"],"的":["1.18"],"bevel":["1.18"],"类型来显示":["1.18"],"width":["1.20","1.21","1.22","2.14","2.22"],"height":["1.20","1.22","2.2","2.14","2.22"],"参数值":["1.23"],"参数":["1.23"],"描述":["1.23"],"属性来填充另一种颜色":["1.25"],"渐变":["1.25"],"注意":["1.25"],"方法定义的路径":["1.26"],"默认颜色是黑色":["1.26"],"开始一条路径":["1.27"],"属性":["2.2"],"但是":["2.2"],"属性值单位必须是":["2.2"],"除外":["2.3"],"移动端的兼容情况非常理想":["2.3"],"基本上随便使用":["2.3"],"2d":["2.3"],"对象就是":["2.5"],"操作":["2.5"],"的接口":["2.5"],"从最左上角":["2.7"],"解释":["2.8"],"设置上下文绘制路径的起点":["2.8"],"闭合路径":["2.10"],"closepath":["2.10"],"ctx":["2.11","2.15","3.2","3.3"],"非零环绕规则":["2.12"],"是这么来判断有自我交叉情况的路径的":["2.12"],"对于路径中的任意给定区域":["2.12"],"从该区域内部画一条足够长的线段":["2.12"],"参数同上":["2.14"],"圆心坐标":["2.16"],"r":["2.16"],"半径":["2.16"],"end":["2.18"],"文本在指定的位置结束":["2.18"],"center":["2.18"],"文本的中心被放在指定的位置":["2.18"],"left":["2.18"],"文本左对齐":["2.18"],"fillstyle":["2.19","3.3"],"purple":["2.19"],"设置填充颜色为紫色":["2.19"],"img":["2.21"],"参数说明":["2.22"],"sy":["2.23"],"swidth":["2.23"],"sheight":["2.23"],"new":["2.24"],"image":["2.24"],"这个就是":["2.24"],"一般先进行设置样式然后进行绘制":["3.2"],"例如":["3.2"],"shadowoffsety":["3.3"],"设置或返回阴影形状的垂直距离":["3.3"],"js":["3.3"],"rgba":["3.3"]},{"0":["3.3"],"2":["1.18"],"4":["0.3"],"5":["2.3"],"9":["3.3"],"10":["1.18"],"25":["0.0"],"58":["0.0"],"255":["3.3"],"description":["0.0"],"opera":["0.1"],"chrome":["0.1"],"和超文本网络应用技术工作组建议为下一代的网络技术使用该元素":["0.1"],"是由":["0.1"],"代码配合高度和宽度属性而定义出的可绘制区域":["0.1"],"其本身不具备绘图功能":["0.2"],"拥有多种绘制路径":["0.2"],"矩形":["0.2"],"现在以及未来的智能机时代":["0.3"],"技术能够在":["0.3"],"广告上发挥巨大作用":["0.3"],"用":["0.3"],"实现动态的广告效果再合适不过":["0.3"],"值":["1.3","1.4","1.5"],"描述":["1.3","1.4","1.11","1.12","1.13","1.20","1.21","1.22"],"指定绘图填充色的":["1.3","1.4"],"color":["1.5","1.13"],"属性值":["1.5","1.15","1.17"],"number":["1.6","1.17"],"位置左侧的":["1.7"],"默认值":["1.7","1.8","1.18"],"位置上方的":["1.8"],"x0":["1.10"],"y0":["1.10"],"x1":["1.10","1.12"],"y1":["1.10","1.12"],"参数值":["1.10","1.11","1.12","1.13","1.20","1.21","1.22","1.28","1.29","1.30","1.31","1.32","1.33","1.34","1.35","1.36","1.38","1.39","1.40","1.41","1.43","1.44","1.45","1.47","1.48","1.49","1.51","1.53","1.54","1.55","1.57","1.58","1.59","1.61","1.62"],"参数":["1.10","1.11","1.12","1.13","1.20","1.21","1.22","2.8"],"no":["1.11"],"r0":["1.12"],"r1":["1.12"],"stop":["1.13"],"bevel":["1.16"],"round":["1.16"],"fig3":["1.18"],"limit":["1.18"],"figure":["1.18"],"矩形左上角的":["1.20","1.22"],"height":["1.21","2.13","2.23"],"要清除的矩形左上角的":["1.23"],"坐标":["1.23"],"如果路径未关闭":["1.25"],"那么":["1.25"],"方法会从路径结束点到开始点之间添加一条线":["1.25"],"提示":["1.26"],"请使用":["1.26"],"或者重置当前的路径":["1.27"],"px":["2.2"],"否则忽略":["2.2"],"的支持都非常好":["2.3"],"3d":["2.3"],"webgl":["2.3"],"ie11":["2.3"],"才支持":["2.3"],"其他都支持":["2.3"],"使用":["2.5"],"canvaselement":["2.5"],"getcontext":["2.5"],"2d":["2.5"],"来获取":["2.5"],"绘图上下文":["2.5"],"开始":["2.7"],"x":["2.7","2.15","2.23"],"相当于移动画笔到某个位置":["2.8"],"解释":["2.9","2.10","2.11"],"从x":["2.9"],"如果是绘制不同状态的线段或者形状":["2.10"],"必须使用开始新路径的方法把不同的绘制操作隔开":["2.10"],"使此线段的终点完全落在路径范围之外":["2.12"],"下图中的那三个箭头所描述的就是上面这个步骤":["2.12"],"接下来":["2.12"],"将计数器初始化为0":["2.12"],"然后":["2.12"],"每当这条线段与路径上的直线或曲线相交时":["2.12"],"width":["2.13","2.23"],"注意此方法绘制完路径后立即进行stroke绘制":["2.14"],"y":["2.15","2.21","2.23"],"绘制开始的角度":["2.16"],"圆心到最右边是0度":["2.16"],"顺时针方向弧度增大":["2.16"],"right":["2.18"],"文本右对齐":["2.18"],"font":["2.19"],"20px":["2.19"],"微软雅黑":["2.19"],"设置字体":["2.19"],"textbaseline":["2.19"],"bottom":["2.19"],"绘制图片的宽度":["2.22"],"绘制图片的高度":["2.22"],"标签的":["2.24"],"dom":["2.24"],"red":["3.2"],"ccc":["3.2"]},{"0":["1.13","3.2"],"1":["1.13"],"3":["2.18"],"5":["0.3"],"8":["0.1"],"10":["3.3"],"255":["3.2"],"300":["2.2"],"filepath":["0.0"],"tutorial":["0.0"],"docs":["0.0"],"代码可以访问该区域":["0.1"],"类似于其他通用的二位":["0.1"],"api":["0.1"],"通过一套完整的绘图函数来动态生成图像":["0.1"],"程序从":["0.1"],"gecko1":["0.1"],"圆形":["0.2"],"字符以及添加图像的方法":["0.2"],"之前":["0.2"],"未来":["0.3"],"模拟器":["0.3"],"无论从视觉效果还是核心功能方面来说":["0.3"],"模拟器产品可以完全由":["0.3"],"javascript":["0.3","1.7","1.8"],"来实现":["0.3"],"css":["1.3","1.4"],"颜色值":["1.3","1.4"],"默认值是":["1.3","1.4"],"描述":["1.5","1.10","1.15","1.16","1.17","1.18"],"用于阴影的":["1.5"],"属性值":["1.6","1.16","1.18"],"值":["1.6","1.15","1.16","1.17","1.18"],"语法":["1.7","1.8"],"context":["1.7","1.8","1.18"],"渐变开始点的":["1.10"],"x":["1.10","1.12"],"坐标":["1.10","1.12","1.20","1.21","1.22"],"规定要使用的模式的图片":["1.11"],"画布或视频元素":["1.11"],"默认":["1.11"],"该模式下在水平和垂直方向重复":["1.11"],"渐变开始圆的":["1.12"],"y":["1.12","2.7"],"介于0":["1.13"],"与":["1.13"],"javascript语法":["1.18","1.27"],"number":["1.18"],"矩形左上角的":["1.21"],"已关闭路径":["1.25"],"正如":["1.25"],"closepath":["1.25"],"strokestyle":["1.26"],"属性来填充另一种颜色":["1.26"],"渐变":["1.26"],"转换":["1.36"],"文本":["1.41"],"图像绘制":["1.49"],"像素操作":["1.51"],"合成":["1.59"],"默认是":["2.2"],"150像素":["2.2"],"注意":["2.2"],"不要用":["2.2"],"如果浏览器不兼容":["2.3"],"最好进行友好提示":["2.3"],"html":["2.3"],"id":["2.3"],"cavselm":["2.3","2.5"],"js":["2.5"],"var":["2.5"],"document":["2.5"],"getelementbyid":["2.5"],"向右增大":["2.7"],"y都是相对于":["2.8"],"canvas":["2.8"],"y的位置绘制一条直线到起点或者上一个线头点":["2.9"],"参数":["2.9"],"闭合路径会自动把最后的线头和开始的线头连在一起":["2.10"],"根据路径绘制线":["2.11"],"路径只是草稿":["2.11"],"就改变计数器的值":["2.12"],"如果是与路径的顺时针部分相交":["2.12"],"则加1":["2.12"],"如果是与路径的逆时针部分相交":["2.12"],"则减1":["2.12"],"解释":["2.13"],"y是矩形的左上坐标":["2.13"],"fillrect":["2.14"],"width":["2.15"],"height":["2.15"],"绘制结束的角度":["2.16"],"注意是弧度":["2.16"],"是否是逆时针":["2.16"],"true是逆时针":["2.16"],"false是顺时针":["2.16"],"img":["2.18"],"textbaseline":["2.18"],"设置或返回文本当在绘制文本时使用的当前文本基线":["2.18"],"alphabetic":["2.18"],"文本基线是普通的字母基线":["2.18"],"设置字体底线对齐绘制基线":["2.19"],"textalign":["2.19"],"left":["2.19"],"设置字体对齐的方式":["2.19"],"绘制图片左上角的坐标":["2.21"],"如果指定宽高":["2.22"],"最好成比例":["2.22"],"不然图片会被拉伸":["2.22"],"参数说明":["2.23"],"src":["2.24"],"aicoder":["2.24"],"vip":["2.24"],"doc":["2.24"],"images":["2.24"],"arc":["2.24"],"teal":["3.3"]},{"1":["0.0"],"5":["0.1"],"6":["0.3"],"400":["2.19"],"450":["2.19"],"canvas":["0.0"],"入门":["0.0"],"firefox1":["0.1"],"开始支持":["0.1"],"internet":["0.1"],"explorer":["0.1"],"从":["0.1"],"ie9":["0.1"],"web":["0.2"],"页面只能用一些固定样式的标签":["0.2"],"比如":["0.2"],"p":["0.2"],"远程计算机控制":["0.3"],"可以让开发者更好地实现基于":["0.3"],"的数据传输":["0.3"],"构建一个完美的可视化控制界面":["0.3"],"用于填充绘图的渐变对象":["1.3","1.4"],"线性或者放射性":["1.3","1.4"],"css":["1.5","2.2"],"颜色值":["1.5"],"默认是":["1.5"],"属性":["1.6"],"number":["1.7","1.8"],"属性值":["1.7","1.8"],"值":["1.7","1.8"],"描述":["1.7","1.8"],"y":["1.10"],"渐变结束点的":["1.10"],"该模式只在水平方向重复":["1.11"],"该模式只在垂直方向重复":["1.11"],"开始圆的半径":["1.12"],"渐变结束圆的":["1.12"],"之间的值":["1.13"],"表示渐变中开始与结束之间的位置":["1.13"],"在":["1.13"],"默认":["1.15"],"向线条的每个末端添加平直的边缘":["1.15"],"向线条的每个末端添加圆形线帽":["1.15"],"创建斜角":["1.16"],"创建圆角":["1.16"],"当前线条的宽度":["1.17"],"正数":["1.18"],"规定最大斜接长度":["1.18"],"矩形的宽度":["1.20","1.21","1.22"],"以像素计":["1.20","1.21","1.22","1.23"],"要清除的矩形的宽度":["1.23"],"要清除的矩形的高度":["1.23"],"一样":["1.25"],"然后填充该路径":["1.25"],"javascript语法":["1.25","1.26"],"context":["1.26"],"参数值":["1.27"],"控制它的宽和高":["2.2"],"会造成图片拉伸":["2.2"],"重置设置":["2.2"],"你的浏览器不支持":["2.3"],"请升级浏览器":["2.3"],"浏览器不支持":["2.3"],"显示此行文本":["2.3"],"获取画布":["2.5"],"ctx":["2.5"],"向下增大":["2.7"],"image":["2.7"],"盒子的最左上角":["2.8"],"注意":["2.8"],"核心的作用是将不同绘制的形状进行隔离":["2.10"],"每次执行此方法":["2.10"],"表示重新绘制一个路径":["2.10"],"真正绘制线必须执行":["2.11"],"若计数器的最终值不是0":["2.12"],"那么此区域就在路径里面":["2.12"],"在调用fill":["2.12"],"方法时":["2.12"],"浏览器就会对其进行填充":["2.12"],"width和height都是以像素计":["2.13"],"rect方法只是规划了矩形的路径":["2.13"],"解释":["2.15"],"清除某个矩形内的绘制的内容":["2.15"],"弧度计算公式":["2.16"],"rad":["2.16"],"deg":["2.16"],"math":["2.16"],"pi":["2.16"],"top":["2.18"],"文本基线是em方框的顶端":["2.18"],"hanging":["2.18"],"文本基线是悬挂基线":["2.18"],"middle":["2.18"],"文本基线是em方框的正中":["2.18"],"绘制图片的":["2.21"],"dom":["2.21"],"等比公式":["2.22"],"toh":["2.22"],"tow":["2.22"],"裁剪的左上角坐标":["2.23"],"裁剪图片的宽度":["2.23"],"gif":["2.24"],"alt":["2.24"],"文本信息":["2.24"]},{"6":["2.3","3.2"],"9":["0.1"],"100":["0.3","2.19","3.3"],"180":["2.16"],"md":["0.0"],"也支持":["0.1"],"div":["0.2"],"h1":["0.2"],"等":["0.2"],"图形编辑器":["0.3"],"photoshop":["0.3"],"图形编辑器将能够":["0.3"],"基于":["0.3"],"实现":["0.3"],"用于填充绘图的":["1.3","1.4"],"对象":["1.3","1.4","2.21"],"属性的模糊级别":["1.6"],"正值或者负值":["1.7","1.8"],"定义形状与阴影的水平距离":["1.7"],"定义形状与阴影的垂直距离":["1.8"],"该模式只显示一次":["1.11"],"不重复":["1.11"],"结束圆的半径":["1.12"],"位置显示的css颜色值":["1.13"],"二":["1.13"],"线条样式":["1.13"],"向线条的每个末端添加正方形线帽":["1.15"],"默认":["1.16"],"创建尖角":["1.16"],"以像素计":["1.17"],"矩形":["1.18"],"矩形的高度":["1.20","1.21","1.22"],"路径":["1.23"],"context":["1.25"],"标签的宽高属性会让画布擦除所有的内容":["2.2"],"可以给":["2.2"],"画布设置背景色":["2.2"],"浏览器不兼容":["2.3"],"可以使用":["2.3"],"flash":["2.3"],"等手段进行优雅降级":["2.3"],"注意":["2.5"],"小写":["2.5"],"3d":["2.5"],"webgl":["2.5"],"20240527174058188":["2.7"],"绘制线段钱必须先设置起点":["2.8"],"线头点坐标":["2.9"],"跟之前的绘制的墨迹可以进行分开样式设置和管理":["2.10"],"如果最终值是0":["2.12"],"那么此区域就不在路径内部":["2.12"],"浏览器也就不会对其进行填充了":["2.12"],"img":["2.12"],"并没有填充和描边":["2.13"],"此方法执行完成后":["2.14"],"立即对当前矩形进行fill填充":["2.14"],"相当于橡皮擦":["2.15"],"在math提供的方法中":["2.16"],"sin":["2.16"],"cos等使用的都是弧度":["2.16"],"ideographic":["2.18"],"文本基线是em的基线":["2.18"],"bottom":["2.18"],"文本基线是em方框的底端":["2.18"],"top":["2.19"],"g":["2.19"],"填充文字":["2.19"],"等比":["2.22"],"裁剪图片的高度":["2.23"],"onload":["2.24"],"function":["2.24"],"图片加载完成后":["2.24"],"执行此方法":["2.24"],"fillrect":["3.3"]}]'},t={"0.0":{t:"<!--\r",p:`
@Date: 2024-05-27 17:01:21
@LastEditTime: 2024-05-27 17:58:25
@Description:
@FilePath: /tutorial/do ...`,l:"canvas/1.入门.html",a:""},"0.1":{t:"1. canvas 简介\r",p:"​ &lt;canvas&gt;是 html5 新增的，一个可以使用脚本(通常为 JavaScript)在其中绘制图像的 HTML 元素。他可以用来制作照片集或者制作简单的(也不是那么简单)的动画，甚 ...",l:"canvas/1.入门.html#_1-canvas-简介",a:"_1-canvas-简介"},"0.2":{t:"2. 什么是 canvas\r",p:`
是 HTML5 提供的一个新标签
Canvas 是一个矩形区域的画布，可以用 JavaScript 在上面绘画，控制其每一个像素。
Canvas 标签使用 JavaScript 在网页上绘制图像，其 ...`,l:"canvas/1.入门.html#_2-什么是-canvas",a:"_2-什么是-canvas"},"0.3":{t:"3. Canvas 主要应用的领域(了解)\r",p:`
游戏：canvas 在基于 Web 的图像显示方面比 Flash 更加立体、更加精巧，canvas 游戏在流畅度和跨平台方面更牛。
25 超棒的 HTML5 Canvas 游戏
可视化数据.数据图表 ...`,l:"canvas/1.入门.html#_3-canvas-主要应用的领域-了解",a:"_3-canvas-主要应用的领域-了解"},"1.0":{t:"# Canvas API\r",p:"\r",l:"canvas/2.Canvas API.html",a:"canvas-api"},"1.1":{t:"一、颜色、样式和阴影\r",p:"\r",l:"canvas/2.Canvas API.html#一、颜色、样式和阴影",a:"一、颜色、样式和阴影"},"1.2":{t:"属性\r",p:"\r",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.3":{t:"1. fillStyle\r",p:`作用：设置或返回用于填充绘画的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.fillStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_1-fillstyle",a:"_1-fillstyle"},"1.4":{t:"2. strokeStyle\r",p:`作用：设置或返回用于笔触的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.strokeStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_2-strokestyle",a:"_2-strokestyle"},"1.5":{t:"3. shadowColor\r",p:`作用：设置或返回用于阴影的颜色
默认值：#000000
JavaScript 语法：context.shadowColor=color;
属性值



值
描述




color
用于阴影的 css ...`,l:"canvas/2.Canvas API.html#_3-shadowcolor",a:"_3-shadowcolor"},"1.6":{t:"4. shadowBlur\r",p:`作用：设置或返回用于阴影的模糊级别
默认值：
JavaScript 语法：context.shadowBlur=number
属性值



值
属性




number
属性的模糊级别



`,l:"canvas/2.Canvas API.html#_4-shadowblur",a:"_4-shadowblur"},"1.7":{t:"5. shadowOffsetX\r",p:`作用：设置或返回阴影与形状的水平距离
shadowOffsetX = 0 指示阴影位于形状的正下方
shadowOffsetX = 20 指示阴影位于形状 left 位置右侧的 20 像素处
shad ...`,l:"canvas/2.Canvas API.html#_5-shadowoffsetx",a:"_5-shadowoffsetx"},"1.8":{t:"6. shadowOffsetY\r",p:`作用：设置或返回阴影与形状的垂直距离
shadowOffsetY = 0 指示阴影位于形状的正下方
shadowOffsetY = 20 指示阴影位于形状 top 位置下方的 20 像素处
shado ...`,l:"canvas/2.Canvas API.html#_6-shadowoffsety",a:"_6-shadowoffsety"},"1.9":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.10":{t:"1. createLineGradient()\r",p:`作用：创建线性渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop() 方法规定不 ...`,l:"canvas/2.Canvas API.html#_1-createlinegradient",a:"_1-createlinegradient"},"1.11":{t:"2. createPattern()\r",p:`作用：在指定的方向上重复制定的元素
元素可以是图片、视频，或者其他 &lt;canvas&gt; 元素
被重复的元素可用于绘制/填充矩形、圆形或者线条等等。
JavaScript语法：context. ...`,l:"canvas/2.Canvas API.html#_2-createpattern",a:"_2-createpattern"},"1.12":{t:"3. createRadialGradient()\r",p:`作用：创建放射状/环形的渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop()  ...`,l:"canvas/2.Canvas API.html#_3-createradialgradient",a:"_3-createradialgradient"},"1.13":{t:"4. addColorStop()\r",p:`作用：规定渐变对象中的颜色和停止位置
addColorStop() 方法与 createLinearGradient() 和 createRadialGradient() 一起使用
注意：您可以多次调 ...`,l:"canvas/2.Canvas API.html#_4-addcolorstop",a:"_4-addcolorstop"},"1.14":{t:"属性\r",p:"\r",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.15":{t:"1. lineCap\r",p:`作用：设置或返回线条的结束端点样式
&quot;round&quot; 和 &quot;square&quot; 会使线条略微变长
默认值：butt
JavaScript语法：context.line ...`,l:"canvas/2.Canvas API.html#_1-linecap",a:"_1-linecap"},"1.16":{t:"2. lineJoin\r",p:`作用：设置或返回两条线相交时，所创建的拐角类型
注意：&quot;miter&quot; 值受 &quot;miterLimit&quot; 属性的影响
默认值：miter
JavaScript语法： ...`,l:"canvas/2.Canvas API.html#_2-linejoin",a:"_2-linejoin"},"1.17":{t:"3. lineWidth\r",p:`作用：设置或返回当前的线条宽度
默认值：1
JavaScript语法：context.lineWidth = number
属性值



值
描述




number
当前线条的宽度，以像素计


 ...`,l:"canvas/2.Canvas API.html#_3-linewidth",a:"_3-linewidth"},"1.18":{t:"4. miterLimit\r",p:`作用：设置或返回最大斜接长度
斜接长度指的是在两条线交汇处内角和外角之间的距离
提示：只有当 lineJoin 属性为 &quot;miter&quot; 时， miterLimit 才有效。
边角的 ...`,l:"canvas/2.Canvas API.html#_4-miterlimit",a:"_4-miterlimit"},"1.19":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.20":{t:"1. rect()\r",p:`作用：创建矩形
提示：请使用 stroke() 或 fill() 方法在画布上实际地绘制矩形。
JavaScript语法：context.rect(x, y, width, height)
参数值

 ...`,l:"canvas/2.Canvas API.html#_1-rect",a:"_1-rect"},"1.21":{t:"2. fillRect()\r",p:`作用：创建“被填充”的矩形。默认的填充颜色是黑色
提示：请使用 fillStyle 属性来设置用于填充绘图的颜色、渐变或模式
JavaScript语法：context.fillRect(x, y, w ...`,l:"canvas/2.Canvas API.html#_2-fillrect",a:"_2-fillrect"},"1.22":{t:"3. strokeRect()\r",p:`作用：绘制矩形（无填充）。笔触的默认颜色是黑色
提示：请使用 strokeStyle 属性来设置笔触的颜色、渐变或模式
JavaScript语法：context.strokeRect(x, y, wi ...`,l:"canvas/2.Canvas API.html#_3-strokerect",a:"_3-strokerect"},"1.23":{t:"4. clearRect()\r",p:`作用：在给定的矩形内清除指定的像素
JavaScript语法：context.clearRect(x, y, width, height)
参数值



参数
描述




x
要清除的矩形左上角的  ...`,l:"canvas/2.Canvas API.html#_4-clearrect",a:"_4-clearrect"},"1.24":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.25":{t:"1. fill()\r",p:`作用：填充当前的图像/路径。默认是黑色。
提示：请使用 fillStyle 属性来填充另一种颜色/渐变
注意：如果路径未关闭，那么 fIll() 方法会从路径结束点到开始点之间添加一条线，已关闭路径（ ...`,l:"canvas/2.Canvas API.html#_1-fill",a:"_1-fill"},"1.26":{t:"2. stroke()\r",p:`作用：实际地绘制出通过 moveTo() 和 lineTo() 方法定义的路径。默认颜色是黑色。
提示：请使用 strokeStyle 属性来填充另一种颜色/渐变
JavaScript语法：conte ...`,l:"canvas/2.Canvas API.html#_2-stroke",a:"_2-stroke"},"1.27":{t:"3. beginPath()\r",p:`作用：开始一条路径，或者重置当前的路径
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_3-beginpath",a:"_3-beginpath"},"1.28":{t:"4. moveTo()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_4-moveto",a:"_4-moveto"},"1.29":{t:"5. closePath()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_5-closepath",a:"_5-closepath"},"1.30":{t:"6. lineTo()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_6-lineto",a:"_6-lineto"},"1.31":{t:"7. clip()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_7-clip",a:"_7-clip"},"1.32":{t:"8. quadraticCurveTo()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_8-quadraticcurveto",a:"_8-quadraticcurveto"},"1.33":{t:"9. bezierCurveTo()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_9-beziercurveto",a:"_9-beziercurveto"},"1.34":{t:"10. arc()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_10-arc",a:"_10-arc"},"1.35":{t:"11. arcTo()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_11-arcto",a:"_11-arcto"},"1.36":{t:"12. isPointPath()\r",p:`作用：
JavaScript语法：
参数值
转换
`,l:"canvas/2.Canvas API.html#_12-ispointpath",a:"_12-ispointpath"},"1.37":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.38":{t:"1. scale()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-scale",a:"_1-scale"},"1.39":{t:"2. rotate()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-rotate",a:"_2-rotate"},"1.40":{t:"3. translate()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_3-translate",a:"_3-translate"},"1.41":{t:"4. setTransfrom()\r",p:`作用：
JavaScript语法：
参数值
文本
`,l:"canvas/2.Canvas API.html#_4-settransfrom",a:"_4-settransfrom"},"1.42":{t:"属性\r",p:"\r",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.43":{t:"1. font\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-font",a:"_1-font"},"1.44":{t:"2. textAlign\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-textalign",a:"_2-textalign"},"1.45":{t:"3. textBaseline\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_3-textbaseline",a:"_3-textbaseline"},"1.46":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.47":{t:"1. fillText()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-filltext",a:"_1-filltext"},"1.48":{t:"2. strokeText()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-stroketext",a:"_2-stroketext"},"1.49":{t:"3. measureText()\r",p:`作用：
JavaScript语法：
参数值
图像绘制
`,l:"canvas/2.Canvas API.html#_3-measuretext",a:"_3-measuretext"},"1.50":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.51":{t:"1. drawImage()\r",p:`作用：
JavaScript语法：
参数值
像素操作
`,l:"canvas/2.Canvas API.html#_1-drawimage",a:"_1-drawimage"},"1.52":{t:"属性\r",p:"\r",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.53":{t:" 1. width\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-width",a:"_1-width"},"1.54":{t:"2. height \r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-height",a:"_2-height"},"1.55":{t:"3. data\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_3-data",a:"_3-data"},"1.56":{t:"方法\r",p:"\r",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.57":{t:"1. createImageData()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-createimagedata",a:"_1-createimagedata"},"1.58":{t:"2. getImageData()\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-getimagedata",a:"_2-getimagedata"},"1.59":{t:"3. putImageData()\r",p:`作用：
JavaScript语法：
参数值
合成
`,l:"canvas/2.Canvas API.html#_3-putimagedata",a:"_3-putimagedata"},"1.60":{t:"属性\r",p:"\r",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.61":{t:"1. globalAlpha\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_1-globalalpha",a:"_1-globalalpha"},"1.62":{t:"2. globalCompositeOperation\r",p:`作用：
JavaScript语法：
参数值
`,l:"canvas/2.Canvas API.html#_2-globalcompositeoperation",a:"_2-globalcompositeoperation"},"2.0":{t:"# Canvas绘图基础\r",p:"\r",l:"canvas/2.canvas绘图基础.html",a:"canvas绘图基础"},"2.1":{t:"1. Canvas 标签\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_1-canvas-标签",a:"_1-canvas-标签"},"2.2":{t:"1.1 Canvas 标签语法和属性(重点)\r",p:`canvas：画布油布的意思
标签名 canvas，需要进行闭合。就是一个普通的 html 标签
可以是在 width 和 height 属性，但是属性值单位必须是 px，否则忽略。
width 和  ...`,l:"canvas/2.canvas绘图基础.html#_1-1-canvas-标签语法和属性-重点",a:"_1-1-canvas-标签语法和属性-重点"},"2.3":{t:"1.2 浏览器不兼容处理\r",p:`

IE9 以上才支持 canvas，其他 chrome、Firefox、苹果浏览器等都支持


只要浏览器兼容 canvas，那么就会支持绝大部分 API(个别最新 api 除外)


移动端的兼容 ...`,l:"canvas/2.canvas绘图基础.html#_1-2-浏览器不兼容处理",a:"_1-2-浏览器不兼容处理"},"2.4":{t:"2 Canvas绘图上下文 Context\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_2-canvas绘图上下文-context",a:"_2-canvas绘图上下文-context"},"2.5":{t:"2.1 Context： Canvas 的上下文、绘制环境\r",p:`上下文：上知天文，下知地理。是所有的绘制操作 api 的入口或者集合。
Canvas 自身无法绘制任何内容。Canvas 的绘图是使用 JavaScript 操作的。
Context 对象就是 Jav ...`,l:"canvas/2.canvas绘图基础.html#_2-1-context-canvas-的上下文、绘制环境",a:"_2-1-context-canvas-的上下文、绘制环境"},"2.6":{t:"3.基本绘制路径\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_3-基本绘制路径",a:"_3-基本绘制路径"},"2.7":{t:"3.1 Canvas 坐标系\r",p:`canvas 坐标系，从最左上角 0,0 开始。x 向右增大，y 向下增大
!image-20240527174058188
`,l:"canvas/2.canvas绘图基础.html#_3-1-canvas-坐标系",a:"_3-1-canvas-坐标系"},"2.8":{t:"3.2设置绘制起始点\r",p:`ctx.moveTo(x,y)

解释：设置上下文绘制路径的起点。相当于移动画笔到某个位置
参数：x，y都是相对于 canvas 盒子的最左上角
注意：绘制线段钱必须先设置起点
`,l:"canvas/2.canvas绘图基础.html#_3-2设置绘制起始点",a:"_3-2设置绘制起始点"},"2.9":{t:"3.3 绘制直线\r",p:`ctx.lineTo(x,y)

解释：从x,y的位置绘制一条直线到起点或者上一个线头点。
参数：x,y 线头点坐标。
`,l:"canvas/2.canvas绘图基础.html#_3-3-绘制直线",a:"_3-3-绘制直线"},"2.10":{t:"3.4 路径开始和闭合\r",p:`开始路径：ctx.beginPath()
闭合路径：ctx.closePath()

解释：如果是绘制不同状态的线段或者形状，必须使用开始新路径的方法把不同的绘制操作隔开。闭合路径会自动把最后的线头和 ...`,l:"canvas/2.canvas绘图基础.html#_3-4-路径开始和闭合",a:"_3-4-路径开始和闭合"},"2.11":{t:"3.5 描边(stroke)\r",p:`ctx.stroke()

解释：根据路径绘制线，路径只是草稿，真正绘制线必须执行 stroke()
`,l:"canvas/2.canvas绘图基础.html#_3-5-描边-stroke",a:"_3-5-描边-stroke"},"2.12":{t:"3.6 填充(fill)\r",p:`ctx.fill()

解释：填充，是将闭合路径的内容填充具体的颜色。默认是黑色。
注意：交叉路径的填充问题：&quot;非零环绕原则&quot;，顺逆时针穿插次数决定是否填充。
非零环绕原则
​		 ...`,l:"canvas/2.canvas绘图基础.html#_3-6-填充-fill",a:"_3-6-填充-fill"},"2.13":{t:"3.7 快速创建矩形rect()方法\r",p:`ctx.rect(x,y,width,height)

解释：x，y是矩形的左上坐标，width和height都是以像素计
rect方法只是规划了矩形的路径，并没有填充和描边。
`,l:"canvas/2.canvas绘图基础.html#_3-7-快速创建矩形rect-方法",a:"_3-7-快速创建矩形rect-方法"},"2.14":{t:"3.8 快速创建描边矩形和填充矩形\r",p:`ctx.strokeRect(x, y, width, height)


参数同上，注意此方法绘制完路径后立即进行stroke绘制

ctx.fillRect(x, y, width, height ...`,l:"canvas/2.canvas绘图基础.html#_3-8-快速创建描边矩形和填充矩形",a:"_3-8-快速创建描边矩形和填充矩形"},"2.15":{t:"3.9 清除矩形（clearRect）\r",p:`ctx.clearRect(x, y, width, height)

解释：清除某个矩形内的绘制的内容，相当于橡皮擦
`,l:"canvas/2.canvas绘图基础.html#_3-9-清除矩形-clearrect",a:"_3-9-清除矩形-clearrect"},"2.16":{t:"4. 绘制圆形\r",p:`概述：arc()方法创建弧/曲线（用于创建圆或部分圆）
语法：ctx.arc(x, y, sAngle, eAngle, counterclockwise)
解释：
- x,y：圆心坐标，
- r：半 ...`,l:"canvas/2.canvas绘图基础.html#_4-绘制圆形",a:"_4-绘制圆形"},"2.17":{t:"5. 绘制文字\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_5-绘制文字",a:"_5-绘制文字"},"2.18":{t:"5.1 绘制上下文的文字属性\r",p:`

font：设置或返回文本内容的当前字体属性
font属性使用的语法和css font属性相同
ctx.font=&quot;18px 微软雅黑&quot;



textAlign： 设置或者返回 ...`,l:"canvas/2.canvas绘图基础.html#_5-1-绘制上下文的文字属性",a:"_5-1-绘制上下文的文字属性"},"2.19":{t:"5.2 上下文绘制文字的方法\r",p:`ctx.fillText() ：在画布上绘制被填充的文本
ctx.strokeText()：在画布上绘制文本（无填充）
ctx.measureText()：返回包含指定文本宽度的对象
//综合案例代码 ...`,l:"canvas/2.canvas绘图基础.html#_5-2-上下文绘制文字的方法",a:"_5-2-上下文绘制文字的方法"},"2.20":{t:"6. 绘制图片(drawImage)\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_6-绘制图片-drawimage",a:"_6-绘制图片-drawimage"},"2.21":{t:"6.1 基本绘制图片的方式\r",p:`ctx.drawImage(img, x, y)

x, y：绘制图片左上角的坐标
img：绘制图片的 dom 对象
`,l:"canvas/2.canvas绘图基础.html#_6-1-基本绘制图片的方式",a:"_6-1-基本绘制图片的方式"},"2.22":{t:"6.2 在画布上绘制图像，并规定图像的宽高\r",p:`ctx.drawImage(img, x, y, width, height)

参数说明

width：绘制图片的宽度
height：绘制图片的高度

如果指定宽高，最好成比例，不然图片会被拉伸
等 ...`,l:"canvas/2.canvas绘图基础.html#_6-2-在画布上绘制图像-并规定图像的宽高",a:"_6-2-在画布上绘制图像-并规定图像的宽高"},"2.23":{t:"6.3 图片裁剪，并在画布上定位被剪切的部分\r",p:`ctx.drawImage(img, sx, sy, swidth, sheight, x, y, width, height)

参数说明

sx, sy：裁剪的左上角坐标
swidth：裁剪图片的 ...`,l:"canvas/2.canvas绘图基础.html#_6-3-图片裁剪-并在画布上定位被剪切的部分",a:"_6-3-图片裁剪-并在画布上定位被剪切的部分"},"2.24":{t:"6.4 用 JavaScript 创建 img 对象\r",p:`第一种方式：
var img = document.getElementById('imgId')

第二种方式：
var img = new Image(); // 这个就是 img 标签的 dom ...`,l:"canvas/2.canvas绘图基础.html#_6-4-用-javascript-创建-img-对象",a:"_6-4-用-javascript-创建-img-对象"},"3.0":{t:"# Canvas 进阶\r",p:"\r",l:"canvas/3.canvas进阶.html",a:"canvas-进阶"},"3.1":{t:"1. Canvas颜色样式和阴影\r",p:"\r",l:"canvas/3.canvas进阶.html#_1-canvas颜色样式和阴影",a:"_1-canvas颜色样式和阴影"},"3.2":{t:"1.1 设置填充色和描边的颜色\r",p:`
fillStyle：设置或返回用于填充绘画的颜色
strokeStyle：设置或返回用于笔触的颜色

以上两个值都可以接受颜色名、16 进制数据、rgb 值，甚至 rgba。一般先进行设置样式然后进 ...`,l:"canvas/3.canvas进阶.html#_1-1-设置填充色和描边的颜色",a:"_1-1-设置填充色和描边的颜色"},"3.3":{t:"1.2 设置阴影\r",p:`类比于 CSS3 的阴影
- shadowColor：设置或返回用于阴影的颜色
- shadowBlur：设置或返回用于阴影的模糊级别，大于 1 的正整数，数值越高，模糊程度越大
- shadowOf ...`,l:"canvas/3.canvas进阶.html#_1-2-设置阴影",a:"_1-2-设置阴影"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},e={INDEX_DATA:a,PREVIEW_LOOKUP:t,Options:n};export{e as default};
