const a={map:'[{"canvas":["1.0","3.0"],"一":["1.1"],"属性":["1.2","1.15","1.48","1.60","1.69"],"方法":["1.9","1.21","1.27","1.41","1.52","1.57","1.64","1.73"],"二":["1.14"],"三":["1.20"],"四":["1.26"],"五":["1.40"],"六":["1.47"],"七":["1.56"],"八":["1.59"],"九":["1.68"],"十":["1.72"],"canvas绘图基础":["2.0"]},{"0":["1.37","1.44"],"1":["0.1","0.3","1.3","1.10","1.16","1.22","1.28","1.42","1.49","1.53","1.58","1.61","1.65","1.70","1.74","2.1","2.2","2.3","2.5","2.7","2.18","2.21","3.1","3.2","3.3"],"2":["0.2","1.4","1.11","1.17","1.23","1.29","1.43","1.50","1.54","1.62","1.66","1.71","1.75","2.3","2.4","2.5","2.19","2.22","3.3"],"3":["0.3","1.5","1.12","1.18","1.24","1.30","1.44","1.51","1.55","1.63","1.67","1.76","2.6","2.7","2.8","2.9","2.10","2.11","2.12","2.13","2.14","2.15","2.23"],"4":["1.6","1.13","1.19","1.25","1.31","1.45","1.77","2.10","2.16","2.24"],"5":["1.7","1.32","1.46","1.78","2.17","2.18","2.19"],"6":["1.8","1.33","2.12","2.20","2.21","2.22","2.23","2.24"],"7":["1.34","2.13"],"8":["1.35","2.14"],"9":["1.36"],"10":["1.37"],"11":["1.38"],"12":["1.39"],"2024":["0.0"],"date":["0.0"],"05":["0.0"],"canvas":["0.1","0.2","0.3","1.78","2.2","2.5"],"简介":["0.1"],"是":["0.1","0.2"],"html5":["0.1"],"新增的":["0.1"],"一个可以使用脚本":["0.1"],"什么是":["0.2"],"主要应用的领域":["0.3"],"了解":["0.3"],"游戏":["0.3"],"在基于":["0.3"],"api":["1.0"],"颜色":["1.1"],"fillstyle":["1.3","3.2"],"作用":["1.3","1.4","1.7","1.8","1.10","1.11","1.12","1.13","1.16","1.17","1.19","1.22","1.23","1.24","1.25","1.28","1.31","1.33","1.35","1.36","1.37","1.38","1.39","1.42","1.44","1.45","1.46","1.49","1.50","1.51","1.53","1.54","1.58","1.63","1.65","1.66","1.67","1.70","1.71","1.78"],"strokestyle":["1.4"],"shadowcolor":["1.5"],"shadowblur":["1.6"],"shadowoffsetx":["1.7"],"设置或返回阴影与形状的水平距离":["1.7"],"shadowoffsety":["1.8"],"设置或返回阴影与形状的垂直距离":["1.8"],"createlinegradient":["1.10"],"创建线性渐变":["1.10"],"用在画布内容上":["1.10","1.12"],"渐变可用于填充矩形":["1.10"],"createpattern":["1.11"],"在指定的方向上重复制定的元素":["1.11"],"元素可以是图片":["1.11"],"createradialgradient":["1.12"],"创建放射状":["1.12"],"环形的渐变":["1.12"],"addcolorstop":["1.13"],"规定渐变对象中的颜色和停止位置":["1.13"],"线条样式":["1.14"],"linecap":["1.16"],"linejoin":["1.17"],"linewidth":["1.18"],"miterlimit":["1.19"],"设置或返回最大斜接长度":["1.19"],"斜接长度指的是在两条线交汇处内角和外角之间的距离":["1.19"],"提示":["1.19","1.37"],"矩形":["1.20"],"rect":["1.22"],"创建矩形":["1.22"],"fillrect":["1.23"],"创建":["1.23","2.24"],"strokerect":["1.24"],"绘制矩形":["1.24"],"clearrect":["1.25"],"路径":["1.26"],"fill":["1.28","2.12"],"stroke":["1.29"],"moveto":["1.31"],"closepath":["1.32"],"lineto":["1.33"],"clip":["1.34"],"quadraticcurveto":["1.35"],"通过使用表示二次贝塞尔曲线的指定控制点":["1.35"],"向当前路径添加一个点":["1.35","1.36"],"二次贝塞尔曲线需要两个点":["1.35"],"第一个点用于二次贝塞尔曲线计算中的控制点":["1.35"],"beziercurveto":["1.36"],"通过使用表示三次贝塞尔曲线的制定控制点":["1.36"],"三次贝塞尔曲线需要三个点":["1.36"],"前两个是用于贝塞尔计算值的控制点":["1.36"],"第三个点是曲线的结束点":["1.36"],"曲线的开始点是当前路径中最后一个点":["1.36"],"如果路径不存在":["1.36"],"arc":["1.37","2.16"],"创建弧":["1.37"],"曲线":["1.37"],"用于创建圆或部分圆":["1.37"],"如需通过":["1.37"],"来创建圆":["1.37"],"请把其实角设置为":["1.37"],"arcto":["1.38"],"在画布上创建介于两个切线之间的弧":["1.38"],"ispointpath":["1.39"],"转换":["1.40"],"scale":["1.42"],"缩放当前绘图至更大或更小":["1.42"],"注意":["1.42"],"rotate":["1.43"],"translate":["1.44"],"重新映射画布上的":["1.44"],"transform":["1.45"],"替换当前绘图的变换矩阵":["1.45"],"它以下面描述的矩阵来操作当前的变换矩阵":["1.45"],"a":["1.45"],"c":["1.45"],"e":["1.45"],"settransfrom":["1.46"],"把当前的变换矩阵重置为单位矩阵":["1.46"],"然后以相同的参数运行":["1.46"],"文本":["1.47"],"font":["1.49","2.18"],"设置或返回文本内容当前的字体属性":["1.49"],"默认值":["1.49"],"10px":["1.49"],"sans":["1.49"],"serif":["1.49"],"javascript":["1.49","1.58","2.24"],"语法":["1.49","1.58"],"context":["1.49","2.5"],"textalign":["1.50"],"设置或返回文本内容的当前对齐方式":["1.50"],"通常":["1.50"],"文本会从指定位置":["1.50"],"textbaseline":["1.51"],"设置或返回在绘制文本时使用的当前文本基线":["1.51"],"illustration":["1.51"],"filltext":["1.53","2.19"],"在画布上绘制":["1.53"],"被填充的":["1.53"],"stroketext":["1.54"],"在画布上绘制文本":["1.54"],"无填充色":["1.54"],"measuretext":["1.55"],"图像绘制":["1.56"],"drawimage":["1.58"],"向画布上绘制图像":["1.58"],"画布或视频":["1.58"],"用法":["1.58"],"描述":["1.58"],"像素操作":["1.59"],"data":["1.63"],"返回一个对象":["1.63"],"其包含指定的":["1.63"],"imagedata":["1.63","1.65","1.67"],"createimagedata":["1.65"],"创建新的空白":["1.65"],"对象":["1.65","1.67"],"新对象默认像素值":["1.65"],"transparent":["1.65"],"black":["1.65"],"对于":["1.65"],"对象中的每个像素":["1.65"],"都存在着四方面的信息":["1.65"],"getimagedata":["1.66"],"返回":["1.66","1.78"],"putimagedata":["1.67"],"将图像数据":["1.67"],"从指定的":["1.67"],"合成":["1.68"],"globalalpha":["1.70"],"设置或返回绘图的当前":["1.70"],"alpha":["1.70"],"globalcompositeoperation":["1.71"],"设置或返回新图像如何绘制到已有的图像上":["1.71"],"新图像":["1.71"],"您打算放置到画布上的绘图":["1.71"],"目标图像":["1.71"],"您已经放置在画布上的绘图":["1.71"],"其他":["1.72"],"todataurl":["1.78"],"标签语法和属性":["2.2"],"重点":["2.2"],"浏览器不兼容处理":["2.3"],"ie9":["2.3"],"以上才支持":["2.3"],"的上下文":["2.5"],"绘制环境":["2.5"],"2设置绘制起始点":["2.8"],"填充":["2.12"],"js":["2.12"],"绘制圆形":["2.16"],"概述":["2.16"],"方法创建弧":["2.16"],"绘制上下文的文字属性":["2.18"],"设置或返回文本内容的当前字体属性":["2.18"],"上下文绘制文字的方法":["2.19"],"ctx":["2.19"],"在画布上绘制被填充的文本":["2.19"],"在画布上绘制图像":["2.22"],"图片裁剪":["2.23"],"用":["2.24"],"进阶":["3.0"],"设置填充色和描边的颜色":["3.2"],"设置阴影":["3.3"],"类比于":["3.3"],"css3":["3.3"]},{"0":["1.7","1.8","1.45","1.65"],"1":["1.45"],"2":["1.37"],"5":["2.11"],"9":["2.15"],"16":["3.2"],"17":["0.0"],"20":["1.36"],"25":["0.3"],"27":["0.0"],"255":["1.65"],"01":["0.0"],"通常为":["0.1"],"javascript":["0.1","1.25","1.67","1.71","1.78"],"在其中绘制图像的":["0.1"],"html":["0.1"],"元素":["0.1","1.11"],"他可以用来制作照片集或者制作简单的":["0.1"],"也不是那么简单":["0.1"],"的动画":["0.1"],"html5":["0.2"],"提供的一个新标签":["0.2"],"是一个矩形区域的画布":["0.2"],"web":["0.3"],"的图像显示方面比":["0.3"],"flash":["0.3"],"更加立体":["0.3"],"更加精巧":["0.3"],"游戏在流畅度和跨平台方面更牛":["0.3"],"样式和阴影":["1.1"],"设置或返回用于填充绘画的颜色":["1.3","3.2"],"渐变或模式":["1.3","1.4"],"默认值":["1.3","1.4","1.5","1.71"],"000000":["1.3","1.4"],"设置或返回用于笔触的颜色":["1.4","3.2"],"作用":["1.5","1.6","1.18","1.29","1.32","1.34","1.43","1.55","1.61","1.62","1.74","1.75","1.77"],"设置或返回用于阴影的颜色":["1.5","3.3"],"设置或返回用于阴影的模糊级别":["1.6","3.3"],"指示阴影位于形状的正下方":["1.7","1.8"],"圆形":["1.10","1.12"],"线条":["1.10","1.12"],"文本等等":["1.10","1.12"],"该对象作为":["1.10","1.12"],"strokestyle":["1.10","1.12","1.24","3.2"],"或":["1.10","1.12","1.22","1.37","1.51","1.70"],"视频":["1.11"],"或者其他":["1.11"],"canvas":["1.11","2.1","2.3","2.7"],"被重复的元素可用于绘制":["1.11"],"填充矩形":["1.11"],"渐变可用于填充矩形":["1.12"],"方法与":["1.13"],"createlineargradient":["1.13"],"和":["1.13","1.16","1.35","1.36"],"createradialgradient":["1.13"],"一起使用":["1.13"],"设置或返回线条的结束端点样式":["1.16"],"round":["1.16"],"square":["1.16"],"设置或返回两条线相交时":["1.17"],"所创建的拐角类型":["1.17"],"注意":["1.17","1.44","1.51","1.66"],"miter":["1.17","1.19"],"设置或返回当前的线条宽度":["1.18"],"只有当":["1.19"],"linejoin":["1.19"],"属性为":["1.19"],"时":["1.19"],"才有效":["1.19"],"提示":["1.22","1.23","1.24","1.31","1.32","1.33","1.34","1.38","1.53","1.54","1.55"],"请使用":["1.22","1.23","1.24","1.37","1.38","1.53","1.54"],"stroke":["1.22","1.37"],"fill":["1.22","1.37"],"被填充":["1.23"],"的矩形":["1.23"],"默认的填充颜色是黑色":["1.23"],"无填充":["1.24","2.19"],"笔触的默认颜色是黑色":["1.24"],"在给定的矩形内清除指定的像素":["1.25"],"语法":["1.25","1.67","1.71","1.78","2.16"],"context":["1.25","1.58","1.67","1.71"],"填充当前的图像":["1.28"],"路径":["1.28"],"默认是黑色":["1.28"],"实际地绘制出通过":["1.29"],"beginpath":["1.30","1.35","1.36"],"把路径移动到画布中的指定点":["1.31"],"不创建线条":["1.31"],"创建从当前点到开始点的路径":["1.32"],"添加一个新点":["1.33"],"然后创建从该点到画布中最后指定点的线条":["1.33"],"该方法并不会创建线条":["1.33"],"从原画布中裁剪任意形状和尺寸":["1.34"],"第二个点是曲线的结束点":["1.35"],"曲线的开始点是当前路径中的最后一个点":["1.35"],"如果路径不存在":["1.35"],"那么请使用":["1.35","1.36"],"moveto":["1.35","1.36"],"方法来定义开始点":["1.35","1.36"],"三次贝塞尔曲线":["1.36"],"开始点":["1.36"],"控制点":["1.36"],"结束角设置为":["1.37"],"math":["1.37"],"pi":["1.37"],"方法在画布上绘制实际的弧":["1.37"],"an":["1.37"],"中心":["1.37"],"曲线":["1.38","2.16"],"img":["1.38","1.58","2.24"],"如果指定点位于当前路径中":["1.39"],"方法返回":["1.39"],"如果您对绘图进行缩放":["1.42"],"所有之后的绘图也会被缩放":["1.42"],"定位也会被缩放":["1.42"],"如果您":["1.42"],"旋转当前绘图":["1.43"],"位置":["1.44"],"当您在":["1.44"],"b":["1.45","1.65"],"d":["1.45"],"f":["1.45"],"换句话说":["1.45","1.46"],"允许您缩放":["1.45","1.46"],"transform":["1.46"],"settransform":["1.46"],"旋转":["1.46"],"italic":["1.49"],"small":["1.49"],"caps":["1.49"],"bond":["1.49"],"12px":["1.49"],"arial":["1.49"],"属性值":["1.49"],"值":["1.49","1.65"],"描述":["1.49"],"style":["1.49"],"规定字体的样式":["1.49"],"开始":["1.50"],"不过":["1.50"],"如果您设置为":["1.50"],"right":["1.50"],"并将文本放置到":["1.50"],"filltext":["1.51"],"stroketext":["1.51","2.19"],"方法在画布上定位文本时":["1.51"],"将使用指定的":["1.51"],"文本":["1.53"],"默认的颜色是黑色":["1.53"],"font":["1.53","1.54"],"文本的默认颜色是黑色":["1.54"],"属性来定义字体和字号":["1.54"],"返回包含指定文本宽度的对象":["1.55"],"x":["1.58","1.67"],"y":["1.58"],"在画布上定位图像":["1.58"],"width":["1.61"],"height":["1.62"],"对象的图像数据":["1.63"],"对于":["1.63"],"对象中的每个像素":["1.63"],"都存在着四方面的信息":["1.63"],"即":["1.63","1.65"],"rgba":["1.65"],"r":["1.65"],"红色":["1.65"],"g":["1.65"],"绿色":["1.65"],"蓝色":["1.65"],"imagedata":["1.66"],"对象":["1.66","2.24"],"该对象拷贝了画布指定矩形的像素数据":["1.66"],"放回画布上":["1.67"],"imgdata":["1.67"],"或透明值":["1.70"],"transparency":["1.70"],"source":["1.71"],"over":["1.71"],"save":["1.74"],"restore":["1.75"],"createevent":["1.76"],"getcontext":["1.77"],"图像的":["1.78"],"url":["1.78"],"常用于导出":["1.78"],"画布油布的意思":["2.2"],"标签名":["2.2"],"需要进行闭合":["2.2"],"其他":["2.3"],"chrome":["2.3"],"firefox":["2.3"],"苹果浏览器等都支持":["2.3"],"canvas绘图上下文":["2.4"],"上下文":["2.5"],"上知天文":["2.5"],"下知地理":["2.5"],"是所有的绘制操作":["2.5"],"api":["2.5"],"的入口或者集合":["2.5"],"基本绘制路径":["2.6"],"坐标系":["2.7"],"js":["2.8","2.9","2.10","2.14","2.18","2.21","2.22","2.23","2.24"],"ctx":["2.8","2.12","2.14","2.16","2.18","2.22","2.23"],"绘制直线":["2.9"],"路径开始和闭合":["2.10"],"开始路径":["2.10"],"描边":["2.11"],"解释":["2.12"],"是将闭合路径的内容填充具体的颜色":["2.12"],"快速创建矩形rect":["2.13"],"方法":["2.13"],"快速创建描边矩形和填充矩形":["2.14"],"清除矩形":["2.15"],"用于创建圆或部分圆":["2.16"],"绘制文字":["2.17"],"font属性使用的语法和css":["2.18"],"font属性相同":["2.18"],"18px":["2.18"],"在画布上绘制文本":["2.19"],"measuretext":["2.19"],"绘制图片":["2.20"],"基本绘制图片的方式":["2.21"],"并规定图像的宽高":["2.22"],"并在画布上定位被剪切的部分":["2.23"],"第一种方式":["2.24"],"var":["2.24"],"canvas颜色样式和阴影":["3.1"],"以上两个值都可以接受颜色名":["3.2"],"的阴影":["3.3"],"shadowcolor":["3.3"],"shadowblur":["3.3"],"大于":["3.3"]},{"0":["1.63","1.70"],"1":["1.18","1.36","1.37"],"2":["0.3","1.36","1.42","2.18"],"5":["1.37"],"20":["1.7","1.8","1.35"],"21":["0.0"],"50":["1.37"],"75":["1.37"],"100":["1.36","1.37"],"150":["1.50"],"200":["1.36"],"255":["1.63"],"300":["2.19"],"lastedittime":["0.0"],"甚至可以进行实时视频处理和渲染":["0.1"],"它最初由苹果内部使用自己":["0.1"],"macos":["0.1"],"x":["0.1","1.25","1.44","2.8","2.14","2.16","2.22"],"webkit":["0.1"],"推出":["0.1"],"供应用程序使用像仪表盘的构建和":["0.1"],"safari":["0.1"],"浏览器使用":["0.1"],"可以用":["0.2"],"javascript":["0.2","1.3","1.4","1.5","1.6","1.11","1.18","1.22","1.23","1.24","1.31","1.38","1.39","1.42","1.43","1.51","1.53","1.54","1.66","2.5","2.19"],"在上面绘画":["0.2"],"控制其每一个像素":["0.2"],"超棒的":["0.3"],"html5":["0.3"],"可视化数据":["0.3"],"数据图表话":["0.3"],"比如":["0.3"],"语法":["1.3","1.4","1.5","1.11","1.22","1.23","1.24","1.38","1.42","1.51","1.54"],"context":["1.3","1.4","1.11","1.22","1.24","1.38","1.42","2.4"],"000000":["1.5"],"默认值":["1.6","1.16","1.17","1.18","1.51"],"指示阴影位于形状":["1.7","1.8"],"left":["1.7"],"位置右侧的":["1.7"],"top":["1.8"],"位置下方的":["1.8"],"fillstyle":["1.10","1.12","1.23","1.28","1.53","1.54"],"属性的值":["1.10","1.12"],"需要配合":["1.10","1.12"],"addcolorstop":["1.10","1.12"],"方法规定不同的颜色":["1.10","1.12"],"以及在":["1.10","1.12"],"圆形或者线条等等":["1.11"],"gradient":["1.12"],"注意":["1.13","1.43","1.45","1.46","2.12"],"您可以多次调用":["1.13"],"方法来改变渐变":["1.13"],"如果您不对渐变的对象使用该方法":["1.13"],"那么渐变将不可见":["1.13"],"会使线条略微变长":["1.16"],"butt":["1.16"],"值受":["1.17"],"miterlimit":["1.17"],"属性的影响":["1.17"],"边角的角度越小":["1.19"],"斜接长度就会越大":["1.19"],"为了避免斜接长度过长":["1.19"],"我们可以使用":["1.19"],"属性":["1.19"],"如果斜接长度超过":["1.19"],"方法在画布上实际地绘制矩形":["1.22"],"属性来设置用于填充绘图的颜色":["1.23"],"渐变或模式":["1.23","1.24"],"属性来设置笔触的颜色":["1.24"],"y":["1.25","1.67","2.8","2.14","2.16","2.22"],"width":["1.25","1.58","2.2"],"提示":["1.28","1.50"],"请使用":["1.28","1.31","1.32","1.33","1.50"],"属性来填充另一种颜色":["1.28"],"moveto":["1.29","2.8","2.19"],"和":["1.29"],"lineto":["1.29","2.9"],"作用":["1.30"],"开始一条路径":["1.30"],"stroke":["1.31","1.32","1.33","1.38","2.11"],"方法在画布上绘制确切的路径":["1.31","1.32","1.33"],"一旦剪切了某个区域":["1.34"],"则所有之后的绘图都会被限制在被剪切的区域内":["1.34"],"不能访问画布上的其他区域":["1.34"],"二次贝塞尔曲线":["1.35"],"开始点":["1.35"],"控制点":["1.35"],"起始角":["1.37"],"方法在画布上绘制确切的弧":["1.38"],"true":["1.39"],"否则返回":["1.39"],"false":["1.39"],"那么绘图将定位于距离画布左上角两倍远的位置":["1.42"],"旋转只会影响到旋转完成后的绘图":["1.43"],"之后调用诸如":["1.44"],"fillrect":["1.44"],"之类的方法时":["1.44"],"值会添加到":["1.44"],"旋转":["1.45"],"移动并倾斜当前的环境":["1.45","1.46"],"该变换只会影响":["1.45","1.46"],"方法调用之后的绘图":["1.45","1.46"],"方法的行为相对于由":["1.45"],"可能的值":["1.49"],"br":["1.49"],"normal":["1.49"],"oblique":["1.49"],"variant":["1.49"],"规定字体变体":["1.49"],"位置":["1.50"],"那么会在位置":["1.50"],"结束":["1.50"],"值":["1.51","1.63","1.71","3.2"],"alphabetic":["1.51"],"属性来定义字体和字号":["1.53"],"并使用":["1.53","1.54"],"属性以另一种颜色":["1.53","1.54"],"渐变来渲染文本":["1.53","1.54"],"如果您需要在文本向画布输出之前":["1.55"],"就了解文本的宽度":["1.55"],"height":["1.58"],"并规定图像的宽度和高度":["1.58"],"sx":["1.58","2.23"],"返回":["1.61","1.62"],"rgba":["1.63","3.2"],"r":["1.63"],"红色":["1.63"],"a":["1.65"],"alpha":["1.65"],"通道":["1.65"],"是透明":["1.65"],"是完全可见":["1.65"],"因此":["1.65"],"对象不是图像":["1.66"],"它规定了画布上一部分":["1.66"],"矩形":["1.66"],"并保存了该矩形内每个像素的信息":["1.66"],"dirtyx":["1.67"],"dirtyy":["1.67"],"dirtywidth":["1.67"],"dirtyheight":["1.67"],"参数值":["1.67","1.78"],"参数":["1.67","1.78"],"属性值必须是介于":["1.70"],"完全透明":["1.70"],"与":["1.70"],"in":["1.71"],"属性值":["1.71"],"描述":["1.71"],"默认":["1.71","2.18"],"在目标图像上显示源图像":["1.71"],"保存当前环境的状态":["1.74"],"canvas":["1.74"],"返回之前保存过的路径状态和属性":["1.75"],"返回一个对象":["1.77"],"type":["1.78"],"encoderoptions":["1.78"],"标签":["2.1","2.2"],"就是一个普通的":["2.2"],"html":["2.2"],"可以是在":["2.2"],"只要浏览器兼容":["2.3"],"那么就会支持绝大部分":["2.3"],"api":["2.3"],"个别最新":["2.3"],"自身无法绘制任何内容":["2.5"],"的绘图是使用":["2.5"],"操作的":["2.5"],"ctx":["2.9","2.10","2.13","2.21"],"beginpath":["2.10"],"js":["2.11","2.13","2.15"],"默认是黑色":["2.12"],"交叉路径的填充问题":["2.12"],"非零环绕原则":["2.12"],"顺逆时针穿插次数决定是否填充":["2.12"],"rect":["2.13"],"strokerect":["2.14"],"clearrect":["2.15"],"sangle":["2.16"],"eangle":["2.16"],"counterclockwise":["2.16"],"解释":["2.16"],"微软雅黑":["2.18"],"textalign":["2.18"],"设置或者返回文本内容当前的对其方式":["2.18"],"start":["2.18"],"文本在指定的位置开始":["2.18"],"返回包含指定文本宽度的对象":["2.19"],"综合案例代码":["2.19"],"drawimage":["2.20","2.21","2.22","2.23"],"img":["2.22","2.23"],"document":["2.24"],"getelementbyid":["2.24"],"imgid":["2.24"],"第二种方式":["2.24"],"进制数据":["3.2"],"rgb":["3.2"],"甚至":["3.2"],"的正整数":["3.3"],"数值越高":["3.3"],"模糊程度越大":["3.3"],"shadowoffsetx":["3.3"],"设置或返回阴影形状的水平距离":["3.3"]},{"0":["2.7"],"3":["2.3"],"4":["2.3"],"100":["1.35"],"200":["1.35"],"后来":["0.1"],"有人通过":["0.1"],"gecko":["0.1"],"内核的浏览器":["0.1"],"尤其是":["0.1"],"mozilla":["0.1"],"和":["0.1","1.44","2.2"],"firefox":["0.1"],"标签使用":["0.2"],"在网页上绘制图像":["0.2"],"百度的":["0.3"],"echart":["0.3"],"banner":["0.3"],"广告":["0.3"],"曾经辉煌的时代":["0.3"],"智能手机还未曾出现":["0.3"],"color":["1.3","1.4","1.65"],"gradient":["1.3","1.4","1.10","1.13"],"pattern":["1.3","1.4"],"属性值":["1.3","1.4"],"context":["1.5","1.6","1.10","1.12","1.16","1.17","1.18","1.23","1.31","1.33","1.39","1.43","1.46","1.51","1.53","1.54","1.66"],"语法":["1.6","1.10","1.12","1.13","1.16","1.17","1.18","1.31","1.33","1.39","1.43","1.46","1.53","1.55","1.66"],"像素处":["1.7","1.8"],"对象中的何处定位颜色":["1.10","1.12"],"javascript":["1.10","1.12","1.13","1.16","1.17","1.33","1.46","1.55","3.2"],"createlineargradient":["1.10"],"image":["1.11","1.78","2.24"],"repeat":["1.11"],"x":["1.11","1.22","1.23","1.24","1.53","1.54","1.66","2.9","2.13","2.21"],"y":["1.11","1.22","1.23","1.24","1.44","1.54","1.66","2.9","2.13"],"x0":["1.12"],"y0":["1.12"],"为了获得可见的渐变":["1.13"],"您需要创建至少一个色标":["1.13"],"的值":["1.19"],"边角会以":["1.19"],"的":["1.19"],"bevel":["1.19"],"类型来显示":["1.19"],"width":["1.22","1.23","1.24","1.65","2.14","2.22"],"height":["1.22","1.25","2.2","2.14","2.22"],"参数值":["1.25","1.42","1.58"],"参数":["1.25","1.42"],"描述":["1.25","1.67","1.78"],"渐变":["1.28"],"注意":["1.28"],"如果路径未关闭":["1.28"],"方法定义的路径":["1.29"],"默认颜色是黑色":["1.29"],"或者重置当前的路径":["1.30"],"fill":["1.32"],"您也可以在使用":["1.34"],"方法前通过使用":["1.34"],"结束点":["1.35","1.36"],"结束角":["1.37"],"x1":["1.38"],"y1":["1.38"],"x2":["1.38"],"scalewidth":["1.42"],"scaleheight":["1.42"],"坐标值上":["1.44"],"illustration":["1.44"],"of":["1.44"],"rotate":["1.45"],"scale":["1.45"],"translate":["1.45"],"或":["1.45","1.50"],"完成的其他变换":["1.45"],"例如":["1.45","3.2"],"如果您已经将绘图设置为放大两倍":["1.45"],"a":["1.46"],"weight":["1.49"],"规定字体的粗细":["1.49"],"bold":["1.49"],"filltext":["1.50"],"stroketext":["1.50"],"方法在画布上实际地绘制并定位文本":["1.50"],"img":["1.50","2.21"],"默认值":["1.50","1.70"],"top":["1.51"],"hanging":["1.51"],"middle":["1.51"],"text":["1.53","1.54"],"那么请使用该方法":["1.55"],"sy":["1.58","2.23"],"swidth":["1.58","2.23"],"sheight":["1.58","2.23"],"剪切图像":["1.58"],"并在画布上定位被剪切的部分":["1.58"],"imagedata":["1.61","1.62"],"对象的宽度":["1.61"],"对象的高度":["1.62"],"g":["1.63"],"绿色":["1.63"],"b":["1.63"],"蓝色":["1.63"],"表示":["1.65"],"信息以数组形式存在":["1.65"],"并且由于数组包含了每个像素的四条信息":["1.65"],"所以数组的大小是":["1.65"],"对象的四倍":["1.65"],"规定要放回画布上的":["1.67"],"不透明":["1.70"],"之间的数字":["1.70"],"atop":["1.71"],"在目标图像顶部显示源图像":["1.71"],"源图像位于目标图像之外的部分是不可见的":["1.71"],"在目标图像中显示源图像":["1.71"],"只有目标图像之内的源图像部分会显示":["1.71"],"目标图像是透明的":["1.71"],"状态存储在栈中":["1.74"],"每当":["1.74"],"每一次调用":["1.75"],"指出访问绘图功能必要的":["1.77"],"api":["1.77"],"图片格式":["1.78"],"默认":["1.78"],"png":["1.78"],"属性":["2.2"],"但是":["2.2"],"属性值单位必须是":["2.2"],"除外":["2.3"],"移动端的兼容情况非常理想":["2.3"],"基本上随便使用":["2.3"],"2d":["2.3"],"对象就是":["2.5"],"操作":["2.5"],"的接口":["2.5"],"从最左上角":["2.7"],"解释":["2.8"],"设置上下文绘制路径的起点":["2.8"],"闭合路径":["2.10"],"closepath":["2.10"],"ctx":["2.11","2.15","3.2","3.3"],"非零环绕规则":["2.12"],"是这么来判断有自我交叉情况的路径的":["2.12"],"对于路径中的任意给定区域":["2.12"],"从该区域内部画一条足够长的线段":["2.12"],"参数同上":["2.14"],"圆心坐标":["2.16"],"r":["2.16"],"半径":["2.16"],"end":["2.18"],"文本在指定的位置结束":["2.18"],"center":["2.18"],"文本的中心被放在指定的位置":["2.18"],"left":["2.18"],"文本左对齐":["2.18"],"fillstyle":["2.19","3.3"],"purple":["2.19"],"设置填充颜色为紫色":["2.19"],"参数说明":["2.22"],"new":["2.24"],"这个就是":["2.24"],"一般先进行设置样式然后进行绘制":["3.2"],"shadowoffsety":["3.3"],"设置或返回阴影形状的垂直距离":["3.3"],"js":["3.3"],"rgba":["3.3"]},{"0":["1.42","3.3"],"2":["1.19"],"4":["0.3","1.65"],"5":["2.3"],"9":["3.3"],"10":["1.19"],"25":["0.0"],"58":["0.0"],"100":["1.42","1.49"],"200":["1.49"],"255":["3.3"],"300":["1.49"],"400":["1.49"],"description":["0.0"],"opera":["0.1"],"chrome":["0.1"],"和超文本网络应用技术工作组建议为下一代的网络技术使用该元素":["0.1"],"是由":["0.1"],"代码配合高度和宽度属性而定义出的可绘制区域":["0.1"],"其本身不具备绘图功能":["0.2"],"拥有多种绘制路径":["0.2"],"矩形":["0.2"],"现在以及未来的智能机时代":["0.3"],"技术能够在":["0.3"],"广告上发挥巨大作用":["0.3"],"用":["0.3"],"实现动态的广告效果再合适不过":["0.3"],"值":["1.3","1.4","1.5"],"描述":["1.3","1.4","1.11","1.12","1.13","1.22","1.23","1.24","1.42","1.51","1.53","1.54","1.66"],"指定绘图填充色的":["1.3","1.4"],"color":["1.5","1.13"],"属性值":["1.5","1.16","1.51"],"number":["1.6","1.18"],"位置左侧的":["1.7"],"默认值":["1.7","1.8","1.19"],"位置上方的":["1.8"],"x0":["1.10"],"y0":["1.10"],"x1":["1.10","1.12"],"y1":["1.10","1.12"],"参数值":["1.10","1.11","1.12","1.13","1.22","1.23","1.24","1.31","1.33","1.38","1.39","1.46","1.53","1.54","1.66"],"参数":["1.10","1.11","1.12","1.13","1.22","1.23","1.24","1.31","1.33","1.38","1.39","1.53","1.54","1.58","1.66","2.8"],"no":["1.11"],"r0":["1.12"],"r1":["1.12"],"stop":["1.13"],"bevel":["1.17"],"round":["1.17"],"fig3":["1.19"],"limit":["1.19"],"figure":["1.19"],"矩形左上角的":["1.22"],"height":["1.23","1.24","1.65","1.66","2.13","2.23"],"要清除的矩形左上角的":["1.25"],"坐标":["1.25","1.67"],"那么":["1.28"],"方法会从路径结束点到开始点之间添加一条线":["1.28"],"提示":["1.29","1.45","1.65"],"请使用":["1.29"],"strokestyle":["1.29"],"javascript":["1.30","1.35","1.36","1.37","1.44","1.50","1.61","1.62","1.70","1.77"],"x":["1.31","1.33","1.39","2.7","2.15","2.23"],"y":["1.31","1.33","1.39","1.53","2.15","2.21","2.23"],"方法来填充图像":["1.32"],"默认是黑色":["1.32"],"save":["1.34"],"方法对当前画布区域进行保存":["1.34"],"并在以后的任意时间对其进行恢复":["1.34"],"语法":["1.35","1.36","1.37","1.44","1.50","1.70","1.77"],"context":["1.35","1.36","1.37","1.44","1.50","1.55","1.70"],"cpx":["1.35"],"cpy":["1.35"],"cp1x":["1.36"],"cp1y":["1.36"],"cp2x":["1.36"],"y2":["1.38"],"r":["1.38"],"缩放当前绘图的宽度":["1.42"],"angle":["1.43"],"the":["1.44"],"method":["1.44"],"则":["1.45"],"方法会把绘图放大两倍":["1.45"],"您的绘图最终将放大四倍":["1.45"],"请查看":["1.45"],"settransform":["1.45"],"方法":["1.45","1.75"],"它不会相对于其他变换来发生行为":["1.45"],"b":["1.46"],"c":["1.46"],"d":["1.46"],"e":["1.46"],"f":["1.46"],"bolder":["1.49"],"lighter":["1.49"],"start":["1.50"],"center":["1.50"],"ideographic":["1.51"],"bottom":["1.51","2.19"],"默认":["1.51"],"maxwidth":["1.53","1.54"],"text":["1.55"],"规定要使用的图像":["1.58"],"可选":["1.58"],"开始剪切的":["1.58"],"坐标位置":["1.58"],"以像素计":["1.61","1.62","1.67"],"a":["1.63"],"alpha":["1.63"],"通道":["1.63"],"获取数组大小有更简单的办法":["1.65"],"就是使用":["1.65"],"imagedataobject":["1.65"],"data":["1.65"],"length":["1.65"],"操作完成数组的":["1.65"],"信息后":["1.65"],"您可以使用":["1.65"],"width":["1.66","2.13","2.23"],"对象左上角的":["1.67"],"out":["1.71"],"在目标图像之外显示源图像":["1.71"],"只有目标图像之外的源图像部分会显示":["1.71"],"destination":["1.71"],"在源图像上显示目标图像":["1.71"],"方法被调用后":["1.74"],"上一个保存的状态就从栈中弹出":["1.75"],"jpeg":["1.78"],"webp":["1.78"],"encoderoption":["1.78"],"在指定图片格式为":["1.78"],"px":["2.2"],"否则忽略":["2.2"],"的支持都非常好":["2.3"],"3d":["2.3"],"webgl":["2.3"],"ie11":["2.3"],"才支持":["2.3"],"其他都支持":["2.3"],"使用":["2.5"],"canvaselement":["2.5"],"getcontext":["2.5"],"2d":["2.5"],"来获取":["2.5"],"绘图上下文":["2.5"],"开始":["2.7"],"相当于移动画笔到某个位置":["2.8"],"解释":["2.9","2.10","2.11"],"从x":["2.9"],"如果是绘制不同状态的线段或者形状":["2.10"],"必须使用开始新路径的方法把不同的绘制操作隔开":["2.10"],"使此线段的终点完全落在路径范围之外":["2.12"],"下图中的那三个箭头所描述的就是上面这个步骤":["2.12"],"接下来":["2.12"],"将计数器初始化为0":["2.12"],"然后":["2.12"],"每当这条线段与路径上的直线或曲线相交时":["2.12"],"注意此方法绘制完路径后立即进行stroke绘制":["2.14"],"绘制开始的角度":["2.16"],"圆心到最右边是0度":["2.16"],"顺时针方向弧度增大":["2.16"],"right":["2.18"],"文本右对齐":["2.18"],"font":["2.19"],"20px":["2.19"],"微软雅黑":["2.19"],"设置字体":["2.19"],"textbaseline":["2.19"],"绘制图片的宽度":["2.22"],"绘制图片的高度":["2.22"],"标签的":["2.24"],"dom":["2.24"],"red":["3.2"],"ccc":["3.2"]},{"0":["1.13","3.2"],"3":["2.18"],"5":["0.3","1.42"],"8":["0.1"],"10":["3.3"],"50":["1.42"],"200":["1.42"],"255":["3.2"],"300":["2.2"],"500":["1.49"],"600":["1.49"],"700":["1.49"],"800":["1.49"],"900":["1.49"],"filepath":["0.0"],"tutorial":["0.0"],"docs":["0.0"],"代码可以访问该区域":["0.1"],"类似于其他通用的二位":["0.1"],"api":["0.1"],"通过一套完整的绘图函数来动态生成图像":["0.1"],"程序从":["0.1"],"gecko1":["0.1"],"圆形":["0.2"],"字符以及添加图像的方法":["0.2"],"之前":["0.2"],"未来":["0.3"],"模拟器":["0.3"],"无论从视觉效果还是核心功能方面来说":["0.3"],"模拟器产品可以完全由":["0.3"],"javascript":["0.3","1.7","1.8","1.19","1.45","1.65"],"来实现":["0.3"],"css":["1.3","1.4"],"颜色值":["1.3","1.4"],"默认值是":["1.3","1.4"],"描述":["1.5","1.10","1.16","1.17","1.18","1.31","1.33","1.35","1.36","1.37","1.38","1.39","1.43","1.46","1.50","1.65","1.70"],"用于阴影的":["1.5"],"属性值":["1.6","1.17","1.18","1.19","1.50","1.70"],"值":["1.6","1.16","1.17","1.18","1.19","1.50","1.70"],"语法":["1.7","1.8","1.19","1.30","1.45","1.61","1.62","1.65"],"context":["1.7","1.8","1.19","1.30","1.45","1.65"],"渐变开始点的":["1.10"],"x":["1.10","1.12","1.35","1.36","1.37"],"坐标":["1.10","1.12","1.22","1.23","1.24","1.36","1.37","1.66"],"规定要使用的模式的图片":["1.11"],"画布或视频元素":["1.11"],"默认":["1.11"],"该模式下在水平和垂直方向重复":["1.11"],"渐变开始圆的":["1.12"],"y":["1.12","1.35","1.36","1.37","2.7"],"介于":["1.13"],"与":["1.13"],"number":["1.19","1.70"],"矩形左上角的":["1.23","1.24"],"已关闭路径":["1.28"],"正如":["1.28"],"closepath":["1.28"],"一样":["1.28"],"属性来填充另一种颜色":["1.29","1.32"],"渐变":["1.29","1.32"],"路径的目标位置的":["1.31","1.33"],"strokestyle":["1.32"],"通过":["1.34"],"restore":["1.34"],"方法":["1.34"],"参数值":["1.35","1.36","1.37","1.43","1.44","1.55"],"参数":["1.35","1.36","1.37","1.43","1.44","1.46","2.9"],"贝塞尔控制点的":["1.35"],"cp2y":["1.36"],"第一个贝塞尔控制点的":["1.36"],"r":["1.37"],"sangle":["1.37"],"eangle":["1.37"],"counterclockwise":["1.37"],"圆的中心的":["1.37"],"两切线交点的横坐标":["1.38"],"两切线交点的纵坐标":["1.38"],"要测试的":["1.39"],"依次类推":["1.42"],"水平缩放绘图":["1.46"],"size":["1.49"],"line":["1.49"],"height":["1.49","2.15"],"end":["1.50"],"left":["1.50","2.19"],"文本基线是普通的字母基线":["1.51","2.18"],"文本基线是":["1.51"],"em":["1.51"],"方框的顶端":["1.51"],"规定在画布上输出的文本":["1.53","1.54"],"开始绘制文本的":["1.53","1.54"],"坐标的位置":["1.53","1.54"],"相对于画布":["1.54"],"width":["1.55","2.15"],"被剪切图像的宽度":["1.58"],"是透明":["1.63"],"是完全可见":["1.63"],"color":["1.63"],"putimagedata":["1.65"],"方法将图像数据拷贝回画布上":["1.65"],"用法":["1.65"],"以指定的尺寸":["1.65"],"像素":["1.65"],"创建新的":["1.65"],"开始复制的左上角位置的":["1.66"],"以像素计":["1.66"],"可选":["1.67"],"水平值":["1.67"],"透明值":["1.70"],"在源图像顶部显示目标图像":["1.71"],"目标图像位于源图像之外的部分是不可见的":["1.71"],"在源图像中显示目标图像":["1.71"],"只有源图像之内的目标图像部分会被显示":["1.71"],"源图像是透明的":["1.71"],"当前的状态就被推送到栈中保存":["1.74"],"可以调用任意多次":["1.74"],"所有设定都恢复":["1.75"],"canvas":["1.77","2.8"],"或":["1.78"],"默认是":["2.2"],"150像素":["2.2"],"注意":["2.2"],"不要用":["2.2"],"如果浏览器不兼容":["2.3"],"最好进行友好提示":["2.3"],"html":["2.3"],"id":["2.3"],"cavselm":["2.3","2.5"],"js":["2.5"],"var":["2.5"],"document":["2.5"],"getelementbyid":["2.5"],"向右增大":["2.7"],"y都是相对于":["2.8"],"y的位置绘制一条直线到起点或者上一个线头点":["2.9"],"闭合路径会自动把最后的线头和开始的线头连在一起":["2.10"],"根据路径绘制线":["2.11"],"路径只是草稿":["2.11"],"就改变计数器的值":["2.12"],"如果是与路径的顺时针部分相交":["2.12"],"则加1":["2.12"],"如果是与路径的逆时针部分相交":["2.12"],"则减1":["2.12"],"解释":["2.13"],"y是矩形的左上坐标":["2.13"],"fillrect":["2.14"],"绘制结束的角度":["2.16"],"注意是弧度":["2.16"],"是否是逆时针":["2.16"],"true是逆时针":["2.16"],"false是顺时针":["2.16"],"img":["2.18"],"textbaseline":["2.18"],"设置或返回文本当在绘制文本时使用的当前文本基线":["2.18"],"alphabetic":["2.18"],"设置字体底线对齐绘制基线":["2.19"],"textalign":["2.19"],"设置字体对齐的方式":["2.19"],"绘制图片左上角的坐标":["2.21"],"如果指定宽高":["2.22"],"最好成比例":["2.22"],"不然图片会被拉伸":["2.22"],"参数说明":["2.23"],"src":["2.24"],"aicoder":["2.24"],"vip":["2.24"],"doc":["2.24"],"images":["2.24"],"arc":["2.24"],"teal":["3.3"]},{"0":["1.78"],"1":["0.0","1.13","1.78"],"5":["0.1"],"6":["0.3"],"400":["2.19"],"450":["2.19"],"canvas":["0.0"],"入门":["0.0"],"firefox1":["0.1"],"开始支持":["0.1"],"internet":["0.1"],"explorer":["0.1"],"从":["0.1"],"ie9":["0.1"],"web":["0.2"],"页面只能用一些固定样式的标签":["0.2"],"比如":["0.2"],"p":["0.2"],"远程计算机控制":["0.3"],"可以让开发者更好地实现基于":["0.3"],"的数据传输":["0.3"],"构建一个完美的可视化控制界面":["0.3"],"用于填充绘图的渐变对象":["1.3","1.4"],"线性或者放射性":["1.3","1.4"],"css":["1.5","2.2"],"颜色值":["1.5"],"默认是":["1.5"],"属性":["1.6"],"number":["1.7","1.8"],"属性值":["1.7","1.8"],"值":["1.7","1.8"],"描述":["1.7","1.8","1.19","1.44","1.45","1.55"],"y":["1.10"],"渐变结束点的":["1.10"],"该模式只在水平方向重复":["1.11"],"该模式只在垂直方向重复":["1.11"],"开始圆的半径":["1.12"],"渐变结束圆的":["1.12"],"之间的值":["1.13"],"表示渐变中开始与结束之间的位置":["1.13"],"在":["1.13"],"默认":["1.16","1.50"],"向线条的每个末端添加平直的边缘":["1.16"],"向线条的每个末端添加圆形线帽":["1.16"],"创建斜角":["1.17"],"创建圆角":["1.17"],"当前线条的宽度":["1.18"],"正数":["1.19"],"规定最大斜接长度":["1.19"],"矩形的宽度":["1.22","1.23","1.24"],"以像素计":["1.22","1.23","1.24","1.25","1.49"],"要清除的矩形的宽度":["1.25"],"然后填充该路径":["1.28"],"javascript":["1.28","1.29","1.32","1.34"],"语法":["1.28","1.29","1.32","1.34"],"context":["1.29","1.32","1.34"],"坐标":["1.31","1.33","1.35","1.39"],"结束点的":["1.35"],"第二个贝塞尔控制点的":["1.36"],"圆的半径":["1.37"],"以弧度计":["1.37"],"弧的圆心的三点钟位置是":["1.37"],"度":["1.37"],"第二条切线上一点的横坐标":["1.38"],"第二条切线上一点的纵坐标":["1.38"],"缩放当前绘图的高度":["1.42"],"旋转角度":["1.43"],"添加到水平坐标":["1.44"],"上的值":["1.44"],"参数值":["1.45","1.65"],"参数":["1.45","1.55","1.65"],"水平缩放绘图":["1.45"],"水平倾斜绘图":["1.45","1.46"],"垂直倾斜绘图":["1.46"],"垂直缩放绘图":["1.46"],"规定字号和行高":["1.49"],"family":["1.49"],"规定字体系列":["1.49"],"caption":["1.49"],"使用标题控制的字体":["1.49"],"比如按钮":["1.49"],"下拉列表等":["1.49"],"icon":["1.49"],"使用用于标记图标的字体":["1.49"],"menu":["1.49"],"文本在指定的位置开始":["1.50"],"文本在指定的位置结束":["1.50"],"文本基线是悬挂基线":["1.51","2.18"],"方框的正中":["1.51"],"相对于画布":["1.53"],"被剪切图像的高度":["1.58"],"在画布上放置图像的":["1.58"],"imgdata":["1.61","1.62"],"信息以数组形式存在":["1.63"],"并存储于":["1.63"],"对象的":["1.63"],"属性中":["1.63"],"创建与指定的另一个":["1.65"],"对象出现相同的新的":["1.65"],"不会复制图像数据":["1.65"],"在画布上放置图像的位置":["1.67"],"垂直值":["1.67"],"必须介于":["1.70"],"在源图像之外显示目标图像":["1.71"],"只有源图像之外的目标图像部分会被显示":["1.71"],"lighter":["1.71"],"显示源图像":["1.71"],"方法":["1.74"],"类似数组的":["1.75"],"pop":["1.75"],"contextid":["1.77"],"的情况下":["1.78"],"可以从":["1.78"],"到":["1.78"],"的区间内选择图片的质量":["1.78"],"控制它的宽和高":["2.2"],"会造成图片拉伸":["2.2"],"重置设置":["2.2"],"你的浏览器不支持":["2.3"],"请升级浏览器":["2.3"],"浏览器不支持":["2.3"],"显示此行文本":["2.3"],"获取画布":["2.5"],"ctx":["2.5"],"向下增大":["2.7"],"image":["2.7"],"盒子的最左上角":["2.8"],"注意":["2.8"],"核心的作用是将不同绘制的形状进行隔离":["2.10"],"每次执行此方法":["2.10"],"表示重新绘制一个路径":["2.10"],"真正绘制线必须执行":["2.11"],"若计数器的最终值不是0":["2.12"],"那么此区域就在路径里面":["2.12"],"在调用fill":["2.12"],"方法时":["2.12"],"浏览器就会对其进行填充":["2.12"],"width和height都是以像素计":["2.13"],"rect方法只是规划了矩形的路径":["2.13"],"解释":["2.15"],"清除某个矩形内的绘制的内容":["2.15"],"弧度计算公式":["2.16"],"rad":["2.16"],"deg":["2.16"],"math":["2.16"],"pi":["2.16"],"top":["2.18"],"文本基线是em方框的顶端":["2.18"],"hanging":["2.18"],"middle":["2.18"],"文本基线是em方框的正中":["2.18"],"绘制图片的":["2.21"],"dom":["2.21"],"等比公式":["2.22"],"toh":["2.22"],"tow":["2.22"],"裁剪的左上角坐标":["2.23"],"裁剪图片的宽度":["2.23"],"gif":["2.24"],"alt":["2.24"],"文本信息":["2.24"]},{"6":["2.3","3.2"],"9":["0.1"],"92":["1.78"],"100":["0.3","2.19","3.3"],"180":["2.16"],"md":["0.0"],"也支持":["0.1"],"div":["0.2"],"h1":["0.2"],"等":["0.2"],"图形编辑器":["0.3"],"photoshop":["0.3"],"图形编辑器将能够":["0.3"],"基于":["0.3"],"实现":["0.3"],"用于填充绘图的":["1.3","1.4"],"对象":["1.3","1.4","2.21"],"属性的模糊级别":["1.6"],"正值或者负值":["1.7","1.8"],"定义形状与阴影的水平距离":["1.7"],"定义形状与阴影的垂直距离":["1.8"],"该模式只显示一次":["1.11"],"不重复":["1.11"],"结束圆的半径":["1.12"],"位置显示的":["1.13"],"css":["1.13"],"颜色值":["1.13"],"向线条的每个末端添加正方形线帽":["1.16"],"默认":["1.17"],"创建尖角":["1.17"],"以像素计":["1.18","1.53","1.54","1.65"],"矩形的高度":["1.22","1.23","1.24"],"要清除的矩形的高度":["1.25"],"context":["1.28"],"结束点的":["1.36"],"可选":["1.37","1.53","1.54"],"规定应该逆时针还是顺时针绘图":["1.37"],"false":["1.37"],"顺时针":["1.37"],"true":["1.37"],"逆时针":["1.37"],"默认是":["1.37"],"弧的半径":["1.38"],"其中第一条切线上的任意一点的横纵坐标是伤害一次点的位置":["1.38"],"以弧度计":["1.43"],"垂直倾斜绘图":["1.45"],"垂直缩放绘图":["1.45"],"水平移动绘图":["1.45","1.46"],"垂直移动绘图":["1.45","1.46"],"使用用于菜单中的字体":["1.49"],"下拉列表和菜单列表":["1.49"],"message":["1.49"],"box":["1.49"],"使用用于对话框的字体":["1.49"],"使用用于标记小型控件的字体":["1.49"],"status":["1.49"],"bar":["1.49"],"使用用于窗口状态栏的字体":["1.49"],"文本的中心被放置在指定的位置":["1.50"],"文本基线是表意基线":["1.51"],"方框的底端":["1.51"],"允许的最大文本宽度":["1.53","1.54"],"要测量的文本":["1.55"],"要使用的图像的宽度":["1.58"],"伸展或者缩小图像":["1.58"],"eight":["1.58"],"要使用的图像的高度":["1.58"],"javascript":["1.63"],"语法":["1.63"],"imgdata":["1.63"],"参数值":["1.63"],"对象的宽度":["1.65"],"对象的高度":["1.65"],"另一个":["1.65"],"要复制的矩形区域的宽度":["1.66"],"要复制的矩形区域的高度":["1.66"],"在画布上绘制图像所使用的宽度":["1.67"],"在画布上绘制图像所使用的高度":["1.67"],"之间":["1.70"],"copy":["1.71"],"忽略目标图像":["1.71"],"xor":["1.71"],"使用异或操作对源图像和目标图像进行组合":["1.71"],"image":["1.71"],"20240530142857949":["1.71"],"如果超出取值范围":["1.78"],"将会使用默认值":["1.78"],"标签的宽高属性会让画布擦除所有的内容":["2.2"],"可以给":["2.2"],"画布设置背景色":["2.2"],"浏览器不兼容":["2.3"],"可以使用":["2.3"],"flash":["2.3"],"等手段进行优雅降级":["2.3"],"注意":["2.5"],"小写":["2.5"],"3d":["2.5"],"webgl":["2.5"],"20240527174058188":["2.7"],"绘制线段钱必须先设置起点":["2.8"],"线头点坐标":["2.9"],"跟之前的绘制的墨迹可以进行分开样式设置和管理":["2.10"],"如果最终值是0":["2.12"],"那么此区域就不在路径内部":["2.12"],"浏览器也就不会对其进行填充了":["2.12"],"img":["2.12"],"并没有填充和描边":["2.13"],"此方法执行完成后":["2.14"],"立即对当前矩形进行fill填充":["2.14"],"相当于橡皮擦":["2.15"],"在math提供的方法中":["2.16"],"sin":["2.16"],"cos等使用的都是弧度":["2.16"],"ideographic":["2.18"],"文本基线是em的基线":["2.18"],"bottom":["2.18"],"文本基线是em方框的底端":["2.18"],"top":["2.19"],"g":["2.19"],"填充文字":["2.19"],"等比":["2.22"],"裁剪图片的高度":["2.23"],"onload":["2.24"],"function":["2.24"],"图片加载完成后":["2.24"],"执行此方法":["2.24"],"fillrect":["3.3"]}]'},t={"0.0":{t:"<!--",p:`
@Date: 2024-05-27 17:01:21
@LastEditTime: 2024-05-27 17:58:25
@Description:
@FilePath: /tutorial/do ...`,l:"canvas/1.入门.html",a:""},"0.1":{t:"1. canvas 简介",p:"​ &lt;canvas&gt;是 html5 新增的，一个可以使用脚本(通常为 JavaScript)在其中绘制图像的 HTML 元素。他可以用来制作照片集或者制作简单的(也不是那么简单)的动画，甚 ...",l:"canvas/1.入门.html#_1-canvas-简介",a:"_1-canvas-简介"},"0.2":{t:"2. 什么是 canvas",p:`
是 HTML5 提供的一个新标签
Canvas 是一个矩形区域的画布，可以用 JavaScript 在上面绘画，控制其每一个像素。
Canvas 标签使用 JavaScript 在网页上绘制图像，其 ...`,l:"canvas/1.入门.html#_2-什么是-canvas",a:"_2-什么是-canvas"},"0.3":{t:"3. Canvas 主要应用的领域(了解)",p:`
游戏：canvas 在基于 Web 的图像显示方面比 Flash 更加立体、更加精巧，canvas 游戏在流畅度和跨平台方面更牛。
25 超棒的 HTML5 Canvas 游戏
可视化数据.数据图表 ...`,l:"canvas/1.入门.html#_3-canvas-主要应用的领域-了解",a:"_3-canvas-主要应用的领域-了解"},"1.0":{t:"# Canvas API",p:"",l:"canvas/2.Canvas API.html",a:"canvas-api"},"1.1":{t:"一、颜色、样式和阴影",p:"",l:"canvas/2.Canvas API.html#一、颜色、样式和阴影",a:"一、颜色、样式和阴影"},"1.2":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.3":{t:"1. fillStyle",p:`作用：设置或返回用于填充绘画的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.fillStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_1-fillstyle",a:"_1-fillstyle"},"1.4":{t:"2. strokeStyle",p:`作用：设置或返回用于笔触的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.strokeStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_2-strokestyle",a:"_2-strokestyle"},"1.5":{t:"3. shadowColor",p:`作用：设置或返回用于阴影的颜色
默认值：#000000
JavaScript 语法：context.shadowColor=color;
属性值



值
描述




color
用于阴影的 css ...`,l:"canvas/2.Canvas API.html#_3-shadowcolor",a:"_3-shadowcolor"},"1.6":{t:"4. shadowBlur",p:`作用：设置或返回用于阴影的模糊级别
默认值：
JavaScript 语法：context.shadowBlur=number
属性值



值
属性




number
属性的模糊级别



`,l:"canvas/2.Canvas API.html#_4-shadowblur",a:"_4-shadowblur"},"1.7":{t:"5. shadowOffsetX",p:`作用：设置或返回阴影与形状的水平距离
shadowOffsetX = 0 指示阴影位于形状的正下方
shadowOffsetX = 20 指示阴影位于形状 left 位置右侧的 20 像素处
shad ...`,l:"canvas/2.Canvas API.html#_5-shadowoffsetx",a:"_5-shadowoffsetx"},"1.8":{t:"6. shadowOffsetY",p:`作用：设置或返回阴影与形状的垂直距离
shadowOffsetY = 0 指示阴影位于形状的正下方
shadowOffsetY = 20 指示阴影位于形状 top 位置下方的 20 像素处
shado ...`,l:"canvas/2.Canvas API.html#_6-shadowoffsety",a:"_6-shadowoffsety"},"1.9":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.10":{t:"1. createLineGradient()",p:`作用：创建线性渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop() 方法规定不 ...`,l:"canvas/2.Canvas API.html#_1-createlinegradient",a:"_1-createlinegradient"},"1.11":{t:"2. createPattern()",p:`作用：在指定的方向上重复制定的元素
元素可以是图片、视频，或者其他 &lt;canvas&gt; 元素
被重复的元素可用于绘制/填充矩形、圆形或者线条等等。
JavaScript 语法：context ...`,l:"canvas/2.Canvas API.html#_2-createpattern",a:"_2-createpattern"},"1.12":{t:"3. createRadialGradient()",p:`作用：创建放射状/环形的渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop()  ...`,l:"canvas/2.Canvas API.html#_3-createradialgradient",a:"_3-createradialgradient"},"1.13":{t:"4. addColorStop()",p:`作用：规定渐变对象中的颜色和停止位置
addColorStop() 方法与 createLinearGradient() 和 createRadialGradient() 一起使用
注意：您可以多次调 ...`,l:"canvas/2.Canvas API.html#_4-addcolorstop",a:"_4-addcolorstop"},"1.14":{t:"二、线条样式",p:"",l:"canvas/2.Canvas API.html#二、线条样式",a:"二、线条样式"},"1.15":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.16":{t:"1. lineCap",p:`作用：设置或返回线条的结束端点样式
&quot;round&quot; 和 &quot;square&quot; 会使线条略微变长
默认值：butt
JavaScript 语法：context.lin ...`,l:"canvas/2.Canvas API.html#_1-linecap",a:"_1-linecap"},"1.17":{t:"2. lineJoin",p:`作用：设置或返回两条线相交时，所创建的拐角类型
注意：&quot;miter&quot; 值受 &quot;miterLimit&quot; 属性的影响
默认值：miter
JavaScript 语法 ...`,l:"canvas/2.Canvas API.html#_2-linejoin",a:"_2-linejoin"},"1.18":{t:"3. lineWidth",p:`作用：设置或返回当前的线条宽度
默认值：1
JavaScript 语法：context.lineWidth = number;
属性值



值
描述




number
当前线条的宽度，以像素计
 ...`,l:"canvas/2.Canvas API.html#_3-linewidth",a:"_3-linewidth"},"1.19":{t:"4. miterLimit",p:`作用：设置或返回最大斜接长度
斜接长度指的是在两条线交汇处内角和外角之间的距离
提示：只有当 lineJoin 属性为 &quot;miter&quot; 时， miterLimit 才有效。
边角的 ...`,l:"canvas/2.Canvas API.html#_4-miterlimit",a:"_4-miterlimit"},"1.20":{t:"三、矩形",p:"",l:"canvas/2.Canvas API.html#三、矩形",a:"三、矩形"},"1.21":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.22":{t:"1. rect()",p:`作用：创建矩形
提示：请使用 stroke() 或 fill() 方法在画布上实际地绘制矩形。
JavaScript 语法：\`context.rect(x, y, width, height);
参数 ...`,l:"canvas/2.Canvas API.html#_1-rect",a:"_1-rect"},"1.23":{t:"2. fillRect()",p:`作用：创建“被填充”的矩形。默认的填充颜色是黑色
提示：请使用 fillStyle 属性来设置用于填充绘图的颜色、渐变或模式
JavaScript 语法：context.fillRect(x, y,  ...`,l:"canvas/2.Canvas API.html#_2-fillrect",a:"_2-fillrect"},"1.24":{t:"3. strokeRect()",p:`*作用**：绘制矩形（无填充）。笔触的默认颜色是黑色
提示：请使用 strokeStyle 属性来设置笔触的颜色、渐变或模式
JavaScript 语法：context.strokeRect(x, y ...`,l:"canvas/2.Canvas API.html#_3-strokerect",a:"_3-strokerect"},"1.25":{t:"4. clearRect()",p:`作用：在给定的矩形内清除指定的像素
JavaScript 语法：context.clearRect(x, y, width, height);
参数值



参数
描述




x
要清除的矩形左上角 ...`,l:"canvas/2.Canvas API.html#_4-clearrect",a:"_4-clearrect"},"1.26":{t:"四、路径",p:"",l:"canvas/2.Canvas API.html#四、路径",a:"四、路径"},"1.27":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.28":{t:"1. fill()",p:`作用：填充当前的图像/路径。默认是黑色。
提示：请使用 fillStyle 属性来填充另一种颜色/渐变
注意：如果路径未关闭，那么 fIll() 方法会从路径结束点到开始点之间添加一条线，已关闭路径（ ...`,l:"canvas/2.Canvas API.html#_1-fill",a:"_1-fill"},"1.29":{t:"2. stroke()",p:`作用：实际地绘制出通过 moveTo() 和 lineTo() 方法定义的路径。默认颜色是黑色。
提示：请使用 strokeStyle 属性来填充另一种颜色/渐变
JavaScript 语法：cont ...`,l:"canvas/2.Canvas API.html#_2-stroke",a:"_2-stroke"},"1.30":{t:"3. beginPath()",p:`作用：开始一条路径，或者重置当前的路径
JavaScript 语法：context.beginPath();
`,l:"canvas/2.Canvas API.html#_3-beginpath",a:"_3-beginpath"},"1.31":{t:"4. moveTo()",p:`作用：把路径移动到画布中的指定点，不创建线条
提示：请使用 stroke() 方法在画布上绘制确切的路径。
JavaScript 语法：context.moveTo(x, y);
参数值



参数
 ...`,l:"canvas/2.Canvas API.html#_4-moveto",a:"_4-moveto"},"1.32":{t:"5. closePath()",p:`作用：创建从当前点到开始点的路径。
提示：请使用 stroke() 方法在画布上绘制确切的路径。
提示：请使用 fill() 方法来填充图像(默认是黑色)。请使用 strokeStyle 属性来填充另 ...`,l:"canvas/2.Canvas API.html#_5-closepath",a:"_5-closepath"},"1.33":{t:"6. lineTo()",p:`作用：添加一个新点，然后创建从该点到画布中最后指定点的线条(该方法并不会创建线条)。
提示：请使用 stroke() 方法在画布上绘制确切的路径。
JavaScript 语法：context.line ...`,l:"canvas/2.Canvas API.html#_6-lineto",a:"_6-lineto"},"1.34":{t:"7. clip()",p:`作用：从原画布中裁剪任意形状和尺寸。
**提示：**一旦剪切了某个区域，则所有之后的绘图都会被限制在被剪切的区域内（不能访问画布上的其他区域）。您也可以在使用 clip() 方法前通过使用 save( ...`,l:"canvas/2.Canvas API.html#_7-clip",a:"_7-clip"},"1.35":{t:"8. quadraticCurveTo()",p:`作用：通过使用表示二次贝塞尔曲线的指定控制点，向当前路径添加一个点。
二次贝塞尔曲线需要两个点。第一个点用于二次贝塞尔曲线计算中的控制点，第二个点是曲线的结束点。曲线的开始点是当前路径中的最后一个点。 ...`,l:"canvas/2.Canvas API.html#_8-quadraticcurveto",a:"_8-quadraticcurveto"},"1.36":{t:"9. bezierCurveTo()",p:`作用：通过使用表示三次贝塞尔曲线的制定控制点，向当前路径添加一个点
三次贝塞尔曲线需要三个点。前两个是用于贝塞尔计算值的控制点，第三个点是曲线的结束点。曲线的开始点是当前路径中最后一个点。如果路径不存 ...`,l:"canvas/2.Canvas API.html#_9-beziercurveto",a:"_9-beziercurveto"},"1.37":{t:"10. arc()",p:`作用：创建弧/曲线(用于创建圆或部分圆)
提示：如需通过 arc() 来创建圆，请把其实角设置为 0，结束角设置为2* Math.PI
提示：请使用 stroke() 或 fill() 方法在画布上绘 ...`,l:"canvas/2.Canvas API.html#_10-arc",a:"_10-arc"},"1.38":{t:"11. arcTo()",p:`作用：在画布上创建介于两个切线之间的弧、曲线
!img
提示：请使用 stroke() 方法在画布上绘制确切的弧
JavaScript 语法：context.arcTo(x1, y1, x2, y2, ...`,l:"canvas/2.Canvas API.html#_11-arcto",a:"_11-arcto"},"1.39":{t:"12. isPointPath()",p:`作用：如果指定点位于当前路径中，isPointPath() 方法返回 true，否则返回 false。
JavaScript 语法：context.isPointpath(x, y)
参数值



参 ...`,l:"canvas/2.Canvas API.html#_12-ispointpath",a:"_12-ispointpath"},"1.40":{t:"五、转换",p:"",l:"canvas/2.Canvas API.html#五、转换",a:"五、转换"},"1.41":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.42":{t:"1. scale()",p:`作用：缩放当前绘图至更大或更小
注意：如果您对绘图进行缩放，所有之后的绘图也会被缩放。定位也会被缩放。如果您 scale(2, 2)，那么绘图将定位于距离画布左上角两倍远的位置
JavaScript  ...`,l:"canvas/2.Canvas API.html#_1-scale",a:"_1-scale"},"1.43":{t:"2. rotate()",p:`作用：旋转当前绘图
注意：旋转只会影响到旋转完成后的绘图
JavaScript 语法：context.rotate(angle);
参数值



参数
描述




angle
旋转角度，以弧度计。
 ...`,l:"canvas/2.Canvas API.html#_2-rotate",a:"_2-rotate"},"1.44":{t:"3. translate()",p:`作用：重新映射画布上的(0,0)位置
注意：当您在translate()之后调用诸如fillRect()之类的方法时，值会添加到 x 和 y 坐标值上。
!Illustration of the tr ...`,l:"canvas/2.Canvas API.html#_3-translate",a:"_3-translate"},"1.45":{t:"4. transform()",p:`作用：替换当前绘图的变换矩阵。它以下面描述的矩阵来操作当前的变换矩阵：
a c e
b d f
0 0 1
换句话说，transform() 允许您缩放、旋转、移动并倾斜当前的环境。
注意：该变换只会 ...`,l:"canvas/2.Canvas API.html#_4-transform",a:"_4-transform"},"1.46":{t:"5. setTransfrom()",p:`作用：把当前的变换矩阵重置为单位矩阵，然后以相同的参数运行 transform() .
换句话说，setTransform()允许您缩放、旋转、移动并倾斜当前的环境
注意：该变换只会影响setTran ...`,l:"canvas/2.Canvas API.html#_5-settransfrom",a:"_5-settransfrom"},"1.47":{t:"六、文本",p:"",l:"canvas/2.Canvas API.html#六、文本",a:"六、文本"},"1.48":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.49":{t:"1. font",p:`作用：设置或返回文本内容当前的字体属性
默认值：10px sans-serif
JavaScript 语法：context.font = &quot;italic small-caps bond 12 ...`,l:"canvas/2.Canvas API.html#_1-font",a:"_1-font"},"1.50":{t:"2. textAlign",p:`作用：设置或返回文本内容的当前对齐方式
通常，文本会从指定位置开始，不过，如果您设置为 textAlign=&quot;right&quot;并将文本放置到 位置 150，那么会在位置 150结束。
 ...`,l:"canvas/2.Canvas API.html#_2-textalign",a:"_2-textalign"},"1.51":{t:"3. textBaseline",p:`作用： 设置或返回在绘制文本时使用的当前文本基线。
!textBaseline illustration
注意： fillText() 或 strokeText() 方法在画布上定位文本时，将使用指定 ...`,l:"canvas/2.Canvas API.html#_3-textbaseline",a:"_3-textbaseline"},"1.52":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.53":{t:"1. fillText()",p:`作用： 在画布上绘制&quot;被填充的&quot;文本。默认的颜色是黑色
提示：请使用 font() 属性来定义字体和字号，并使用 fillStyle 属性以另一种颜色/渐变来渲染文本。
JavaS ...`,l:"canvas/2.Canvas API.html#_1-filltext",a:"_1-filltext"},"1.54":{t:"2. strokeText()",p:`作用：在画布上绘制文本（无填充色）。文本的默认颜色是黑色。
提示：请使用 font() 属性来定义字体和字号，并使用 fillStyle 属性以另一种颜色/渐变来渲染文本。
JavaScript 语法 ...`,l:"canvas/2.Canvas API.html#_2-stroketext",a:"_2-stroketext"},"1.55":{t:"3. measureText()",p:`作用：返回包含指定文本宽度的对象。
提示：如果您需要在文本向画布输出之前，就了解文本的宽度，那么请使用该方法
JavaScript 语法：context.measureText(text).width ...`,l:"canvas/2.Canvas API.html#_3-measuretext",a:"_3-measuretext"},"1.56":{t:"七、图像绘制",p:"",l:"canvas/2.Canvas API.html#七、图像绘制",a:"七、图像绘制"},"1.57":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.58":{t:"1. drawImage()",p:`作用：向画布上绘制图像、画布或视频
*JavaScript 语法**



用法
描述




context.drawImage(img, x, y)
在画布上定位图像


context.draw ...`,l:"canvas/2.Canvas API.html#_1-drawimage",a:"_1-drawimage"},"1.59":{t:"八、像素操作",p:"",l:"canvas/2.Canvas API.html#八、像素操作",a:"八、像素操作"},"1.60":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.61":{t:"1. width",p:`作用：返回 ImageData 对象的宽度，以像素计
JavaScript 语法：imgData.width
`,l:"canvas/2.Canvas API.html#_1-width",a:"_1-width"},"1.62":{t:"2. height",p:`作用：返回 ImageData 对象的高度，以像素计
JavaScript 语法：imgData.height
`,l:"canvas/2.Canvas API.html#_2-height",a:"_2-height"},"1.63":{t:"3. data",p:`作用：返回一个对象，其包含指定的 ImageData 对象的图像数据。
对于 ImageData 对象中的每个像素，都存在着四方面的信息，即 RGBA 值：
R - 红色(0-255)
G - 绿色( ...`,l:"canvas/2.Canvas API.html#_3-data",a:"_3-data"},"1.64":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.65":{t:"1. createImageData()",p:`作用：创建新的空白 ImageData 对象。新对象默认像素值 transparent black。
对于 ImageData 对象中的每个像素，都存在着四方面的信息，即 RGBA 值：
R - 红色 ...`,l:"canvas/2.Canvas API.html#_1-createimagedata",a:"_1-createimagedata"},"1.66":{t:"2. getImageData()",p:`作用：返回 ImageData 对象，该对象拷贝了画布指定矩形的像素数据。
注意：ImageData 对象不是图像，它规定了画布上一部分(矩形)，并保存了该矩形内每个像素的信息。
JavaScript ...`,l:"canvas/2.Canvas API.html#_2-getimagedata",a:"_2-getimagedata"},"1.67":{t:"3. putImageData()",p:`作用：将图像数据（从指定的 ImageData 对象）放回画布上。
JavaScript 语法：context.putImageData(imgData, x, y, dirtyX, dirtyY,  ...`,l:"canvas/2.Canvas API.html#_3-putimagedata",a:"_3-putimagedata"},"1.68":{t:"九、合成",p:"",l:"canvas/2.Canvas API.html#九、合成",a:"九、合成"},"1.69":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.70":{t:"1. globalAlpha",p:`作用：设置或返回绘图的当前 alpha 或透明值(alpha 或 transparency)。
globalAlpha 属性值必须是介于 0.0（完全透明） 与 1.0（不透明） 之间的数字。
默认值 ...`,l:"canvas/2.Canvas API.html#_1-globalalpha",a:"_1-globalalpha"},"1.71":{t:"2. globalCompositeOperation",p:`作用：设置或返回新图像如何绘制到已有的图像上。
新图像：您打算放置到画布上的绘图。
目标图像：您已经放置在画布上的绘图。
默认值：source-over
JavaScript 语法：context.g ...`,l:"canvas/2.Canvas API.html#_2-globalcompositeoperation",a:"_2-globalcompositeoperation"},"1.72":{t:"十、其他",p:"",l:"canvas/2.Canvas API.html#十、其他",a:"十、其他"},"1.73":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.74":{t:"1. save()",p:`作用：保存当前环境的状态
Canvas 状态存储在栈中，每当 save()方法被调用后，当前的状态就被推送到栈中保存。可以调用任意多次 save 方法
`,l:"canvas/2.Canvas API.html#_1-save",a:"_1-save"},"1.75":{t:"2. restore()",p:`作用：返回之前保存过的路径状态和属性
每一次调用 restore 方法，上一个保存的状态就从栈中弹出，所有设定都恢复。(类似数组的 pop())
`,l:"canvas/2.Canvas API.html#_2-restore",a:"_2-restore"},"1.76":{t:"3. createEvent()",p:"",l:"canvas/2.Canvas API.html#_3-createevent",a:"_3-createevent"},"1.77":{t:"4. getContext()",p:`作用：返回一个对象，指出访问绘图功能必要的 API
JavaScript 语法：canvas.getContext(contextID)
`,l:"canvas/2.Canvas API.html#_4-getcontext",a:"_4-getcontext"},"1.78":{t:"5. toDataURL()",p:`作用：返回 canvas 图像的 URL，常用于导出
JavaScript 语法：canvas.toDataURL(type,encoderOptions)
参数值



参数
描述




type ...`,l:"canvas/2.Canvas API.html#_5-todataurl",a:"_5-todataurl"},"2.0":{t:"# Canvas绘图基础",p:"",l:"canvas/2.canvas绘图基础.html",a:"canvas绘图基础"},"2.1":{t:"1. Canvas 标签",p:"",l:"canvas/2.canvas绘图基础.html#_1-canvas-标签",a:"_1-canvas-标签"},"2.2":{t:"1.1 Canvas 标签语法和属性(重点)",p:`canvas：画布油布的意思
标签名 canvas，需要进行闭合。就是一个普通的 html 标签
可以是在 width 和 height 属性，但是属性值单位必须是 px，否则忽略。
width 和  ...`,l:"canvas/2.canvas绘图基础.html#_1-1-canvas-标签语法和属性-重点",a:"_1-1-canvas-标签语法和属性-重点"},"2.3":{t:"1.2 浏览器不兼容处理",p:`

IE9 以上才支持 canvas，其他 chrome、Firefox、苹果浏览器等都支持


只要浏览器兼容 canvas，那么就会支持绝大部分 API(个别最新 api 除外)


移动端的兼容 ...`,l:"canvas/2.canvas绘图基础.html#_1-2-浏览器不兼容处理",a:"_1-2-浏览器不兼容处理"},"2.4":{t:"2 Canvas绘图上下文 Context",p:"",l:"canvas/2.canvas绘图基础.html#_2-canvas绘图上下文-context",a:"_2-canvas绘图上下文-context"},"2.5":{t:"2.1 Context： Canvas 的上下文、绘制环境",p:`上下文：上知天文，下知地理。是所有的绘制操作 api 的入口或者集合。
Canvas 自身无法绘制任何内容。Canvas 的绘图是使用 JavaScript 操作的。
Context 对象就是 Jav ...`,l:"canvas/2.canvas绘图基础.html#_2-1-context-canvas-的上下文、绘制环境",a:"_2-1-context-canvas-的上下文、绘制环境"},"2.6":{t:"3.基本绘制路径",p:"",l:"canvas/2.canvas绘图基础.html#_3-基本绘制路径",a:"_3-基本绘制路径"},"2.7":{t:"3.1 Canvas 坐标系",p:`canvas 坐标系，从最左上角 0,0 开始。x 向右增大，y 向下增大
!image-20240527174058188
`,l:"canvas/2.canvas绘图基础.html#_3-1-canvas-坐标系",a:"_3-1-canvas-坐标系"},"2.8":{t:"3.2设置绘制起始点",p:`ctx.moveTo(x,y)

解释：设置上下文绘制路径的起点。相当于移动画笔到某个位置
参数：x，y都是相对于 canvas 盒子的最左上角
注意：绘制线段钱必须先设置起点
`,l:"canvas/2.canvas绘图基础.html#_3-2设置绘制起始点",a:"_3-2设置绘制起始点"},"2.9":{t:"3.3 绘制直线",p:`ctx.lineTo(x,y)

解释：从x,y的位置绘制一条直线到起点或者上一个线头点。
参数：x,y 线头点坐标。
`,l:"canvas/2.canvas绘图基础.html#_3-3-绘制直线",a:"_3-3-绘制直线"},"2.10":{t:"3.4 路径开始和闭合",p:`开始路径：ctx.beginPath()
闭合路径：ctx.closePath()

解释：如果是绘制不同状态的线段或者形状，必须使用开始新路径的方法把不同的绘制操作隔开。闭合路径会自动把最后的线头和 ...`,l:"canvas/2.canvas绘图基础.html#_3-4-路径开始和闭合",a:"_3-4-路径开始和闭合"},"2.11":{t:"3.5 描边(stroke)",p:`ctx.stroke()

解释：根据路径绘制线，路径只是草稿，真正绘制线必须执行 stroke()
`,l:"canvas/2.canvas绘图基础.html#_3-5-描边-stroke",a:"_3-5-描边-stroke"},"2.12":{t:"3.6 填充(fill)",p:`ctx.fill()

解释：填充，是将闭合路径的内容填充具体的颜色。默认是黑色。
注意：交叉路径的填充问题：&quot;非零环绕原则&quot;，顺逆时针穿插次数决定是否填充。
非零环绕原则
​		 ...`,l:"canvas/2.canvas绘图基础.html#_3-6-填充-fill",a:"_3-6-填充-fill"},"2.13":{t:"3.7 快速创建矩形rect()方法",p:`ctx.rect(x,y,width,height)

解释：x，y是矩形的左上坐标，width和height都是以像素计
rect方法只是规划了矩形的路径，并没有填充和描边。
`,l:"canvas/2.canvas绘图基础.html#_3-7-快速创建矩形rect-方法",a:"_3-7-快速创建矩形rect-方法"},"2.14":{t:"3.8 快速创建描边矩形和填充矩形",p:`ctx.strokeRect(x, y, width, height)


参数同上，注意此方法绘制完路径后立即进行stroke绘制

ctx.fillRect(x, y, width, height ...`,l:"canvas/2.canvas绘图基础.html#_3-8-快速创建描边矩形和填充矩形",a:"_3-8-快速创建描边矩形和填充矩形"},"2.15":{t:"3.9 清除矩形（clearRect）",p:`ctx.clearRect(x, y, width, height)

解释：清除某个矩形内的绘制的内容，相当于橡皮擦
`,l:"canvas/2.canvas绘图基础.html#_3-9-清除矩形-clearrect",a:"_3-9-清除矩形-clearrect"},"2.16":{t:"4. 绘制圆形",p:`概述：arc()方法创建弧/曲线（用于创建圆或部分圆）
语法：ctx.arc(x, y, sAngle, eAngle, counterclockwise)
解释：
- x,y：圆心坐标，
- r：半 ...`,l:"canvas/2.canvas绘图基础.html#_4-绘制圆形",a:"_4-绘制圆形"},"2.17":{t:"5. 绘制文字",p:"",l:"canvas/2.canvas绘图基础.html#_5-绘制文字",a:"_5-绘制文字"},"2.18":{t:"5.1 绘制上下文的文字属性",p:`

font：设置或返回文本内容的当前字体属性
font属性使用的语法和css font属性相同
ctx.font=&quot;18px 微软雅黑&quot;



textAlign： 设置或者返回 ...`,l:"canvas/2.canvas绘图基础.html#_5-1-绘制上下文的文字属性",a:"_5-1-绘制上下文的文字属性"},"2.19":{t:"5.2 上下文绘制文字的方法",p:`ctx.fillText() ：在画布上绘制被填充的文本
ctx.strokeText()：在画布上绘制文本（无填充）
ctx.measureText()：返回包含指定文本宽度的对象
//综合案例代码 ...`,l:"canvas/2.canvas绘图基础.html#_5-2-上下文绘制文字的方法",a:"_5-2-上下文绘制文字的方法"},"2.20":{t:"6. 绘制图片(drawImage)",p:"",l:"canvas/2.canvas绘图基础.html#_6-绘制图片-drawimage",a:"_6-绘制图片-drawimage"},"2.21":{t:"6.1 基本绘制图片的方式",p:`ctx.drawImage(img, x, y)

x, y：绘制图片左上角的坐标
img：绘制图片的 dom 对象
`,l:"canvas/2.canvas绘图基础.html#_6-1-基本绘制图片的方式",a:"_6-1-基本绘制图片的方式"},"2.22":{t:"6.2 在画布上绘制图像，并规定图像的宽高",p:`ctx.drawImage(img, x, y, width, height)

参数说明

width：绘制图片的宽度
height：绘制图片的高度

如果指定宽高，最好成比例，不然图片会被拉伸
等 ...`,l:"canvas/2.canvas绘图基础.html#_6-2-在画布上绘制图像-并规定图像的宽高",a:"_6-2-在画布上绘制图像-并规定图像的宽高"},"2.23":{t:"6.3 图片裁剪，并在画布上定位被剪切的部分",p:`ctx.drawImage(img, sx, sy, swidth, sheight, x, y, width, height)

参数说明

sx, sy：裁剪的左上角坐标
swidth：裁剪图片的 ...`,l:"canvas/2.canvas绘图基础.html#_6-3-图片裁剪-并在画布上定位被剪切的部分",a:"_6-3-图片裁剪-并在画布上定位被剪切的部分"},"2.24":{t:"6.4 用 JavaScript 创建 img 对象",p:`第一种方式：
var img = document.getElementById('imgId')

第二种方式：
var img = new Image(); // 这个就是 img 标签的 dom ...`,l:"canvas/2.canvas绘图基础.html#_6-4-用-javascript-创建-img-对象",a:"_6-4-用-javascript-创建-img-对象"},"3.0":{t:"# Canvas 进阶",p:"",l:"canvas/3.canvas进阶.html",a:"canvas-进阶"},"3.1":{t:"1. Canvas颜色样式和阴影",p:"",l:"canvas/3.canvas进阶.html#_1-canvas颜色样式和阴影",a:"_1-canvas颜色样式和阴影"},"3.2":{t:"1.1 设置填充色和描边的颜色",p:`
fillStyle：设置或返回用于填充绘画的颜色
strokeStyle：设置或返回用于笔触的颜色

以上两个值都可以接受颜色名、16 进制数据、rgb 值，甚至 rgba。一般先进行设置样式然后进 ...`,l:"canvas/3.canvas进阶.html#_1-1-设置填充色和描边的颜色",a:"_1-1-设置填充色和描边的颜色"},"3.3":{t:"1.2 设置阴影",p:`类比于 CSS3 的阴影
- shadowColor：设置或返回用于阴影的颜色
- shadowBlur：设置或返回用于阴影的模糊级别，大于 1 的正整数，数值越高，模糊程度越大
- shadowOf ...`,l:"canvas/3.canvas进阶.html#_1-2-设置阴影",a:"_1-2-设置阴影"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},e={INDEX_DATA:a,PREVIEW_LOOKUP:t,Options:n};export{e as default};
