const a={map:'[{"canvas":["1.0","3.0"],"一":["1.1"],"属性":["1.2"],"方法":["1.9"],"canvas绘图基础":["2.0"]},{"1":["0.1","0.3","1.3","1.10","2.1","2.2","2.3","2.5","2.7","2.18","2.21","3.1","3.2","3.3"],"2":["0.2","1.4","1.11","2.3","2.4","2.5","2.19","2.22","3.3"],"3":["0.3","1.5","1.12","2.6","2.7","2.8","2.9","2.10","2.11","2.12","2.13","2.14","2.15","2.23"],"4":["1.6","1.13","2.10","2.16","2.24"],"5":["1.7","2.17","2.18","2.19"],"6":["1.8","2.12","2.20","2.21","2.22","2.23","2.24"],"7":["2.13"],"8":["2.14"],"2024":["0.0"],"date":["0.0"],"05":["0.0"],"canvas":["0.1","0.2","0.3","2.2","2.5"],"简介":["0.1"],"是":["0.1","0.2"],"html5":["0.1"],"新增的":["0.1"],"一个可以使用脚本":["0.1"],"什么是":["0.2"],"主要应用的领域":["0.3"],"了解":["0.3"],"游戏":["0.3"],"在基于":["0.3"],"api":["1.0"],"颜色":["1.1"],"fillstyle":["1.3","3.2"],"作用":["1.3","1.4","1.7","1.8","1.10"],"strokestyle":["1.4"],"shadowcolor":["1.5"],"shadowblur":["1.6"],"shadowoffsetx":["1.7"],"设置或返回阴影与形状的水平距离":["1.7"],"shadowoffsety":["1.8"],"设置或返回阴影与形状的垂直距离":["1.8"],"createlinegradient":["1.10"],"标签语法和属性":["2.2"],"重点":["2.2"],"浏览器不兼容处理":["2.3"],"ie9":["2.3"],"以上才支持":["2.3"],"context":["2.5"],"的上下文":["2.5"],"绘制环境":["2.5"],"2设置绘制起始点":["2.8"],"填充":["2.12"],"fill":["2.12"],"js":["2.12"],"绘制圆形":["2.16"],"概述":["2.16"],"arc":["2.16"],"方法创建弧":["2.16"],"绘制上下文的文字属性":["2.18"],"font":["2.18"],"设置或返回文本内容的当前字体属性":["2.18"],"上下文绘制文字的方法":["2.19"],"ctx":["2.19"],"filltext":["2.19"],"在画布上绘制被填充的文本":["2.19"],"在画布上绘制图像":["2.22"],"图片裁剪":["2.23"],"用":["2.24"],"javascript":["2.24"],"创建":["2.24"],"进阶":["3.0"],"设置填充色和描边的颜色":["3.2"],"设置阴影":["3.3"],"类比于":["3.3"],"css3":["3.3"]},{"0":["1.7","1.8"],"5":["2.11"],"9":["2.15"],"16":["3.2"],"17":["0.0"],"25":["0.3"],"27":["0.0"],"01":["0.0"],"通常为":["0.1"],"javascript":["0.1"],"在其中绘制图像的":["0.1"],"html":["0.1"],"元素":["0.1"],"他可以用来制作照片集或者制作简单的":["0.1"],"也不是那么简单":["0.1"],"的动画":["0.1"],"html5":["0.2"],"提供的一个新标签":["0.2"],"是一个矩形区域的画布":["0.2"],"web":["0.3"],"的图像显示方面比":["0.3"],"flash":["0.3"],"更加立体":["0.3"],"更加精巧":["0.3"],"游戏在流畅度和跨平台方面更牛":["0.3"],"样式和阴影":["1.1"],"设置或返回用于填充绘画的颜色":["1.3","3.2"],"渐变或模式":["1.3","1.4"],"默认值":["1.3","1.4","1.5"],"000000":["1.3","1.4"],"设置或返回用于笔触的颜色":["1.4","3.2"],"作用":["1.5","1.6"],"设置或返回用于阴影的颜色":["1.5","3.3"],"设置或返回用于阴影的模糊级别":["1.6","3.3"],"指示阴影位于形状的正下方":["1.7","1.8"],"创建线性渐变":["1.10"],"用在画布内容上":["1.10"],"渐变可用于填充矩形":["1.10"],"圆形":["1.10"],"createpattern":["1.11"],"createradialgradient":["1.12"],"addcolorstop":["1.13"],"canvas":["2.1","2.3","2.7"],"画布油布的意思":["2.2"],"标签名":["2.2"],"需要进行闭合":["2.2"],"其他":["2.3"],"chrome":["2.3"],"firefox":["2.3"],"苹果浏览器等都支持":["2.3"],"canvas绘图上下文":["2.4"],"上下文":["2.5"],"上知天文":["2.5"],"下知地理":["2.5"],"是所有的绘制操作":["2.5"],"api":["2.5"],"的入口或者集合":["2.5"],"基本绘制路径":["2.6"],"坐标系":["2.7"],"js":["2.8","2.9","2.10","2.14","2.18","2.21","2.22","2.23","2.24"],"ctx":["2.8","2.12","2.14","2.16","2.18","2.22","2.23"],"绘制直线":["2.9"],"路径开始和闭合":["2.10"],"开始路径":["2.10"],"描边":["2.11"],"解释":["2.12"],"是将闭合路径的内容填充具体的颜色":["2.12"],"快速创建矩形rect":["2.13"],"方法":["2.13"],"快速创建描边矩形和填充矩形":["2.14"],"清除矩形":["2.15"],"曲线":["2.16"],"用于创建圆或部分圆":["2.16"],"语法":["2.16"],"绘制文字":["2.17"],"font属性使用的语法和css":["2.18"],"font属性相同":["2.18"],"18px":["2.18"],"stroketext":["2.19"],"在画布上绘制文本":["2.19"],"无填充":["2.19"],"measuretext":["2.19"],"绘制图片":["2.20"],"基本绘制图片的方式":["2.21"],"并规定图像的宽高":["2.22"],"并在画布上定位被剪切的部分":["2.23"],"img":["2.24"],"对象":["2.24"],"第一种方式":["2.24"],"var":["2.24"],"canvas颜色样式和阴影":["3.1"],"strokestyle":["3.2"],"以上两个值都可以接受颜色名":["3.2"],"的阴影":["3.3"],"shadowcolor":["3.3"],"shadowblur":["3.3"],"大于":["3.3"]},{"2":["0.3","2.18"],"20":["1.7","1.8"],"21":["0.0"],"300":["2.19"],"lastedittime":["0.0"],"甚至可以进行实时视频处理和渲染":["0.1"],"它最初由苹果内部使用自己":["0.1"],"macos":["0.1"],"x":["0.1","2.8","2.14","2.16","2.22"],"webkit":["0.1"],"推出":["0.1"],"供应用程序使用像仪表盘的构建和":["0.1"],"safari":["0.1"],"浏览器使用":["0.1"],"可以用":["0.2"],"javascript":["0.2","1.3","1.4","1.5","1.6","2.5","2.19"],"在上面绘画":["0.2"],"控制其每一个像素":["0.2"],"超棒的":["0.3"],"html5":["0.3"],"可视化数据":["0.3"],"数据图表话":["0.3"],"比如":["0.3"],"语法":["1.3","1.4","1.5"],"context":["1.3","1.4","2.4"],"000000":["1.5"],"默认值":["1.6"],"指示阴影位于形状":["1.7","1.8"],"left":["1.7"],"位置右侧的":["1.7"],"top":["1.8"],"位置下方的":["1.8"],"线条":["1.10"],"文本等等":["1.10"],"该对象作为":["1.10"],"strokestyle":["1.10"],"作用":["1.11","1.12","1.13"],"标签":["2.1","2.2"],"就是一个普通的":["2.2"],"html":["2.2"],"可以是在":["2.2"],"width":["2.2"],"只要浏览器兼容":["2.3"],"那么就会支持绝大部分":["2.3"],"api":["2.3"],"个别最新":["2.3"],"自身无法绘制任何内容":["2.5"],"的绘图是使用":["2.5"],"操作的":["2.5"],"moveto":["2.8","2.19"],"y":["2.8","2.14","2.16","2.22"],"ctx":["2.9","2.10","2.13","2.21"],"lineto":["2.9"],"beginpath":["2.10"],"stroke":["2.11"],"js":["2.11","2.13","2.15"],"默认是黑色":["2.12"],"注意":["2.12"],"交叉路径的填充问题":["2.12"],"非零环绕原则":["2.12"],"顺逆时针穿插次数决定是否填充":["2.12"],"rect":["2.13"],"strokerect":["2.14"],"clearrect":["2.15"],"sangle":["2.16"],"eangle":["2.16"],"counterclockwise":["2.16"],"解释":["2.16"],"微软雅黑":["2.18"],"textalign":["2.18"],"设置或者返回文本内容当前的对其方式":["2.18"],"start":["2.18"],"默认":["2.18"],"文本在指定的位置开始":["2.18"],"返回包含指定文本宽度的对象":["2.19"],"综合案例代码":["2.19"],"drawimage":["2.20","2.21","2.22","2.23"],"img":["2.22","2.23"],"sx":["2.23"],"document":["2.24"],"getelementbyid":["2.24"],"imgid":["2.24"],"第二种方式":["2.24"],"进制数据":["3.2"],"rgb":["3.2"],"值":["3.2"],"甚至":["3.2"],"rgba":["3.2"],"的正整数":["3.3"],"数值越高":["3.3"],"模糊程度越大":["3.3"],"shadowoffsetx":["3.3"],"设置或返回阴影形状的水平距离":["3.3"]},{"0":["2.7"],"3":["2.3"],"4":["2.3"],"后来":["0.1"],"有人通过":["0.1"],"gecko":["0.1"],"内核的浏览器":["0.1"],"尤其是":["0.1"],"mozilla":["0.1"],"和":["0.1","2.2"],"firefox":["0.1"],"标签使用":["0.2"],"在网页上绘制图像":["0.2"],"百度的":["0.3"],"echart":["0.3"],"banner":["0.3"],"广告":["0.3"],"曾经辉煌的时代":["0.3"],"智能手机还未曾出现":["0.3"],"color":["1.3","1.4"],"gradient":["1.3","1.4"],"pattern":["1.3","1.4"],"属性值":["1.3","1.4"],"context":["1.5","1.6"],"语法":["1.6"],"像素处":["1.7","1.8"],"或":["1.10"],"fillstyle":["1.10","2.19","3.3"],"属性的值":["1.10"],"需要配合":["1.10"],"在指定的方向上重复制定的元素":["1.11"],"创建放射状":["1.12"],"规定渐变对象中的颜色和停止位置":["1.13"],"height":["2.2","2.14","2.22"],"属性":["2.2"],"但是":["2.2"],"属性值单位必须是":["2.2"],"除外":["2.3"],"移动端的兼容情况非常理想":["2.3"],"基本上随便使用":["2.3"],"2d":["2.3"],"对象就是":["2.5"],"操作":["2.5"],"的接口":["2.5"],"从最左上角":["2.7"],"解释":["2.8"],"设置上下文绘制路径的起点":["2.8"],"x":["2.9","2.13","2.21"],"y":["2.9","2.13"],"闭合路径":["2.10"],"closepath":["2.10"],"ctx":["2.11","2.15","3.2","3.3"],"非零环绕规则":["2.12"],"是这么来判断有自我交叉情况的路径的":["2.12"],"对于路径中的任意给定区域":["2.12"],"从该区域内部画一条足够长的线段":["2.12"],"width":["2.14","2.22"],"参数同上":["2.14"],"圆心坐标":["2.16"],"r":["2.16"],"半径":["2.16"],"end":["2.18"],"文本在指定的位置结束":["2.18"],"center":["2.18"],"文本的中心被放在指定的位置":["2.18"],"left":["2.18"],"文本左对齐":["2.18"],"purple":["2.19"],"设置填充颜色为紫色":["2.19"],"img":["2.21"],"参数说明":["2.22"],"sy":["2.23"],"swidth":["2.23"],"sheight":["2.23"],"new":["2.24"],"image":["2.24"],"这个就是":["2.24"],"一般先进行设置样式然后进行绘制":["3.2"],"例如":["3.2"],"javascript":["3.2"],"shadowoffsety":["3.3"],"设置或返回阴影形状的垂直距离":["3.3"],"js":["3.3"],"rgba":["3.3"]},{"0":["3.3"],"4":["0.3"],"5":["2.3"],"9":["3.3"],"25":["0.0"],"58":["0.0"],"255":["3.3"],"description":["0.0"],"opera":["0.1"],"chrome":["0.1"],"和超文本网络应用技术工作组建议为下一代的网络技术使用该元素":["0.1"],"是由":["0.1"],"代码配合高度和宽度属性而定义出的可绘制区域":["0.1"],"其本身不具备绘图功能":["0.2"],"拥有多种绘制路径":["0.2"],"矩形":["0.2"],"现在以及未来的智能机时代":["0.3"],"技术能够在":["0.3"],"广告上发挥巨大作用":["0.3"],"用":["0.3"],"实现动态的广告效果再合适不过":["0.3"],"值":["1.3","1.4","1.5"],"描述":["1.3","1.4"],"指定绘图填充色的":["1.3","1.4"],"color":["1.5"],"属性值":["1.5"],"number":["1.6"],"位置左侧的":["1.7"],"默认值":["1.7","1.8"],"位置上方的":["1.8"],"addcolorstop":["1.10"],"方法规定不同的颜色":["1.10"],"以及在":["1.10"],"gradient":["1.10"],"环形的渐变":["1.12"],"px":["2.2"],"否则忽略":["2.2"],"的支持都非常好":["2.3"],"3d":["2.3"],"webgl":["2.3"],"ie11":["2.3"],"才支持":["2.3"],"其他都支持":["2.3"],"使用":["2.5"],"canvaselement":["2.5"],"getcontext":["2.5"],"2d":["2.5"],"来获取":["2.5"],"绘图上下文":["2.5"],"开始":["2.7"],"x":["2.7","2.15","2.23"],"相当于移动画笔到某个位置":["2.8"],"参数":["2.8"],"解释":["2.9","2.10","2.11"],"从x":["2.9"],"如果是绘制不同状态的线段或者形状":["2.10"],"必须使用开始新路径的方法把不同的绘制操作隔开":["2.10"],"使此线段的终点完全落在路径范围之外":["2.12"],"下图中的那三个箭头所描述的就是上面这个步骤":["2.12"],"接下来":["2.12"],"将计数器初始化为0":["2.12"],"然后":["2.12"],"每当这条线段与路径上的直线或曲线相交时":["2.12"],"width":["2.13","2.23"],"height":["2.13","2.23"],"注意此方法绘制完路径后立即进行stroke绘制":["2.14"],"y":["2.15","2.21","2.23"],"绘制开始的角度":["2.16"],"圆心到最右边是0度":["2.16"],"顺时针方向弧度增大":["2.16"],"right":["2.18"],"文本右对齐":["2.18"],"font":["2.19"],"20px":["2.19"],"微软雅黑":["2.19"],"设置字体":["2.19"],"textbaseline":["2.19"],"bottom":["2.19"],"绘制图片的宽度":["2.22"],"绘制图片的高度":["2.22"],"标签的":["2.24"],"dom":["2.24"],"red":["3.2"],"ccc":["3.2"]},{"0":["3.2"],"3":["2.18"],"5":["0.3"],"8":["0.1"],"10":["3.3"],"255":["3.2"],"300":["2.2"],"filepath":["0.0"],"tutorial":["0.0"],"docs":["0.0"],"代码可以访问该区域":["0.1"],"类似于其他通用的二位":["0.1"],"api":["0.1"],"通过一套完整的绘图函数来动态生成图像":["0.1"],"程序从":["0.1"],"gecko1":["0.1"],"圆形":["0.2"],"字符以及添加图像的方法":["0.2"],"之前":["0.2"],"未来":["0.3"],"模拟器":["0.3"],"无论从视觉效果还是核心功能方面来说":["0.3"],"模拟器产品可以完全由":["0.3"],"javascript":["0.3","1.7","1.8","1.10"],"来实现":["0.3"],"css":["1.3","1.4"],"颜色值":["1.3","1.4"],"默认值是":["1.3","1.4"],"描述":["1.5"],"用于阴影的":["1.5"],"属性值":["1.6"],"值":["1.6"],"语法":["1.7","1.8","1.10"],"context":["1.7","1.8","1.10"],"对象中的":["1.10"],"用在画布内容上":["1.12"],"默认是":["2.2"],"150像素":["2.2"],"注意":["2.2"],"不要用":["2.2"],"如果浏览器不兼容":["2.3"],"最好进行友好提示":["2.3"],"html":["2.3"],"id":["2.3"],"cavselm":["2.3","2.5"],"js":["2.5"],"var":["2.5"],"document":["2.5"],"getelementbyid":["2.5"],"向右增大":["2.7"],"y":["2.7"],"y都是相对于":["2.8"],"canvas":["2.8"],"y的位置绘制一条直线到起点或者上一个线头点":["2.9"],"参数":["2.9"],"闭合路径会自动把最后的线头和开始的线头连在一起":["2.10"],"根据路径绘制线":["2.11"],"路径只是草稿":["2.11"],"就改变计数器的值":["2.12"],"如果是与路径的顺时针部分相交":["2.12"],"则加1":["2.12"],"如果是与路径的逆时针部分相交":["2.12"],"则减1":["2.12"],"解释":["2.13"],"y是矩形的左上坐标":["2.13"],"fillrect":["2.14"],"width":["2.15"],"height":["2.15"],"绘制结束的角度":["2.16"],"注意是弧度":["2.16"],"是否是逆时针":["2.16"],"true是逆时针":["2.16"],"false是顺时针":["2.16"],"img":["2.18"],"textbaseline":["2.18"],"设置或返回文本当在绘制文本时使用的当前文本基线":["2.18"],"alphabetic":["2.18"],"文本基线是普通的字母基线":["2.18"],"设置字体底线对齐绘制基线":["2.19"],"textalign":["2.19"],"left":["2.19"],"设置字体对齐的方式":["2.19"],"绘制图片左上角的坐标":["2.21"],"如果指定宽高":["2.22"],"最好成比例":["2.22"],"不然图片会被拉伸":["2.22"],"参数说明":["2.23"],"src":["2.24"],"aicoder":["2.24"],"vip":["2.24"],"doc":["2.24"],"images":["2.24"],"arc":["2.24"],"teal":["3.3"]},{"1":["0.0"],"5":["0.1"],"6":["0.3"],"400":["2.19"],"450":["2.19"],"canvas":["0.0"],"入门":["0.0"],"firefox1":["0.1"],"开始支持":["0.1"],"internet":["0.1"],"explorer":["0.1"],"从":["0.1"],"ie9":["0.1"],"web":["0.2"],"页面只能用一些固定样式的标签":["0.2"],"比如":["0.2"],"p":["0.2"],"远程计算机控制":["0.3"],"可以让开发者更好地实现基于":["0.3"],"的数据传输":["0.3"],"构建一个完美的可视化控制界面":["0.3"],"用于填充绘图的渐变对象":["1.3","1.4"],"线性或者放射性":["1.3","1.4"],"css":["1.5","2.2"],"颜色值":["1.5"],"默认是":["1.5"],"属性":["1.6"],"number":["1.7","1.8"],"属性值":["1.7","1.8"],"值":["1.7","1.8"],"描述":["1.7","1.8"],"createlineargradient":["1.10"],"x0":["1.10"],"y0":["1.10"],"x1":["1.10"],"控制它的宽和高":["2.2"],"会造成图片拉伸":["2.2"],"重置设置":["2.2"],"你的浏览器不支持":["2.3"],"请升级浏览器":["2.3"],"浏览器不支持":["2.3"],"显示此行文本":["2.3"],"获取画布":["2.5"],"ctx":["2.5"],"向下增大":["2.7"],"image":["2.7"],"盒子的最左上角":["2.8"],"注意":["2.8"],"核心的作用是将不同绘制的形状进行隔离":["2.10"],"每次执行此方法":["2.10"],"表示重新绘制一个路径":["2.10"],"真正绘制线必须执行":["2.11"],"若计数器的最终值不是0":["2.12"],"那么此区域就在路径里面":["2.12"],"在调用fill":["2.12"],"方法时":["2.12"],"浏览器就会对其进行填充":["2.12"],"width和height都是以像素计":["2.13"],"rect方法只是规划了矩形的路径":["2.13"],"解释":["2.15"],"清除某个矩形内的绘制的内容":["2.15"],"弧度计算公式":["2.16"],"rad":["2.16"],"deg":["2.16"],"math":["2.16"],"pi":["2.16"],"top":["2.18"],"文本基线是em方框的顶端":["2.18"],"hanging":["2.18"],"文本基线是悬挂基线":["2.18"],"middle":["2.18"],"文本基线是em方框的正中":["2.18"],"绘制图片的":["2.21"],"dom":["2.21"],"等比公式":["2.22"],"toh":["2.22"],"tow":["2.22"],"裁剪的左上角坐标":["2.23"],"裁剪图片的宽度":["2.23"],"gif":["2.24"],"alt":["2.24"],"文本信息":["2.24"]},{"6":["2.3","3.2"],"9":["0.1"],"100":["0.3","2.19","3.3"],"180":["2.16"],"md":["0.0"],"也支持":["0.1"],"div":["0.2"],"h1":["0.2"],"等":["0.2"],"图形编辑器":["0.3"],"photoshop":["0.3"],"图形编辑器将能够":["0.3"],"基于":["0.3"],"实现":["0.3"],"用于填充绘图的":["1.3","1.4"],"对象":["1.3","1.4","2.21"],"属性的模糊级别":["1.6"],"正值或者负值":["1.7","1.8"],"定义形状与阴影的水平距离":["1.7"],"定义形状与阴影的垂直距离":["1.8"],"y1":["1.10"],"参数值":["1.10"],"标签的宽高属性会让画布擦除所有的内容":["2.2"],"可以给":["2.2"],"画布设置背景色":["2.2"],"浏览器不兼容":["2.3"],"可以使用":["2.3"],"flash":["2.3"],"等手段进行优雅降级":["2.3"],"注意":["2.5"],"小写":["2.5"],"3d":["2.5"],"webgl":["2.5"],"20240527174058188":["2.7"],"绘制线段钱必须先设置起点":["2.8"],"线头点坐标":["2.9"],"跟之前的绘制的墨迹可以进行分开样式设置和管理":["2.10"],"如果最终值是0":["2.12"],"那么此区域就不在路径内部":["2.12"],"浏览器也就不会对其进行填充了":["2.12"],"img":["2.12"],"并没有填充和描边":["2.13"],"此方法执行完成后":["2.14"],"立即对当前矩形进行fill填充":["2.14"],"相当于橡皮擦":["2.15"],"在math提供的方法中":["2.16"],"sin":["2.16"],"cos等使用的都是弧度":["2.16"],"ideographic":["2.18"],"文本基线是em的基线":["2.18"],"bottom":["2.18"],"文本基线是em方框的底端":["2.18"],"top":["2.19"],"g":["2.19"],"填充文字":["2.19"],"等比":["2.22"],"裁剪图片的高度":["2.23"],"onload":["2.24"],"function":["2.24"],"图片加载完成后":["2.24"],"执行此方法":["2.24"],"fillrect":["3.3"]}]'},t={"0.0":{t:"<!--",p:`
@Date: 2024-05-27 17:01:21
@LastEditTime: 2024-05-27 17:58:25
@Description:
@FilePath: /tutorial/do ...`,l:"canvas/1.入门.html",a:""},"0.1":{t:"1. canvas 简介",p:"​ &lt;canvas&gt;是 html5 新增的，一个可以使用脚本(通常为 JavaScript)在其中绘制图像的 HTML 元素。他可以用来制作照片集或者制作简单的(也不是那么简单)的动画，甚 ...",l:"canvas/1.入门.html#_1-canvas-简介",a:"_1-canvas-简介"},"0.2":{t:"2. 什么是 canvas",p:`
是 HTML5 提供的一个新标签
Canvas 是一个矩形区域的画布，可以用 JavaScript 在上面绘画，控制其每一个像素。
Canvas 标签使用 JavaScript 在网页上绘制图像，其 ...`,l:"canvas/1.入门.html#_2-什么是-canvas",a:"_2-什么是-canvas"},"0.3":{t:"3. Canvas 主要应用的领域(了解)",p:`
游戏：canvas 在基于 Web 的图像显示方面比 Flash 更加立体、更加精巧，canvas 游戏在流畅度和跨平台方面更牛。
25 超棒的 HTML5 Canvas 游戏
可视化数据.数据图表 ...`,l:"canvas/1.入门.html#_3-canvas-主要应用的领域-了解",a:"_3-canvas-主要应用的领域-了解"},"1.0":{t:"# Canvas API",p:"",l:"canvas/2.Canvas API.html",a:"canvas-api"},"1.1":{t:"一、颜色、样式和阴影",p:"",l:"canvas/2.Canvas API.html#一、颜色、样式和阴影",a:"一、颜色、样式和阴影"},"1.2":{t:"属性",p:"",l:"canvas/2.Canvas API.html#属性",a:"属性"},"1.3":{t:"1. fillStyle",p:`作用：设置或返回用于填充绘画的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.fillStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_1-fillstyle",a:"_1-fillstyle"},"1.4":{t:"2. strokeStyle",p:`作用：设置或返回用于笔触的颜色、渐变或模式。
默认值：#000000
JavaScript 语法：context.strokeStyle = color|gradient|pattern;
属性值

 ...`,l:"canvas/2.Canvas API.html#_2-strokestyle",a:"_2-strokestyle"},"1.5":{t:"3. shadowColor",p:`作用：设置或返回用于阴影的颜色
默认值：#000000
JavaScript 语法：context.shadowColor=color;
属性值



值
描述




color
用于阴影的 css ...`,l:"canvas/2.Canvas API.html#_3-shadowcolor",a:"_3-shadowcolor"},"1.6":{t:"4. shadowBlur",p:`作用：设置或返回用于阴影的模糊级别
默认值：
JavaScript 语法：context.shadowBlur=number
属性值



值
属性




number
属性的模糊级别



`,l:"canvas/2.Canvas API.html#_4-shadowblur",a:"_4-shadowblur"},"1.7":{t:"5. shadowOffsetX",p:`作用：设置或返回阴影与形状的水平距离
shadowOffsetX = 0 指示阴影位于形状的正下方
shadowOffsetX = 20 指示阴影位于形状 left 位置右侧的 20 像素处
shad ...`,l:"canvas/2.Canvas API.html#_5-shadowoffsetx",a:"_5-shadowoffsetx"},"1.8":{t:"6. shadowOffsetY",p:`作用：设置或返回阴影与形状的垂直距离
shadowOffsetY = 0 指示阴影位于形状的正下方
shadowOffsetY = 20 指示阴影位于形状 top 位置下方的 20 像素处
shado ...`,l:"canvas/2.Canvas API.html#_6-shadowoffsety",a:"_6-shadowoffsety"},"1.9":{t:"方法",p:"",l:"canvas/2.Canvas API.html#方法",a:"方法"},"1.10":{t:"1. createLineGradient()",p:`作用：创建线性渐变(用在画布内容上)，渐变可用于填充矩形、圆形、线条、文本等等
该对象作为 strokeStyle 或 fillStyle 属性的值，需要配合 addColorStop()方法规定不同 ...`,l:"canvas/2.Canvas API.html#_1-createlinegradient",a:"_1-createlinegradient"},"1.11":{t:"2. createPattern()",p:`作用：在指定的方向上重复制定的元素
`,l:"canvas/2.Canvas API.html#_2-createpattern",a:"_2-createpattern"},"1.12":{t:"3. createRadialGradient()",p:`作用：创建放射状/环形的渐变(用在画布内容上)
`,l:"canvas/2.Canvas API.html#_3-createradialgradient",a:"_3-createradialgradient"},"1.13":{t:"4. addColorStop()",p:`作用：规定渐变对象中的颜色和停止位置
`,l:"canvas/2.Canvas API.html#_4-addcolorstop",a:"_4-addcolorstop"},"2.0":{t:"# Canvas绘图基础",p:"",l:"canvas/2.canvas绘图基础.html",a:"canvas绘图基础"},"2.1":{t:"1. Canvas 标签",p:"",l:"canvas/2.canvas绘图基础.html#_1-canvas-标签",a:"_1-canvas-标签"},"2.2":{t:"1.1 Canvas 标签语法和属性(重点)",p:`canvas：画布油布的意思
标签名 canvas，需要进行闭合。就是一个普通的 html 标签
可以是在 width 和 height 属性，但是属性值单位必须是 px，否则忽略。
width 和  ...`,l:"canvas/2.canvas绘图基础.html#_1-1-canvas-标签语法和属性-重点",a:"_1-1-canvas-标签语法和属性-重点"},"2.3":{t:"1.2 浏览器不兼容处理",p:`

IE9 以上才支持 canvas，其他 chrome、Firefox、苹果浏览器等都支持


只要浏览器兼容 canvas，那么就会支持绝大部分 API(个别最新 api 除外)


移动端的兼容 ...`,l:"canvas/2.canvas绘图基础.html#_1-2-浏览器不兼容处理",a:"_1-2-浏览器不兼容处理"},"2.4":{t:"2 Canvas绘图上下文 Context",p:"",l:"canvas/2.canvas绘图基础.html#_2-canvas绘图上下文-context",a:"_2-canvas绘图上下文-context"},"2.5":{t:"2.1 Context： Canvas 的上下文、绘制环境",p:`上下文：上知天文，下知地理。是所有的绘制操作 api 的入口或者集合。
Canvas 自身无法绘制任何内容。Canvas 的绘图是使用 JavaScript 操作的。
Context 对象就是 Jav ...`,l:"canvas/2.canvas绘图基础.html#_2-1-context-canvas-的上下文、绘制环境",a:"_2-1-context-canvas-的上下文、绘制环境"},"2.6":{t:"3.基本绘制路径",p:"",l:"canvas/2.canvas绘图基础.html#_3-基本绘制路径",a:"_3-基本绘制路径"},"2.7":{t:"3.1 Canvas 坐标系",p:`canvas 坐标系，从最左上角 0,0 开始。x 向右增大，y 向下增大
!image-20240527174058188
`,l:"canvas/2.canvas绘图基础.html#_3-1-canvas-坐标系",a:"_3-1-canvas-坐标系"},"2.8":{t:"3.2设置绘制起始点",p:`ctx.moveTo(x,y)

解释：设置上下文绘制路径的起点。相当于移动画笔到某个位置
参数：x，y都是相对于 canvas 盒子的最左上角
注意：绘制线段钱必须先设置起点
`,l:"canvas/2.canvas绘图基础.html#_3-2设置绘制起始点",a:"_3-2设置绘制起始点"},"2.9":{t:"3.3 绘制直线",p:`ctx.lineTo(x,y)

解释：从x,y的位置绘制一条直线到起点或者上一个线头点。
参数：x,y 线头点坐标。
`,l:"canvas/2.canvas绘图基础.html#_3-3-绘制直线",a:"_3-3-绘制直线"},"2.10":{t:"3.4 路径开始和闭合",p:`开始路径：ctx.beginPath()
闭合路径：ctx.closePath()

解释：如果是绘制不同状态的线段或者形状，必须使用开始新路径的方法把不同的绘制操作隔开。闭合路径会自动把最后的线头和 ...`,l:"canvas/2.canvas绘图基础.html#_3-4-路径开始和闭合",a:"_3-4-路径开始和闭合"},"2.11":{t:"3.5 描边(stroke)",p:`ctx.stroke()

解释：根据路径绘制线，路径只是草稿，真正绘制线必须执行 stroke()
`,l:"canvas/2.canvas绘图基础.html#_3-5-描边-stroke",a:"_3-5-描边-stroke"},"2.12":{t:"3.6 填充(fill)",p:`ctx.fill()

解释：填充，是将闭合路径的内容填充具体的颜色。默认是黑色。
注意：交叉路径的填充问题：&quot;非零环绕原则&quot;，顺逆时针穿插次数决定是否填充。
非零环绕原则
​		 ...`,l:"canvas/2.canvas绘图基础.html#_3-6-填充-fill",a:"_3-6-填充-fill"},"2.13":{t:"3.7 快速创建矩形rect()方法",p:`ctx.rect(x,y,width,height)

解释：x，y是矩形的左上坐标，width和height都是以像素计
rect方法只是规划了矩形的路径，并没有填充和描边。
`,l:"canvas/2.canvas绘图基础.html#_3-7-快速创建矩形rect-方法",a:"_3-7-快速创建矩形rect-方法"},"2.14":{t:"3.8 快速创建描边矩形和填充矩形",p:`ctx.strokeRect(x, y, width, height)


参数同上，注意此方法绘制完路径后立即进行stroke绘制

ctx.fillRect(x, y, width, height ...`,l:"canvas/2.canvas绘图基础.html#_3-8-快速创建描边矩形和填充矩形",a:"_3-8-快速创建描边矩形和填充矩形"},"2.15":{t:"3.9 清除矩形（clearRect）",p:`ctx.clearRect(x, y, width, height)

解释：清除某个矩形内的绘制的内容，相当于橡皮擦
`,l:"canvas/2.canvas绘图基础.html#_3-9-清除矩形-clearrect",a:"_3-9-清除矩形-clearrect"},"2.16":{t:"4. 绘制圆形",p:`概述：arc()方法创建弧/曲线（用于创建圆或部分圆）
语法：ctx.arc(x, y, sAngle, eAngle, counterclockwise)
解释：
- x,y：圆心坐标，
- r：半 ...`,l:"canvas/2.canvas绘图基础.html#_4-绘制圆形",a:"_4-绘制圆形"},"2.17":{t:"5. 绘制文字",p:"",l:"canvas/2.canvas绘图基础.html#_5-绘制文字",a:"_5-绘制文字"},"2.18":{t:"5.1 绘制上下文的文字属性",p:`

font：设置或返回文本内容的当前字体属性
font属性使用的语法和css font属性相同
ctx.font=&quot;18px 微软雅黑&quot;



textAlign： 设置或者返回 ...`,l:"canvas/2.canvas绘图基础.html#_5-1-绘制上下文的文字属性",a:"_5-1-绘制上下文的文字属性"},"2.19":{t:"5.2 上下文绘制文字的方法",p:`ctx.fillText() ：在画布上绘制被填充的文本
ctx.strokeText()：在画布上绘制文本（无填充）
ctx.measureText()：返回包含指定文本宽度的对象
//综合案例代码 ...`,l:"canvas/2.canvas绘图基础.html#_5-2-上下文绘制文字的方法",a:"_5-2-上下文绘制文字的方法"},"2.20":{t:"6. 绘制图片(drawImage)",p:"",l:"canvas/2.canvas绘图基础.html#_6-绘制图片-drawimage",a:"_6-绘制图片-drawimage"},"2.21":{t:"6.1 基本绘制图片的方式",p:`ctx.drawImage(img, x, y)

x, y：绘制图片左上角的坐标
img：绘制图片的 dom 对象
`,l:"canvas/2.canvas绘图基础.html#_6-1-基本绘制图片的方式",a:"_6-1-基本绘制图片的方式"},"2.22":{t:"6.2 在画布上绘制图像，并规定图像的宽高",p:`ctx.drawImage(img, x, y, width, height)

参数说明

width：绘制图片的宽度
height：绘制图片的高度

如果指定宽高，最好成比例，不然图片会被拉伸
等 ...`,l:"canvas/2.canvas绘图基础.html#_6-2-在画布上绘制图像-并规定图像的宽高",a:"_6-2-在画布上绘制图像-并规定图像的宽高"},"2.23":{t:"6.3 图片裁剪，并在画布上定位被剪切的部分",p:`ctx.drawImage(img, sx, sy, swidth, sheight, x, y, width, height)

参数说明

sx, sy：裁剪的左上角坐标
swidth：裁剪图片的 ...`,l:"canvas/2.canvas绘图基础.html#_6-3-图片裁剪-并在画布上定位被剪切的部分",a:"_6-3-图片裁剪-并在画布上定位被剪切的部分"},"2.24":{t:"6.4 用 JavaScript 创建 img 对象",p:`第一种方式：
var img = document.getElementById('imgId')

第二种方式：
var img = new Image(); // 这个就是 img 标签的 dom ...`,l:"canvas/2.canvas绘图基础.html#_6-4-用-javascript-创建-img-对象",a:"_6-4-用-javascript-创建-img-对象"},"3.0":{t:"# Canvas 进阶",p:"",l:"canvas/3.canvas进阶.html",a:"canvas-进阶"},"3.1":{t:"1. Canvas颜色样式和阴影",p:"",l:"canvas/3.canvas进阶.html#_1-canvas颜色样式和阴影",a:"_1-canvas颜色样式和阴影"},"3.2":{t:"1.1 设置填充色和描边的颜色",p:`
fillStyle：设置或返回用于填充绘画的颜色
strokeStyle：设置或返回用于笔触的颜色

以上两个值都可以接受颜色名、16 进制数据、rgb 值，甚至 rgba。一般先进行设置样式然后进 ...`,l:"canvas/3.canvas进阶.html#_1-1-设置填充色和描边的颜色",a:"_1-1-设置填充色和描边的颜色"},"3.3":{t:"1.2 设置阴影",p:`类比于 CSS3 的阴影
- shadowColor：设置或返回用于阴影的颜色
- shadowBlur：设置或返回用于阴影的模糊级别，大于 1 的正整数，数值越高，模糊程度越大
- shadowOf ...`,l:"canvas/3.canvas进阶.html#_1-2-设置阴影",a:"_1-2-设置阴影"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},e={INDEX_DATA:a,PREVIEW_LOOKUP:t,Options:n};export{e as default};
