const a={map:'[{"canvas绘图基础":["1.0"]},{"1":["0.1","0.3","1.1","1.2","1.3","1.5","1.7","1.18"],"2":["0.2","1.3","1.4","1.5","1.19"],"3":["0.3","1.6","1.7","1.8","1.9","1.10","1.11","1.12","1.13","1.14","1.15"],"4":["1.10","1.16"],"5":["1.17","1.18","1.19"],"6":["1.12"],"7":["1.13"],"8":["1.14"],"2024":["0.0"],"date":["0.0"],"05":["0.0"],"canvas":["0.1","0.2","0.3","1.2","1.5"],"简介":["0.1"],"是":["0.1","0.2"],"html5":["0.1"],"新增的":["0.1"],"一个可以使用脚本":["0.1"],"什么是":["0.2"],"主要应用的领域":["0.3"],"了解":["0.3"],"游戏":["0.3"],"在基于":["0.3"],"标签语法和属性":["1.2"],"重点":["1.2"],"浏览器不兼容处理":["1.3"],"ie9":["1.3"],"以上才支持":["1.3"],"context":["1.5"],"的上下文":["1.5"],"绘制环境":["1.5"],"2设置绘制起始点":["1.8"],"填充":["1.12"],"fill":["1.12"],"js":["1.12"],"绘制圆形":["1.16"],"概述":["1.16"],"arc":["1.16"],"方法创建弧":["1.16"],"绘制上下文的文字属性":["1.18"],"font":["1.18"],"设置或返回文本内容的当前字体属性":["1.18"],"上下文绘制文字的方法":["1.19"],"ctx":["1.19"],"filltext":["1.19"],"在画布上绘制被填充的文本":["1.19"]},{"5":["1.11"],"9":["1.15"],"17":["0.0"],"25":["0.3"],"27":["0.0"],"01":["0.0"],"通常为":["0.1"],"javascript":["0.1"],"在其中绘制图像的":["0.1"],"html":["0.1"],"元素":["0.1"],"他可以用来制作照片集或者制作简单的":["0.1"],"也不是那么简单":["0.1"],"的动画":["0.1"],"html5":["0.2"],"提供的一个新标签":["0.2"],"是一个矩形区域的画布":["0.2"],"web":["0.3"],"的图像显示方面比":["0.3"],"flash":["0.3"],"更加立体":["0.3"],"更加精巧":["0.3"],"游戏在流畅度和跨平台方面更牛":["0.3"],"canvas":["1.1","1.3","1.7"],"画布油布的意思":["1.2"],"标签名":["1.2"],"需要进行闭合":["1.2"],"其他":["1.3"],"chrome":["1.3"],"firefox":["1.3"],"苹果浏览器等都支持":["1.3"],"canvas绘图上下文":["1.4"],"上下文":["1.5"],"上知天文":["1.5"],"下知地理":["1.5"],"是所有的绘制操作":["1.5"],"api":["1.5"],"的入口或者集合":["1.5"],"基本绘制路径":["1.6"],"坐标系":["1.7"],"js":["1.8","1.9","1.10","1.14","1.18"],"ctx":["1.8","1.12","1.14","1.16","1.18"],"绘制直线":["1.9"],"路径开始和闭合":["1.10"],"开始路径":["1.10"],"描边":["1.11"],"解释":["1.12"],"是将闭合路径的内容填充具体的颜色":["1.12"],"快速创建矩形rect":["1.13"],"方法":["1.13"],"快速创建描边矩形和填充矩形":["1.14"],"清除矩形":["1.15"],"曲线":["1.16"],"用于创建圆或部分圆":["1.16"],"语法":["1.16"],"绘制文字":["1.17"],"font属性使用的语法和css":["1.18"],"font属性相同":["1.18"],"18px":["1.18"],"stroketext":["1.19"],"在画布上绘制文本":["1.19"],"无填充":["1.19"],"measuretext":["1.19"]},{"2":["0.3","1.18"],"21":["0.0"],"300":["1.19"],"lastedittime":["0.0"],"甚至可以进行实时视频处理和渲染":["0.1"],"它最初由苹果内部使用自己":["0.1"],"macos":["0.1"],"x":["0.1","1.8","1.14","1.16"],"webkit":["0.1"],"推出":["0.1"],"供应用程序使用像仪表盘的构建和":["0.1"],"safari":["0.1"],"浏览器使用":["0.1"],"可以用":["0.2"],"javascript":["0.2","1.5","1.19"],"在上面绘画":["0.2"],"控制其每一个像素":["0.2"],"超棒的":["0.3"],"html5":["0.3"],"可视化数据":["0.3"],"数据图表话":["0.3"],"比如":["0.3"],"标签":["1.1","1.2"],"就是一个普通的":["1.2"],"html":["1.2"],"可以是在":["1.2"],"width":["1.2"],"只要浏览器兼容":["1.3"],"那么就会支持绝大部分":["1.3"],"api":["1.3"],"个别最新":["1.3"],"context":["1.4"],"自身无法绘制任何内容":["1.5"],"的绘图是使用":["1.5"],"操作的":["1.5"],"moveto":["1.8","1.19"],"y":["1.8","1.14","1.16"],"ctx":["1.9","1.10","1.13"],"lineto":["1.9"],"beginpath":["1.10"],"stroke":["1.11"],"js":["1.11","1.13","1.15"],"默认是黑色":["1.12"],"注意":["1.12"],"交叉路径的填充问题":["1.12"],"非零环绕原则":["1.12"],"顺逆时针穿插次数决定是否填充":["1.12"],"rect":["1.13"],"strokerect":["1.14"],"clearrect":["1.15"],"sangle":["1.16"],"eangle":["1.16"],"counterclockwise":["1.16"],"解释":["1.16"],"微软雅黑":["1.18"],"textalign":["1.18"],"设置或者返回文本内容当前的对其方式":["1.18"],"start":["1.18"],"默认":["1.18"],"文本在指定的位置开始":["1.18"],"返回包含指定文本宽度的对象":["1.19"],"综合案例代码":["1.19"]},{"0":["1.7"],"3":["1.3"],"4":["1.3"],"后来":["0.1"],"有人通过":["0.1"],"gecko":["0.1"],"内核的浏览器":["0.1"],"尤其是":["0.1"],"mozilla":["0.1"],"和":["0.1","1.2"],"firefox":["0.1"],"标签使用":["0.2"],"在网页上绘制图像":["0.2"],"百度的":["0.3"],"echart":["0.3"],"banner":["0.3"],"广告":["0.3"],"曾经辉煌的时代":["0.3"],"智能手机还未曾出现":["0.3"],"height":["1.2","1.14"],"属性":["1.2"],"但是":["1.2"],"属性值单位必须是":["1.2"],"除外":["1.3"],"移动端的兼容情况非常理想":["1.3"],"基本上随便使用":["1.3"],"2d":["1.3"],"对象就是":["1.5"],"操作":["1.5"],"的接口":["1.5"],"从最左上角":["1.7"],"解释":["1.8"],"设置上下文绘制路径的起点":["1.8"],"x":["1.9","1.13"],"y":["1.9","1.13"],"闭合路径":["1.10"],"closepath":["1.10"],"ctx":["1.11","1.15"],"非零环绕规则":["1.12"],"是这么来判断有自我交叉情况的路径的":["1.12"],"对于路径中的任意给定区域":["1.12"],"从该区域内部画一条足够长的线段":["1.12"],"width":["1.14"],"参数同上":["1.14"],"圆心坐标":["1.16"],"r":["1.16"],"半径":["1.16"],"end":["1.18"],"文本在指定的位置结束":["1.18"],"center":["1.18"],"文本的中心被放在指定的位置":["1.18"],"left":["1.18"],"文本左对齐":["1.18"],"fillstyle":["1.19"],"purple":["1.19"],"设置填充颜色为紫色":["1.19"]},{"4":["0.3"],"5":["1.3"],"25":["0.0"],"58":["0.0"],"description":["0.0"],"opera":["0.1"],"chrome":["0.1"],"和超文本网络应用技术工作组建议为下一代的网络技术使用该元素":["0.1"],"是由":["0.1"],"代码配合高度和宽度属性而定义出的可绘制区域":["0.1"],"其本身不具备绘图功能":["0.2"],"拥有多种绘制路径":["0.2"],"矩形":["0.2"],"现在以及未来的智能机时代":["0.3"],"技术能够在":["0.3"],"广告上发挥巨大作用":["0.3"],"用":["0.3"],"实现动态的广告效果再合适不过":["0.3"],"px":["1.2"],"否则忽略":["1.2"],"的支持都非常好":["1.3"],"3d":["1.3"],"webgl":["1.3"],"ie11":["1.3"],"才支持":["1.3"],"其他都支持":["1.3"],"使用":["1.5"],"canvaselement":["1.5"],"getcontext":["1.5"],"2d":["1.5"],"来获取":["1.5"],"绘图上下文":["1.5"],"开始":["1.7"],"x":["1.7","1.15"],"相当于移动画笔到某个位置":["1.8"],"参数":["1.8"],"解释":["1.9","1.10","1.11"],"从x":["1.9"],"如果是绘制不同状态的线段或者形状":["1.10"],"必须使用开始新路径的方法把不同的绘制操作隔开":["1.10"],"使此线段的终点完全落在路径范围之外":["1.12"],"下图中的那三个箭头所描述的就是上面这个步骤":["1.12"],"接下来":["1.12"],"将计数器初始化为0":["1.12"],"然后":["1.12"],"每当这条线段与路径上的直线或曲线相交时":["1.12"],"width":["1.13"],"height":["1.13"],"注意此方法绘制完路径后立即进行stroke绘制":["1.14"],"y":["1.15"],"绘制开始的角度":["1.16"],"圆心到最右边是0度":["1.16"],"顺时针方向弧度增大":["1.16"],"right":["1.18"],"文本右对齐":["1.18"],"font":["1.19"],"20px":["1.19"],"微软雅黑":["1.19"],"设置字体":["1.19"],"textbaseline":["1.19"],"bottom":["1.19"]},{"3":["1.18"],"5":["0.3"],"8":["0.1"],"300":["1.2"],"filepath":["0.0"],"tutorial":["0.0"],"docs":["0.0"],"代码可以访问该区域":["0.1"],"类似于其他通用的二位":["0.1"],"api":["0.1"],"通过一套完整的绘图函数来动态生成图像":["0.1"],"程序从":["0.1"],"gecko1":["0.1"],"圆形":["0.2"],"字符以及添加图像的方法":["0.2"],"之前":["0.2"],"未来":["0.3"],"模拟器":["0.3"],"无论从视觉效果还是核心功能方面来说":["0.3"],"模拟器产品可以完全由":["0.3"],"javascript":["0.3"],"来实现":["0.3"],"默认是":["1.2"],"150像素":["1.2"],"注意":["1.2"],"不要用":["1.2"],"如果浏览器不兼容":["1.3"],"最好进行友好提示":["1.3"],"html":["1.3"],"id":["1.3"],"cavselm":["1.3","1.5"],"js":["1.5"],"var":["1.5"],"document":["1.5"],"getelementbyid":["1.5"],"向右增大":["1.7"],"y":["1.7"],"y都是相对于":["1.8"],"canvas":["1.8"],"y的位置绘制一条直线到起点或者上一个线头点":["1.9"],"参数":["1.9"],"闭合路径会自动把最后的线头和开始的线头连在一起":["1.10"],"根据路径绘制线":["1.11"],"路径只是草稿":["1.11"],"就改变计数器的值":["1.12"],"如果是与路径的顺时针部分相交":["1.12"],"则加1":["1.12"],"如果是与路径的逆时针部分相交":["1.12"],"则减1":["1.12"],"解释":["1.13"],"y是矩形的左上坐标":["1.13"],"fillrect":["1.14"],"width":["1.15"],"height":["1.15"],"绘制结束的角度":["1.16"],"注意是弧度":["1.16"],"是否是逆时针":["1.16"],"true是逆时针":["1.16"],"false是顺时针":["1.16"],"img":["1.18"],"textbaseline":["1.18"],"设置或返回文本当在绘制文本时使用的当前文本基线":["1.18"],"alphabetic":["1.18"],"文本基线是普通的字母基线":["1.18"],"设置字体底线对齐绘制基线":["1.19"],"textalign":["1.19"],"left":["1.19"],"设置字体对齐的方式":["1.19"]},{"1":["0.0"],"5":["0.1"],"6":["0.3"],"400":["1.19"],"450":["1.19"],"canvas":["0.0"],"入门":["0.0"],"firefox1":["0.1"],"开始支持":["0.1"],"internet":["0.1"],"explorer":["0.1"],"从":["0.1"],"ie9":["0.1"],"web":["0.2"],"页面只能用一些固定样式的标签":["0.2"],"比如":["0.2"],"p":["0.2"],"远程计算机控制":["0.3"],"可以让开发者更好地实现基于":["0.3"],"的数据传输":["0.3"],"构建一个完美的可视化控制界面":["0.3"],"css":["1.2"],"控制它的宽和高":["1.2"],"会造成图片拉伸":["1.2"],"重置设置":["1.2"],"你的浏览器不支持":["1.3"],"请升级浏览器":["1.3"],"浏览器不支持":["1.3"],"显示此行文本":["1.3"],"获取画布":["1.5"],"ctx":["1.5"],"向下增大":["1.7"],"image":["1.7"],"盒子的最左上角":["1.8"],"注意":["1.8"],"核心的作用是将不同绘制的形状进行隔离":["1.10"],"每次执行此方法":["1.10"],"表示重新绘制一个路径":["1.10"],"真正绘制线必须执行":["1.11"],"若计数器的最终值不是0":["1.12"],"那么此区域就在路径里面":["1.12"],"在调用fill":["1.12"],"方法时":["1.12"],"浏览器就会对其进行填充":["1.12"],"width和height都是以像素计":["1.13"],"rect方法只是规划了矩形的路径":["1.13"],"解释":["1.15"],"清除某个矩形内的绘制的内容":["1.15"],"弧度计算公式":["1.16"],"rad":["1.16"],"deg":["1.16"],"math":["1.16"],"pi":["1.16"],"top":["1.18"],"文本基线是em方框的顶端":["1.18"],"hanging":["1.18"],"文本基线是悬挂基线":["1.18"],"middle":["1.18"],"文本基线是em方框的正中":["1.18"]},{"6":["1.3"],"9":["0.1"],"100":["0.3","1.19"],"180":["1.16"],"md":["0.0"],"也支持":["0.1"],"div":["0.2"],"h1":["0.2"],"等":["0.2"],"图形编辑器":["0.3"],"photoshop":["0.3"],"图形编辑器将能够":["0.3"],"基于":["0.3"],"实现":["0.3"],"标签的宽高属性会让画布擦除所有的内容":["1.2"],"可以给":["1.2"],"画布设置背景色":["1.2"],"浏览器不兼容":["1.3"],"可以使用":["1.3"],"flash":["1.3"],"等手段进行优雅降级":["1.3"],"注意":["1.5"],"小写":["1.5"],"3d":["1.5"],"webgl":["1.5"],"20240527174058188":["1.7"],"绘制线段钱必须先设置起点":["1.8"],"线头点坐标":["1.9"],"跟之前的绘制的墨迹可以进行分开样式设置和管理":["1.10"],"如果最终值是0":["1.12"],"那么此区域就不在路径内部":["1.12"],"浏览器也就不会对其进行填充了":["1.12"],"img":["1.12"],"并没有填充和描边":["1.13"],"此方法执行完成后":["1.14"],"立即对当前矩形进行fill填充":["1.14"],"相当于橡皮擦":["1.15"],"在math提供的方法中":["1.16"],"sin":["1.16"],"cos等使用的都是弧度":["1.16"],"ideographic":["1.18"],"文本基线是em的基线":["1.18"],"bottom":["1.18"],"文本基线是em方框的底端":["1.18"],"top":["1.19"],"g":["1.19"],"填充文字":["1.19"]}]'},t={"0.0":{t:"<!--\r",p:`
@Date: 2024-05-27 17:01:21
@LastEditTime: 2024-05-27 17:58:25
@Description:
@FilePath: /tutorial/do ...`,l:"canvas/1.入门.html",a:""},"0.1":{t:"1. canvas 简介\r",p:"​ &lt;canvas&gt;是 html5 新增的，一个可以使用脚本(通常为 JavaScript)在其中绘制图像的 HTML 元素。他可以用来制作照片集或者制作简单的(也不是那么简单)的动画，甚 ...",l:"canvas/1.入门.html#_1-canvas-简介",a:"_1-canvas-简介"},"0.2":{t:"2. 什么是 canvas\r",p:`
是 HTML5 提供的一个新标签
Canvas 是一个矩形区域的画布，可以用 JavaScript 在上面绘画，控制其每一个像素。
Canvas 标签使用 JavaScript 在网页上绘制图像，其 ...`,l:"canvas/1.入门.html#_2-什么是-canvas",a:"_2-什么是-canvas"},"0.3":{t:"3. Canvas 主要应用的领域(了解)\r",p:`
游戏：canvas 在基于 Web 的图像显示方面比 Flash 更加立体、更加精巧，canvas 游戏在流畅度和跨平台方面更牛。
25 超棒的 HTML5 Canvas 游戏
可视化数据.数据图表 ...`,l:"canvas/1.入门.html#_3-canvas-主要应用的领域-了解",a:"_3-canvas-主要应用的领域-了解"},"1.0":{t:"# Canvas绘图基础\r",p:"\r",l:"canvas/2.canvas绘图基础.html",a:"canvas绘图基础"},"1.1":{t:"1. Canvas 标签\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_1-canvas-标签",a:"_1-canvas-标签"},"1.2":{t:"1.1 Canvas 标签语法和属性(重点)\r",p:`canvas：画布油布的意思
标签名 canvas，需要进行闭合。就是一个普通的 html 标签
可以是在 width 和 height 属性，但是属性值单位必须是 px，否则忽略。
width 和  ...`,l:"canvas/2.canvas绘图基础.html#_1-1-canvas-标签语法和属性-重点",a:"_1-1-canvas-标签语法和属性-重点"},"1.3":{t:"1.2 浏览器不兼容处理\r",p:`

IE9 以上才支持 canvas，其他 chrome、Firefox、苹果浏览器等都支持


只要浏览器兼容 canvas，那么就会支持绝大部分 API(个别最新 api 除外)


移动端的兼容 ...`,l:"canvas/2.canvas绘图基础.html#_1-2-浏览器不兼容处理",a:"_1-2-浏览器不兼容处理"},"1.4":{t:"2 Canvas绘图上下文 Context\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_2-canvas绘图上下文-context",a:"_2-canvas绘图上下文-context"},"1.5":{t:"2.1 Context： Canvas 的上下文、绘制环境\r",p:`上下文：上知天文，下知地理。是所有的绘制操作 api 的入口或者集合。
Canvas 自身无法绘制任何内容。Canvas 的绘图是使用 JavaScript 操作的。
Context 对象就是 Jav ...`,l:"canvas/2.canvas绘图基础.html#_2-1-context-canvas-的上下文、绘制环境",a:"_2-1-context-canvas-的上下文、绘制环境"},"1.6":{t:"3.基本绘制路径\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_3-基本绘制路径",a:"_3-基本绘制路径"},"1.7":{t:"3.1 Canvas 坐标系\r",p:`canvas 坐标系，从最左上角 0,0 开始。x 向右增大，y 向下增大
!image-20240527174058188
`,l:"canvas/2.canvas绘图基础.html#_3-1-canvas-坐标系",a:"_3-1-canvas-坐标系"},"1.8":{t:"3.2设置绘制起始点\r",p:`ctx.moveTo(x,y)

解释：设置上下文绘制路径的起点。相当于移动画笔到某个位置
参数：x，y都是相对于 canvas 盒子的最左上角
注意：绘制线段钱必须先设置起点
`,l:"canvas/2.canvas绘图基础.html#_3-2设置绘制起始点",a:"_3-2设置绘制起始点"},"1.9":{t:"3.3 绘制直线\r",p:`ctx.lineTo(x,y)

解释：从x,y的位置绘制一条直线到起点或者上一个线头点。
参数：x,y 线头点坐标。
`,l:"canvas/2.canvas绘图基础.html#_3-3-绘制直线",a:"_3-3-绘制直线"},"1.10":{t:"3.4 路径开始和闭合\r",p:`开始路径：ctx.beginPath()
闭合路径：ctx.closePath()

解释：如果是绘制不同状态的线段或者形状，必须使用开始新路径的方法把不同的绘制操作隔开。闭合路径会自动把最后的线头和 ...`,l:"canvas/2.canvas绘图基础.html#_3-4-路径开始和闭合",a:"_3-4-路径开始和闭合"},"1.11":{t:"3.5 描边(stroke)\r",p:`ctx.stroke()

解释：根据路径绘制线，路径只是草稿，真正绘制线必须执行 stroke()
`,l:"canvas/2.canvas绘图基础.html#_3-5-描边-stroke",a:"_3-5-描边-stroke"},"1.12":{t:"3.6 填充(fill)\r",p:`ctx.fill()

解释：填充，是将闭合路径的内容填充具体的颜色。默认是黑色。
注意：交叉路径的填充问题：&quot;非零环绕原则&quot;，顺逆时针穿插次数决定是否填充。
非零环绕原则
​		 ...`,l:"canvas/2.canvas绘图基础.html#_3-6-填充-fill",a:"_3-6-填充-fill"},"1.13":{t:"3.7 快速创建矩形rect()方法\r",p:`ctx.rect(x,y,width,height)

解释：x，y是矩形的左上坐标，width和height都是以像素计
rect方法只是规划了矩形的路径，并没有填充和描边。
`,l:"canvas/2.canvas绘图基础.html#_3-7-快速创建矩形rect-方法",a:"_3-7-快速创建矩形rect-方法"},"1.14":{t:"3.8 快速创建描边矩形和填充矩形\r",p:`ctx.strokeRect(x, y, width, height)


参数同上，注意此方法绘制完路径后立即进行stroke绘制

ctx.fillRect(x, y, width, height ...`,l:"canvas/2.canvas绘图基础.html#_3-8-快速创建描边矩形和填充矩形",a:"_3-8-快速创建描边矩形和填充矩形"},"1.15":{t:"3.9 清除矩形（clearRect）\r",p:`ctx.clearRect(x, y, width, height)

解释：清除某个矩形内的绘制的内容，相当于橡皮擦
`,l:"canvas/2.canvas绘图基础.html#_3-9-清除矩形-clearrect",a:"_3-9-清除矩形-clearrect"},"1.16":{t:"4. 绘制圆形\r",p:`概述：arc()方法创建弧/曲线（用于创建圆或部分圆）
语法：ctx.arc(x, y, sAngle, eAngle, counterclockwise)
解释：
- x,y：圆心坐标，
- r：半 ...`,l:"canvas/2.canvas绘图基础.html#_4-绘制圆形",a:"_4-绘制圆形"},"1.17":{t:"5. 绘制文字\r",p:"\r",l:"canvas/2.canvas绘图基础.html#_5-绘制文字",a:"_5-绘制文字"},"1.18":{t:"5.1 绘制上下文的文字属性\r",p:`

font：设置或返回文本内容的当前字体属性
font属性使用的语法和css font属性相同
ctx.font=&quot;18px 微软雅黑&quot;



textAlign： 设置或者返回 ...`,l:"canvas/2.canvas绘图基础.html#_5-1-绘制上下文的文字属性",a:"_5-1-绘制上下文的文字属性"},"1.19":{t:"5.2 上下文绘制文字的方法\r",p:`ctx.fillText() ：在画布上绘制被填充的文本
ctx.strokeText()：在画布上绘制文本（无填充）
ctx.measureText()：返回包含指定文本宽度的对象
//综合案例代码 ...`,l:"canvas/2.canvas绘图基础.html#_5-2-上下文绘制文字的方法",a:"_5-2-上下文绘制文字的方法"}},n={previewLength:100,buttonLabel:"搜索",placeholder:"请输入关键词",allow:[],ignore:[]},c={INDEX_DATA:a,PREVIEW_LOOKUP:t,Options:n};export{c as default};
